docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-18 Fri 14:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Advent of Code: 2021</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prashanth Kumar" />
<link rel="stylesheet" type="text/css" href="org.css"/>


</head>
<body>
<div id="content">
<h1 class="title">Advent of Code: 2021</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ef1387">About</a></li>
<li><a href="#orgf2a86d2">Day 01: Sonar Sweep</a></li>
<li><a href="#org84e47c1">Day 02: Dive!</a></li>
<li><a href="#orgc222043">Day 03: Binary Diagnostic</a></li>
<li><a href="#org769e0b1">Day 04: Giant Squid</a></li>
<li><a href="#org85f9935">Day 05: Hydrothermal Venture</a></li>
<li><a href="#org94490a0">Day 06: Lanternfish</a></li>
<li><a href="#org405ecce">Day 07: The Treachery of Whales</a></li>
<li><a href="#org03abd83">Day 08: Seven Segment Search</a></li>
<li><a href="#org2ad00a6">Day 09: Smoke Basin</a></li>
<li><a href="#orgf0092ed">Day 10: Syntax Scoring</a></li>
<li><a href="#orge342bbe">Day 11: Dumbo Octopus</a></li>
<li><a href="#orgad1843f">Day 12: Passage Pathing</a></li>
<li><a href="#orgc6f10dc">Day 13: Transparent Origami</a></li>
<li><a href="#org82096b9">Day 14: Extended Polymerization</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8ef1387" class="outline-2">
<h2 id="org8ef1387">About</h2>
<div class="outline-text-2" id="text-org8ef1387">
<p>
Solutions to <a href="https://adventofcode.com/2021">Advent of Code: 2021</a> in the array programming language <a href="https://www.jsoftware.com/#/">J</a>. 
</p>

<p>
Language and IDE details,
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Engine</td>
<td class="org-left"><b>j901/j64/linux</b></td>
</tr>

<tr>
<td class="org-left">Release-c</td>
<td class="org-left"><b>commercial/2020-01-11T10:39:00</b></td>
</tr>

<tr>
<td class="org-left">Library</td>
<td class="org-left"><b>9.01.24</b></td>
</tr>

<tr>
<td class="org-left">Qt IDE</td>
<td class="org-left"><b>1.8.7/5.7.1(5.9.5)</b></td>
</tr>

<tr>
<td class="org-left">Platform</td>
<td class="org-left"><b>Linux 64</b></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org0f72158" class="outline-3">
<h3 id="org0f72158">Conventions</h3>
<div class="outline-text-3" id="text-org0f72158">
</div>
<div id="outline-container-org6af75cb" class="outline-4">
<h4 id="org6af75cb">General</h4>
<div class="outline-text-4" id="text-org6af75cb">
<div class="note">
<p>
Before we start, I should point out a convention of J: if a dyadic verb is asymmetric, 
for mnemonic purposes you should think of x as operating on y.  One way to express this is to say that x is control 
information and y is data.  Another way is to say that if you were applying the verb many times, you would expect to 
apply the same x to different ys rather than the other way around.
</p>

<p>
&#x2013; <a href="https://www.jsoftware.com/help/jforc/more_verbs.htm">https://www.jsoftware.com/help/jforc/more_verbs.htm</a>
</p>

</div>
</div>
</div>

<div id="outline-container-org440928e" class="outline-4">
<h4 id="org440928e">Naming</h4>
<div class="outline-text-4" id="text-org440928e">
<ul class="org-ul">
<li>All variable and function names are lower case and do <i>not</i> include any underscores</li>
<li>All variable and function names, in tacit and explicit definitions, are at least two characters long to avoid confusion with 
built-in single character J verbs. Exceptions to this are for variables defined in,
<ul class="org-ul">
<li>Single line quoted expressions</li>
<li>Anonymous verbs</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org93df1d7" class="outline-4">
<h4 id="org93df1d7">AOC specific</h4>
<div class="outline-text-4" id="text-org93df1d7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Convention</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>getin</code></td>
<td class="org-left">Monadic function</td>
<td class="org-left">Read and process data from input file</td>
<td class="org-left"><code>getin =: ;: readin</code></td>
</tr>

<tr>
<td class="org-left"><code>in</code></td>
<td class="org-left">Variable</td>
<td class="org-left">Input data for problem</td>
<td class="org-left"><code>in =: getin 'inputs/day-01.txt'</code></td>
</tr>

<tr>
<td class="org-left"><code>inx</code>; <code>inx1</code>; <code>inx2</code>; <code>...</code></td>
<td class="org-left">Variable(s)</td>
<td class="org-left">Example input data for problem</td>
<td class="org-left"><code>inx =: getin 'inpus/day-01-example.txt'</code></td>
</tr>

<tr>
<td class="org-left"><code>part1</code>; <code>part2</code></td>
<td class="org-left">Monadic functions</td>
<td class="org-left">Solutions to respective parts of problems with <code>y = data</code></td>
<td class="org-left"><code>part1 in</code></td>
</tr>
</tbody>
</table>

<div class="attention">
<p>
General functions that would be useful beyond the scope of the solution are indicated with the ❖ symbol.
</p>

</div>

<p>
The approach to formulating solutions is as follows,
</p>

<ul class="org-ul">
<li>To the extent possible, function definitions are general enough for use in both parts of the problem.</li>
<li>Each part should be independently executable, that is, it should not rely on any results from the other part.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org732f1d6" class="outline-3">
<h3 id="org732f1d6">Site</h3>
<div class="outline-text-3" id="text-org732f1d6">
<p>
This site was generated using <b>Emacs 26.3</b> with <b>Org mode 9.1.9</b>. A custom CSS and <a href="https://orgmode.org/worg/code/org-info-js/">Org-Info.JS</a> were used to style the exported HTML.
</p>

<p>
This site is best viewed with <a href="https://fonts.google.com/specimen/Fira+Sans">Fira Sans</a> and <a href="https://fonts.google.com/specimen/Fira+Code">Fira Code</a> fonts.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf2a86d2" class="outline-2">
<h2 id="orgf2a86d2"><a href="https://adventofcode.com/2021/day/1">Day 01: Sonar Sweep</a></h2>
<div class="outline-text-2" id="text-orgf2a86d2">
<div id="text-table-of-contents">
<ul>
<li><a href="#org2a2c511">Setup</a></li>
<li><a href="#org3826e0d">Read data</a></li>
<li><a href="#org73ea36d">General function definition</a></li>
<li><a href="#org4ee3d47">Part 1</a>
<ul>
<li><a href="#orgb58ff48">Function definition</a></li>
<li><a href="#orgb3970b6">Test</a></li>
<li><a href="#orge72d807">Solution</a></li>
</ul>
</li>
<li><a href="#org8bebb76">Part 2</a>
<ul>
<li><a href="#org05f8c19">Function definition</a></li>
<li><a href="#org2ef941a">Test</a></li>
<li><a href="#org6e41a80">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2a2c511" class="outline-3">
<h3 id="org2a2c511">Setup</h3>
<div class="outline-text-3" id="text-org2a2c511">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day01'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3826e0d" class="outline-3">
<h3 id="org3826e0d">Read data</h3>
<div class="outline-text-3" id="text-org3826e0d">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">".</span> readin
</pre>
</div>
</div>
</div>

<div id="outline-container-org73ea36d" class="outline-3">
<h3 id="org73ea36d">General function definition</h3>
<div class="outline-text-3" id="text-org73ea36d">
<p>
Generic function to calculate number of increases in data for a given moving window size,
</p>
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Calculate number of increases</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = data</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = moving window size</span>
<span style="color: #BA36A5;">ninc</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #0000ff;">@</span> (2 <span style="color: #ff0000;">&lt;</span><span style="color: #00ff00;">/\</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/\</span>)
</pre>
</div>
</div>
</div>
