solutions.org
**** Solution

#+BEGIN_SRC j :results output value :tangle src/day01.ijs
assert 1602 = part1 in=. getin 'inputs/day-01.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day01.ijs
part2=: 3&ninc
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day01.ijs
assert 7 = part1 inx=. getin 'inputs/day-01-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day01.ijs
assert 1633 = part2 in=. getin 'inputs/day-01.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/2][Day 02: Dive!]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day02'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day02.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day02.ijs
getin=: ;: readin
#+END_SRC

*** General function definition


***** Directions

#+BEGIN_SRC j :results output silent :tangle src/day02.ijs
NB. Displacement vectors
NB. y = input
NB. Returns three column boolean mask matrix of size (|. $ y)
NB. for each direction
dirxns=: ('forward'; 'up'; 'down') E./"0 1 {."1
#+END_SRC

***** Displacements

#+BEGIN_SRC j :results output silent :tangle src/day02.ijs
NB. Horizontal and vertical displacement vectors
NB. y = input
NB. Returns two column matrix
NB.   - Column 1 = horizonal displacement = forward
NB.   - Column 2 = vertical displacement = down - up
disp=: [: ({. ,. [: -/|.@}.) (".@>@{:"1@]) *"1 dirxns
#+END_SRC

Reading from right to left, =disp= works as follows,

+ =(".@>@{:"1@]) *"1 dirxns=: Displacements corresponding to each direction.
+ =({. ,. [: -/|.@}.)=: Forward (horizontal) stitched with vertical, =down - up=, displacement.

#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. getin 'inputs/day-02-example.txt'
g=. (".&.> ,:~ ]) ('y'; '(d=. dirxns) y'; '((".@>@{:"1) *"1 d) y'; 'disp y')
smoutput g
)
#+END_SRC

#+RESULTS:
#+begin_example
┌───────────┬──────────────┬─────────────────────┬──────┐
│y          │(d=. dirxns) y│((".@>@{:"1) *"1 d) y│disp y│
├───────────┼──────────────┼─────────────────────┼──────┤
│┌───────┬─┐│1 0 1 0 0 1   │5 0 8 0 0 2          │5  0  │
││forward│5││0 0 0 1 0 0   │0 0 0 3 0 0          │0  5  │
│├───────┼─┤│0 1 0 0 1 0   │0 5 0 0 8 0          │8  0  │
││down   │5││              │                     │0 _3  │
│├───────┼─┤│              │                     │0  8  │
││forward│8││              │                     │2  0  │
│├───────┼─┤│              │                     │      │
││up     │3││              │                     │      │
│├───────┼─┤│              │                     │      │
││down   │8││              │                     │      │
│├───────┼─┤│              │                     │      │
││forward│2││              │                     │      │
│└───────┴─┘│              │                     │      │
└───────────┴──────────────┴─────────────────────┴──────┘
#+end_example

*** Part 1

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day02.ijs
part1=: 3 : '+/ h * +/ v [ v=. {:"1 d [ h=. {."1 d [ d=. disp y'
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day02.ijs
assert 150 = part1 inx=. getin 'inputs/day-02-example.txt'
#+END_SRC

#+RESULTS:

**** Solution
    
#+BEGIN_SRC j :results output scalar value :tangle src/day02.ijs
assert 1868935 = part1 in=. getin 'inputs/day-02.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day02.ijs
part2=: 3 : '+/ h * +/ h * +/\ v [ v=. {:"1 d [ h=. {."1 d [ d=. disp y'
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day02.ijs
assert 900 = part2 inx=. getin 'inputs/day-02-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output scalar value :tangle src/day02.ijs
assert 1965970888 = part2 in=. getin 'inputs/day-02.txt'
#+END_SRC

#+RESULTS:

