docs/index.html

<div id="outline-container-org4ee3d47" class="outline-3">
<h3 id="org4ee3d47">Part 1</h3>
<div class="outline-text-3" id="text-org4ee3d47">
</div>
<div id="outline-container-orgb58ff48" class="outline-4">
<h4 id="orgb58ff48">Function definition</h4>
<div class="outline-text-4" id="text-orgb58ff48">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> 1<span style="color: #0000ff;">&amp;</span>ninc
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3970b6" class="outline-4">
<h4 id="orgb3970b6">Test</h4>
<div class="outline-text-4" id="text-orgb3970b6">
<div class="org-src-container">
<pre class="src src-j">assert 7 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-01-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge72d807" class="outline-4">
<h4 id="orge72d807">Solution</h4>
<div class="outline-text-4" id="text-orge72d807">
<div class="org-src-container">
<pre class="src src-j">assert 1602 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-01.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8bebb76" class="outline-3">
<h3 id="org8bebb76">Part 2</h3>
<div class="outline-text-3" id="text-org8bebb76">
</div>
<div id="outline-container-org05f8c19" class="outline-4">
<h4 id="org05f8c19">Function definition</h4>
<div class="outline-text-4" id="text-org05f8c19">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> 3<span style="color: #0000ff;">&amp;</span>ninc
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ef941a" class="outline-4">
<h4 id="org2ef941a">Test</h4>
<div class="outline-text-4" id="text-org2ef941a">
<div class="org-src-container">
<pre class="src src-j">assert 7 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-01-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e41a80" class="outline-4">
<h4 id="org6e41a80">Solution</h4>
<div class="outline-text-4" id="text-org6e41a80">
<div class="org-src-container">
<pre class="src src-j">assert 1633 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-01.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org84e47c1" class="outline-2">
<h2 id="org84e47c1"><a href="https://adventofcode.com/2021/day/2">Day 02: Dive!</a></h2>
<div class="outline-text-2" id="text-org84e47c1">
<div id="text-table-of-contents">
<ul>
<li><a href="#org9acfbc6">Setup</a></li>
<li><a href="#orga61aacb">Read data</a></li>
<li><a href="#org96a1425">General function definition</a></li>
<li><a href="#org34b3757">Part 1</a>
<ul>
<li><a href="#orgc8106ff">Function definition</a></li>
<li><a href="#orgc970ae4">Test</a></li>
<li><a href="#org8ac6dad">Solution</a></li>
</ul>
</li>
<li><a href="#org22830e5">Part 2</a>
<ul>
<li><a href="#org0e34b7d">Function definition</a></li>
<li><a href="#orgf947bbe">Test</a></li>
<li><a href="#org5a8bf7f">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9acfbc6" class="outline-3">
<h3 id="org9acfbc6">Setup</h3>
<div class="outline-text-3" id="text-org9acfbc6">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day02'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga61aacb" class="outline-3">
<h3 id="orga61aacb">Read data</h3>
<div class="outline-text-3" id="text-orga61aacb">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">;:</span> readin
</pre>
</div>
</div>
</div>

<div id="outline-container-org96a1425" class="outline-3">
<h3 id="org96a1425">General function definition</h3>
<div class="outline-text-3" id="text-org96a1425">
</div>
<div id="outline-container-orga8401b7" class="outline-5">
<h5 id="orga8401b7">Directions</h5>
<div class="outline-text-5" id="text-orga8401b7">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Displacement vectors</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Returns three column boolean mask matrix of size (|. $ y)</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">for each direction</span>
<span style="color: #BA36A5;">dirxns</span><span style="color: #000000;">=:</span> (<span style="color: #008000;">'forward'</span><span style="color: #ff0000;">;</span> <span style="color: #008000;">'up'</span><span style="color: #ff0000;">;</span> <span style="color: #008000;">'down'</span>) <span style="color: #ff0000;">E.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>0 1 <span style="color: #ff0000;">{.</span><span style="color: #0000ff;">"</span>1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf8b595" class="outline-5">
<h5 id="orgdf8b595">Displacements</h5>
<div class="outline-text-5" id="text-orgdf8b595">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Horizontal and vertical displacement vectors</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Returns two column matrix</span>
<span style="color: #8D8D84;">NB.   </span><span style="color: #8D8D84; font-style: italic;">- Column 1 = horizonal displacement = forward</span>
<span style="color: #8D8D84;">NB.   </span><span style="color: #8D8D84; font-style: italic;">- Column 2 = vertical displacement = down - up</span>
<span style="color: #BA36A5;">disp</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> (<span style="color: #ff0000;">{.</span> <span style="color: #ff0000;">,.</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">-</span><span style="color: #00ff00;">/</span><span style="color: #ff0000;">|.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">}.</span>) (<span style="color: #ff0000;">".</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">&gt;</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">{:</span><span style="color: #0000ff;">"</span>1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>) <span style="color: #ff0000;">*</span><span style="color: #0000ff;">"</span>1 dirxns
</pre>
</div>

<p>
Reading from right to left, <code>disp</code> works as follows,
</p>

<ul class="org-ul">
<li><code>(".@&gt;@{:"1@]) *"1 dirxns</code>: Displacements corresponding to each direction.</li>
<li><code>({. ,. [: -/|.@}.)</code>: Forward (horizontal) stitched with vertical, <code>down - up</code>, displacement.</li>
</ul>

<pre class="example">
┌───────────┬──────────────┬─────────────────────┬──────┐
│y          │(d=. dirxns) y│((".@&gt;@{:"1) *"1 d) y│disp y│
├───────────┼──────────────┼─────────────────────┼──────┤
│┌───────┬─┐│1 0 1 0 0 1   │5 0 8 0 0 2          │5  0  │
││forward│5││0 0 0 1 0 0   │0 0 0 3 0 0          │0  5  │
│├───────┼─┤│0 1 0 0 1 0   │0 5 0 0 8 0          │8  0  │
││down   │5││              │                     │0 _3  │
│├───────┼─┤│              │                     │0  8  │
││forward│8││              │                     │2  0  │
│├───────┼─┤│              │                     │      │
││up     │3││              │                     │      │
│├───────┼─┤│              │                     │      │
││down   │8││              │                     │      │
│├───────┼─┤│              │                     │      │
││forward│2││              │                     │      │
│└───────┴─┘│              │                     │      │
└───────────┴──────────────┴─────────────────────┴──────┘
</pre>
</div>
</div>
</div>

<div id="outline-container-org34b3757" class="outline-3">
<h3 id="org34b3757">Part 1</h3>
<div class="outline-text-3" id="text-org34b3757">
</div>
<div id="outline-container-orgc8106ff" class="outline-4">
<h4 id="orgc8106ff">Function definition</h4>
<div class="outline-text-4" id="text-orgc8106ff">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'+/ h * +/ v [ v=. {:"1 d [ h=. {."1 d [ d=. disp y'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc970ae4" class="outline-4">
<h4 id="orgc970ae4">Test</h4>
<div class="outline-text-4" id="text-orgc970ae4">
<div class="org-src-container">
<pre class="src src-j">assert 150 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-02-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ac6dad" class="outline-4">
<h4 id="org8ac6dad">Solution</h4>
<div class="outline-text-4" id="text-org8ac6dad">
<div class="org-src-container">
<pre class="src src-j">assert 1868935 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-02.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org22830e5" class="outline-3">
<h3 id="org22830e5">Part 2</h3>
<div class="outline-text-3" id="text-org22830e5">
</div>
<div id="outline-container-org0e34b7d" class="outline-4">
<h4 id="org0e34b7d">Function definition</h4>
<div class="outline-text-4" id="text-org0e34b7d">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'+/ h * +/ h * +/\ v [ v=. {:"1 d [ h=. {."1 d [ d=. disp y'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf947bbe" class="outline-4">
<h4 id="orgf947bbe">Test</h4>
<div class="outline-text-4" id="text-orgf947bbe">
<div class="org-src-container">
<pre class="src src-j">assert 900 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-02-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a8bf7f" class="outline-4">
<h4 id="org5a8bf7f">Solution</h4>
<div class="outline-text-4" id="text-org5a8bf7f">
<div class="org-src-container">
<pre class="src src-j">assert 1965970888 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-02.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>
