solutions.org
** [[https://adventofcode.com/2021/day/3][Day 03: Binary Diagnostic]]

#+TOC: headlines 2 local

*** Setup
   
#+BEGIN_SRC j :results output silent
cocurrent <'day03'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :noweb yes :tangle src/day03.ijs
getin=: "."0 readin
#+END_SRC

*** Part 1
**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
part1=: (*&:#. -.)@(-:@# < +/)  NB. (epsilon =: -. gamma)
#+END_SRC

**** Test
#+BEGIN_SRC j :results output value :tangle src/day03.ijs
assert 198 = part1 inx=. getin 'inputs/day-03-example.txt'
#+END_SRC

#+RESULTS:

**** Solution
#+BEGIN_SRC j :results output scalar value :tangle src/day03.ijs
assert 2595824 = part1 in=. getin 'inputs/day-03.txt'
#+END_SRC

#+RESULTS:

*** Part 2: Approach 1
**** Function definitions

***** Filter rows

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
NB. Filter rows in y with 'u' common elements in column x
NB. y = input matrix
NB. x = target column for 'u'
NB. u = comparison operator (< , > , >: , <: , =)
filtrows=: 1 : '[ #~ {"1~ = -:@#@[ u +/@:({"1~)'
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
y=. #.inv (?.10#247)
(".&.> ,:~ ]) ('y'; 'y <: filtrows 0'; 'y > filtrows 0'; 'y <: filtrows 5')
#+END_SRC

#+RESULTS:
#+begin_example
┌───────────────┬───────────────┬───────────────┬───────────────┐
│y              │y <: filtrows 0│y > filtrows 0 │y <: filtrows 5│
├───────────────┼───────────────┼───────────────┼───────────────┤
│1 1 0 1 1 1 0 0│1 1 0 1 1 1 0 0│0 1 0 0 1 0 1 0│1 1 0 1 1 1 0 0│
│0 1 0 0 1 0 1 0│1 0 1 0 0 1 0 1│0 0 0 0 0 0 1 1│1 0 1 0 0 1 0 1│
│0 0 0 0 0 0 1 1│1 1 1 0 0 1 1 1│0 1 0 1 1 1 1 1│1 1 1 0 0 1 1 1│
│1 0 1 0 0 1 0 1│1 0 0 1 1 1 0 1│0 1 0 1 1 1 1 0│0 1 0 1 1 1 1 1│
│1 1 1 0 0 1 1 1│1 1 1 0 0 1 0 0│0 0 1 0 0 1 1 1│1 0 0 1 1 1 0 1│
│0 1 0 1 1 1 1 1│               │               │1 1 1 0 0 1 0 0│
│1 0 0 1 1 1 0 1│               │               │0 1 0 1 1 1 1 0│
│1 1 1 0 0 1 0 0│               │               │0 0 1 0 0 1 1 1│
│0 1 0 1 1 1 1 0│               │               │               │
│0 0 1 0 0 1 1 1│               │               │               │
└───────────────┴───────────────┴───────────────┴───────────────┘
#+end_example

***** ❖ Reducer

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
NB. Reduce using verb 'u/\.' on a boxed list y
foldr=: 1 : '[: u&.>/\. ,&boxxopen'
#+END_SRC

***** Rating

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
NB. Recursively filter rows using 'u' common elements from each column
rating=: 1 : '[: >@(] #~ 1: = #&>) (] (u filtrows)~ foldr~ ;/@i.@-@{:@$)'
#+END_SRC

Reading from right to left, =rating= works as follows,

+ =] (u filtrows)~ foldr~ ;/@i.@-@{:@$=: Recursively filter rows with =u= common elements from each column
  - =;/@i.@-@{:@$=: Boxed sequence of integers in decreasing order from column length to 0
+ =>@(] #~ 1: = #&>)=: Unbox (first) element containing only one row.

***** Life support rating

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
part2=: */@:#.@(> rating ,: <: rating)
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day03.ijs
assert 230 = part2 inx=. getin 'inputs/day-03-example.txt'
#+END_SRC

#+RESULTS:

**** Solution
#+BEGIN_SRC j :results output scalar value :tangle src/day03.ijs
assert 2135254 = part2 in=. getin 'inputs/day-03.txt'
#+END_SRC

#+RESULTS:

*** Part 2: Approach 2
