docs/index.html

<div id="outline-container-orgc222043" class="outline-2">
<h2 id="orgc222043"><a href="https://adventofcode.com/2021/day/3">Day 03: Binary Diagnostic</a></h2>
<div class="outline-text-2" id="text-orgc222043">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdb96a55">Setup</a></li>
<li><a href="#orge8fdd23">Read data</a></li>
<li><a href="#orgc63b84a">Part 1</a>
<ul>
<li><a href="#orgb2f7bf0">Function definition</a></li>
<li><a href="#orgdb769ed">Test</a></li>
<li><a href="#org8958c85">Solution</a></li>
</ul>
</li>
<li><a href="#org90a972d">Part 2: Approach 1</a>
<ul>
<li><a href="#org3867a7b">Function definitions</a></li>
<li><a href="#orgcd5a731">Test</a></li>
<li><a href="#org7be0926">Solution</a></li>
</ul>
</li>
<li><a href="#org9918609">Part 2: Approach 2</a>
<ul>
<li><a href="#org62be3d8">Function definitions</a></li>
<li><a href="#orgba4f8cd">Test</a></li>
<li><a href="#org49e304d">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb96a55" class="outline-3">
<h3 id="orgdb96a55">Setup</h3>
<div class="outline-text-3" id="text-orgdb96a55">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day03'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8fdd23" class="outline-3">
<h3 id="orge8fdd23">Read data</h3>
<div class="outline-text-3" id="text-orge8fdd23">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">".</span><span style="color: #0000ff;">"</span>0 readin
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc63b84a" class="outline-3">
<h3 id="orgc63b84a">Part 1</h3>
<div class="outline-text-3" id="text-orgc63b84a">
</div>
<div id="outline-container-orgb2f7bf0" class="outline-4">
<h4 id="orgb2f7bf0">Function definition</h4>
<div class="outline-text-4" id="text-orgb2f7bf0">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">*</span><span style="color: #0000ff;">&amp;:</span><span style="color: #ff0000;">#.</span> <span style="color: #ff0000;">-.</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">-:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">#</span> <span style="color: #ff0000;">&lt;</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span>)  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">(epsilon =: -. gamma)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb769ed" class="outline-4">
<h4 id="orgdb769ed">Test</h4>
<div class="outline-text-4" id="text-orgdb769ed">
<div class="org-src-container">
<pre class="src src-j">assert 198 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-03-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8958c85" class="outline-4">
<h4 id="org8958c85">Solution</h4>
<div class="outline-text-4" id="text-org8958c85">
<div class="org-src-container">
<pre class="src src-j">assert 2595824 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-03.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org90a972d" class="outline-3">
<h3 id="org90a972d">Part 2: Approach 1</h3>
<div class="outline-text-3" id="text-org90a972d">
</div>
<div id="outline-container-org3867a7b" class="outline-4">
<h4 id="org3867a7b">Function definitions</h4>
<div class="outline-text-4" id="text-org3867a7b">
</div>
<div id="outline-container-org8406213" class="outline-5">
<h5 id="org8406213">Filter rows</h5>
<div class="outline-text-5" id="text-org8406213">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Filter rows in y with 'u' common elements in column x</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input matrix</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = target column for 'u'</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">u = comparison operator (&lt; , &gt; , &gt;: , &lt;: , =)</span>
<span style="color: #BA36A5;">filtrows</span><span style="color: #000000;">=:</span> 1 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'[ #~ {"1~ = -:@#@[ u +/@:({"1~)'</span>
</pre>
</div>

<pre class="example">
┌───────────────┬───────────────┬───────────────┬───────────────┐
│y              │y &lt;: filtrows 0│y &gt; filtrows 0 │y &lt;: filtrows 5│
├───────────────┼───────────────┼───────────────┼───────────────┤
│1 1 0 1 1 1 0 0│1 1 0 1 1 1 0 0│0 1 0 0 1 0 1 0│1 1 0 1 1 1 0 0│
│0 1 0 0 1 0 1 0│1 0 1 0 0 1 0 1│0 0 0 0 0 0 1 1│1 0 1 0 0 1 0 1│
│0 0 0 0 0 0 1 1│1 1 1 0 0 1 1 1│0 1 0 1 1 1 1 1│1 1 1 0 0 1 1 1│
│1 0 1 0 0 1 0 1│1 0 0 1 1 1 0 1│0 1 0 1 1 1 1 0│0 1 0 1 1 1 1 1│
│1 1 1 0 0 1 1 1│1 1 1 0 0 1 0 0│0 0 1 0 0 1 1 1│1 0 0 1 1 1 0 1│
│0 1 0 1 1 1 1 1│               │               │1 1 1 0 0 1 0 0│
│1 0 0 1 1 1 0 1│               │               │0 1 0 1 1 1 1 0│
│1 1 1 0 0 1 0 0│               │               │0 0 1 0 0 1 1 1│
│0 1 0 1 1 1 1 0│               │               │               │
│0 0 1 0 0 1 1 1│               │               │               │
└───────────────┴───────────────┴───────────────┴───────────────┘
</pre>
</div>
</div>

<div id="outline-container-org7f0b001" class="outline-5">
<h5 id="org7f0b001">❖ Reducer</h5>
<div class="outline-text-5" id="text-org7f0b001">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Reduce using verb 'u/\.' on a boxed list y</span>
<span style="color: #BA36A5;">foldr</span><span style="color: #000000;">=:</span> 1 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'[: u&amp;.&gt;/\. ,&amp;boxxopen'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe8cc2e" class="outline-5">
<h5 id="orgbe8cc2e">Rating</h5>
<div class="outline-text-5" id="text-orgbe8cc2e">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Recursively filter rows using 'u' common elements from each column</span>
<span style="color: #BA36A5;">rating</span><span style="color: #000000;">=:</span> 1 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'[: &gt;@(] #~ 1: = #&amp;&gt;) (] (u filtrows)~ foldr~ ;/@i.@-@{:@$)'</span>
</pre>
</div>

<p>
Reading from right to left, <code>rating</code> works as follows,
</p>

<ul class="org-ul">
<li><code>] (u filtrows)~ foldr~ ;/@i.@-@{:@$</code>: Recursively filter rows with <code>u</code> common elements from each column
<ul class="org-ul">
<li><code>;/@i.@-@{:@$</code>: Boxed sequence of integers in decreasing order from column length to 0</li>
</ul></li>
<li><code>&gt;@(] #~ 1: = #&amp;&gt;)</code>: Unbox (first) element containing only one row.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6b4a10" class="outline-5">
<h5 id="orgb6b4a10">Life support rating</h5>
<div class="outline-text-5" id="text-orgb6b4a10">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">*</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">@:</span><span style="color: #ff0000;">#.</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;</span> rating <span style="color: #ff0000;">,:</span> <span style="color: #ff0000;">&lt;:</span> rating)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcd5a731" class="outline-4">
<h4 id="orgcd5a731">Test</h4>
<div class="outline-text-4" id="text-orgcd5a731">
<div class="org-src-container">
<pre class="src src-j">assert 230 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-03-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7be0926" class="outline-4">
<h4 id="org7be0926">Solution</h4>
<div class="outline-text-4" id="text-org7be0926">
<div class="org-src-container">
<pre class="src src-j">assert 2135254 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-03.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9918609" class="outline-3">
<h3 id="org9918609">Part 2: Approach 2</h3>
<div class="outline-text-3" id="text-org9918609">
</div>
