solutions.org
**** Function definitions

Approach is to iteratively remove all rows with the most (or least) common elements across each column.

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
rating=: 1 : 0
ix=. {.@I.@(-. @ (-: 1&|.)"1 @ |:) NB. index of first column where elements differ
cm=. { +/ u~ # - +/ 	     NB. common elements 'u' in x = column of y = data
fr=. ix (] #~ cm = {"1) ]  NB. filter all rows with 'cm' common elements in column (ix y)
fr`]@.(1 = #@])^:_ y	     NB. iterate until one row remains
)
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day03.ijs
part2=: [: */ [: #. > rating , <: rating
#+END_SRC

**** Test
#+BEGIN_SRC j :results output value :tangle src/day03.ijs
assert 230 = part2 inx=. getin 'inputs/day-03-example.txt'
#+END_SRC

#+RESULTS:
**** Solution
#+BEGIN_SRC j :results output scalar value :tangle src/day03.ijs
assert 2135254 = part2 in=. getin 'inputs/day-03.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/4][Day 04: Giant Squid]]

#+TOC: headlines 2 local

*** Setup
   
#+BEGIN_SRC j :results output silent
cocurrent <'day04'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day04.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day04.ijs
getin=: a: -.~ <@". readin@]
#+END_SRC

Split list of calls and boards in input data,

#+BEGIN_SRC j :results output silent :tangle src/day04.ijs
calls=: 0&{::
boards=: _5 [\ >@}. 
#+END_SRC

*** General function definitions 
