docs/index.html
<div id="outline-container-org62be3d8" class="outline-4">
<h4 id="org62be3d8">Function definitions</h4>
<div class="outline-text-4" id="text-org62be3d8">
<p>
Approach is to iteratively remove all rows with the most (or least) common elements across each column.
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">rating</span><span style="color: #000000;">=:</span> 1 <span style="color: #ff0000;">:</span> 0
<span style="color: #BA36A5;">ix</span><span style="color: #000000;">=.</span> <span style="color: #ff0000;">{.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">I.</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">-.</span> <span style="color: #0000ff;">@</span> (<span style="color: #ff0000;">-:</span> 1<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">|.</span>)<span style="color: #0000ff;">"</span>1 <span style="color: #0000ff;">@</span> <span style="color: #ff0000;">|:</span>) <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">index of first column where elements differ</span>
<span style="color: #BA36A5;">cm</span><span style="color: #000000;">=.</span> <span style="color: #ff0000;">{</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> u<span style="color: #00ff00;">~</span> <span style="color: #ff0000;">#</span> <span style="color: #ff0000;">-</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span>        <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">common elements 'u' in x = column of y = data</span>
<span style="color: #BA36A5;">fr</span><span style="color: #000000;">=.</span> ix (<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">~</span> cm <span style="color: #ff0000;">=</span> <span style="color: #ff0000;">{</span><span style="color: #0000ff;">"</span>1) <span style="color: #ff0000;">]</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">filter all rows with 'cm' common elements in column (ix y)</span>
fr<span style="color: #0000ff;">`</span><span style="color: #ff0000;">]</span><span style="color: #0000ff;">@.</span>(1 <span style="color: #ff0000;">=</span> <span style="color: #ff0000;">#</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">^:</span>_ y       <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">iterate until one row remains</span>
)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">*</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">#.</span> <span style="color: #ff0000;">&gt;</span> rating <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&lt;:</span> rating
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba4f8cd" class="outline-4">
<h4 id="orgba4f8cd">Test</h4>
<div class="outline-text-4" id="text-orgba4f8cd">
<div class="org-src-container">
<pre class="src src-j">assert 230 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-03-example.txt'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org49e304d" class="outline-4">
<h4 id="org49e304d">Solution</h4>
<div class="outline-text-4" id="text-org49e304d">
<div class="org-src-container">
<pre class="src src-j">assert 2135254 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-03.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org769e0b1" class="outline-2">
<h2 id="org769e0b1"><a href="https://adventofcode.com/2021/day/4">Day 04: Giant Squid</a></h2>
<div class="outline-text-2" id="text-org769e0b1">
<div id="text-table-of-contents">
<ul>
<li><a href="#org47dddb0">Setup</a></li>
<li><a href="#orgfb22e3a">Read data</a></li>
<li><a href="#orgf82a96b">General function definitions</a>
<ul>
<li><a href="#org9ecb70d">Winning Sequence</a></li>
<li><a href="#org31f6dbb">Score</a></li>
</ul>
</li>
<li><a href="#org3622333">Part 1</a>
<ul>
<li><a href="#org15f50a8">Function definition</a></li>
<li><a href="#orgb6379ac">Test</a></li>
<li><a href="#orgdd8e7e8">Solution</a></li>
</ul>
</li>
<li><a href="#orgf474b1e">Part 2</a>
<ul>
<li><a href="#org824d99c">Function definition</a></li>
<li><a href="#org85dd2d0">Test</a></li>
<li><a href="#orgebbf6d0">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org47dddb0" class="outline-3">
<h3 id="org47dddb0">Setup</h3>
<div class="outline-text-3" id="text-org47dddb0">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day04'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb22e3a" class="outline-3">
<h3 id="orgfb22e3a">Read data</h3>
<div class="outline-text-3" id="text-orgfb22e3a">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> a<span style="color: #ff0000;">:</span> <span style="color: #ff0000;">-.</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">&lt;</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">".</span> readin<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>
</pre>
</div>

<p>
Split list of calls and boards in input data,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">calls</span><span style="color: #000000;">=:</span> 0<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">{::</span>
<span style="color: #BA36A5;">boards</span><span style="color: #000000;">=:</span> _5 <span style="color: #ff0000;">[</span><span style="color: #00ff00;">\</span> <span style="color: #ff0000;">&gt;</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">}.</span> 
</pre>
</div>
</div>
</div>
