solutions.org
**** Winning Sequence

One approach to obtaining the winning sequence of boards and corresponding calls is described below.

Consider the following set of calls,

#+BEGIN_SRC j :results output value
excalls=: 45 41 47 36 46 27 44 24 33 35 26 38 43 28 23 32 34 25 29 39 31 40 37 42 30
#+END_SRC

#+RESULTS:

and the corresponding board,

#+BEGIN_SRC j :results output value :exports both
exboard=: _5 [\ 23 + 25?.25
exboard
#+END_SRC

#+RESULTS:
: 42 44 31 26 32
: 36 34 40 45 43
: 28 24 25 41 46
: 30 35 29 47 33
: 39 23 37 38 27

The call number (index) at which an element on the board is marked is,

#+BEGIN_SRC j :results output value :exports both
excalls i. exboard
#+END_SRC

#+RESULTS:
: 23  6 20 10 15
:  3 16 21  0 12
: 13  7 17  1  4
: 24  9 18  2  8
: 19 14 22 11  5

#+begin_important
The *maximum* in each row (or column) above is the call index at which all numbers in that row (or column) are marked.
#+end_important

For example, all numbers in the first row are not marked until the 23^rd number is called. For the second row, it is the 21^st number called and so on.
Thus,

#+BEGIN_SRC j :results output value :exports both
excalls ((>./"1 , >./)@i.) exboard
#+END_SRC

#+RESULTS:
: 23 21 17 24 22 24 16 22 11 15

#+begin_important
The earliest a board can win /Bingo!/ is given by the *minimum* of the (maximum row and column) indices. 
#+end_important

In the example above, the board wins after the 11^th number is called because after that all numbers in the 4^th column will be marked,

#+BEGIN_SRC j :results output value :exports both
excalls ((<./)@(>./"1 , >./)@i.) exboard
#+END_SRC

#+RESULTS:
: 11

Now consider the example set of calls and the three boards in the problem,
#+BEGIN_SRC j :results output silent
inx=: getin 'inputs/day-04-example.txt'
#+END_SRC

#+BEGIN_SRC j :results output value :exports both
calls inx
#+END_SRC
#+RESULTS:
: 7 4 9 5 11 17 23 2 0 14 21 24 10 16 13 6 15 25 12 22 18 20 8 19 3 26 1

#+BEGIN_SRC j :results output value :exports both
boards inx
#+END_SRC

#+RESULTS:
#+begin_example
22 13 17 11  0
 8  2 23  4 24
21  9 14 16  7
 6 10  3 18  5
 1 12 20 15 19

 3 15  0  2 22
 9 18 13 17  5
19  8  7 25 23
20 11 10 24  4
14 21 16 12  6

14 21 17 24  4
10 16 15  9 19
18  8 23 26 20
22 11 13  6  5
 2  0 12  3  7
#+end_example

The call indices at which each board wins /Bingo!/ ⇒ 1 row or column is completely marked,

#+BEGIN_SRC j :results output value :exports both
(calls (<./)@(>./"1 , >./)"_1@i. boards) inx
#+END_SRC

#+RESULTS:
: 13 14 11

Calls up to the n^th index = =(n + 1) {. calls= ⇒ above results must be incremented by one,

#+BEGIN_SRC j :results output value :exports both
(calls >:@(<./)@(>./"1 , >./)"_1@i. boards) inx
#+END_SRC

#+RESULTS:
: 14 15 12

#+begin_attention
*Grading-up* the winning call indices gives the corresponding boards.
#+end_attention

So a two column list of boards and corresponding win call indices, ordered by the call indices, is

#+BEGIN_SRC j :results output value :exports both
(calls (/: ,. /:~)@(>:@(<./)@(>./"1 , >./)"_1@i.) boards) inx
#+END_SRC

#+RESULTS:
: 2 12
: 0 14
: 1 15

 ⇒ the 2^nd board wins after the 12^th call, the 0^th board after the 14^th and the 1^st board after the 15^th call.

The winning sequence function is thus defined,

#+BEGIN_SRC j :results output silent :tangle src/day04.ijs
winseq=: (/: ,. /:~)@(>:@(<./)@(>./"1 , >./)"_1@i.)
#+END_SRC

**** Score

#+BEGIN_SRC j :results output silent :tangle src/day04.ijs
NB. Calculate score
NB. y = boards
NB. x = calls
NB. u = monadic function to select nth winning board
score=: 1 : '(c {:@{. x) * +/ (, b { y) -. (c {. x) [ ''b c''=. x u @ winseq y'
#+END_SRC

*** Part 1

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day04.ijs
part1=: calls {. score boards
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day04.ijs
assert 4512 = part1 inx=. getin 'inputs/day-04-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day04.ijs
assert 2496 = part1 in=. getin 'inputs/day-04.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day04.ijs
part2=: calls {: score boards
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day04.ijs
assert 1924 = part2 inx=. getin 'inputs/day-04-example.txt'
#+END_SRC

#+RESULTS:

