docs/index.html

<div id="outline-container-orgf82a96b" class="outline-3">
<h3 id="orgf82a96b">General function definitions</h3>
<div class="outline-text-3" id="text-orgf82a96b">
</div>
<div id="outline-container-org9ecb70d" class="outline-4">
<h4 id="org9ecb70d">Winning Sequence</h4>
<div class="outline-text-4" id="text-org9ecb70d">
<p>
One approach to obtaining the winning sequence of boards and corresponding calls is described below.
</p>

<p>
Consider the following set of calls,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">excalls</span><span style="color: #000000;">=:</span> 45 41 47 36 46 27 44 24 33 35 26 38 43 28 23 32 34 25 29 39 31 40 37 42 30
</pre>
</div>

<p>
and the corresponding board,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">exboard</span><span style="color: #000000;">=:</span> _5 <span style="color: #ff0000;">[</span><span style="color: #00ff00;">\</span> 23 <span style="color: #ff0000;">+</span> 25<span style="color: #ff0000;">?.</span>25
exboard
</pre>
</div>

<pre class="example">
42 44 31 26 32
36 34 40 45 43
28 24 25 41 46
30 35 29 47 33
39 23 37 38 27

</pre>

<p>
The call number (index) at which an element on the board is marked is,
</p>

<div class="org-src-container">
<pre class="src src-j">excalls <span style="color: #ff0000;">i.</span> exboard
</pre>
</div>

<pre class="example">
23  6 20 10 15
 3 16 21  0 12
13  7 17  1  4
24  9 18  2  8
19 14 22 11  5

</pre>

<div class="important">
<p>
The <b>maximum</b> in each row (or column) above is the call index at which all numbers in that row (or column) are marked.
</p>

</div>

<p>
For example, all numbers in the first row are not marked until the 23<sup>rd</sup> number is called. For the second row, it is the 21<sup>st</sup> number called and so on.
Thus,
</p>

<div class="org-src-container">
<pre class="src src-j">excalls ((<span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span>) exboard
</pre>
</div>

<pre class="example">
23 21 17 24 22 24 16 22 11 15

</pre>

<div class="important">
<p>
The earliest a board can win <i>Bingo!</i> is given by the <b>minimum</b> of the (maximum row and column) indices. 
</p>

</div>

<p>
In the example above, the board wins after the 11<sup>th</sup> number is called because after that all numbers in the 4<sup>th</sup> column will be marked,
</p>

<div class="org-src-container">
<pre class="src src-j">excalls ((<span style="color: #ff0000;">&lt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span>) exboard
</pre>
</div>

<pre class="example">
11

</pre>

<p>
Now consider the example set of calls and the three boards in the problem,
</p>
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">inx</span><span style="color: #000000;">=:</span> getin <span style="color: #008000;">'inputs/day-04-example.txt'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">calls inx
</pre>
</div>
<pre class="example">
7 4 9 5 11 17 23 2 0 14 21 24 10 16 13 6 15 25 12 22 18 20 8 19 3 26 1

</pre>

<div class="org-src-container">
<pre class="src src-j">boards inx
</pre>
</div>

<pre class="example">
22 13 17 11  0
 8  2 23  4 24
21  9 14 16  7
 6 10  3 18  5
 1 12 20 15 19

 3 15  0  2 22
 9 18 13 17  5
19  8  7 25 23
20 11 10 24  4
14 21 16 12  6

14 21 17 24  4
10 16 15  9 19
18  8 23 26 20
22 11 13  6  5
 2  0 12  3  7
</pre>

<p>
The call indices at which each board wins <i>Bingo!</i> ⇒ 1 row or column is completely marked,
</p>

<div class="org-src-container">
<pre class="src src-j">(calls (<span style="color: #ff0000;">&lt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">"</span>_1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span> boards) inx
</pre>
</div>

<pre class="example">
13 14 11

</pre>

<p>
Calls up to the n<sup>th</sup> index = <code>(n + 1) {. calls</code> ⇒ above results must be incremented by one,
</p>

<div class="org-src-container">
<pre class="src src-j">(calls <span style="color: #ff0000;">&gt;:</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&lt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">"</span>_1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span> boards) inx
</pre>
</div>

<pre class="example">
14 15 12

</pre>

<div class="attention">
<p>
<b>Grading-up</b> the winning call indices gives the corresponding boards.
</p>

</div>

<p>
So a two column list of boards and corresponding win call indices, ordered by the call indices, is
</p>

<div class="org-src-container">
<pre class="src src-j">(calls (<span style="color: #ff0000;">/:</span> <span style="color: #ff0000;">,.</span> <span style="color: #ff0000;">/:</span><span style="color: #00ff00;">~</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;:</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&lt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">"</span>_1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span>) boards) inx
</pre>
</div>

<pre class="example">
2 12
0 14
1 15

</pre>

<p>
⇒ the 2<sup>nd</sup> board wins after the 12<sup>th</sup> call, the 0<sup>th</sup> board after the 14<sup>th</sup> and the 1<sup>st</sup> board after the 15<sup>th</sup> call.
</p>

<p>
The winning sequence function is thus defined,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">winseq</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">/:</span> <span style="color: #ff0000;">,.</span> <span style="color: #ff0000;">/:</span><span style="color: #00ff00;">~</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;:</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&lt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">"</span>_1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org31f6dbb" class="outline-4">
<h4 id="org31f6dbb">Score</h4>
<div class="outline-text-4" id="text-org31f6dbb">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Calculate score</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = boards</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = calls</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">u = monadic function to select nth winning board</span>
<span style="color: #BA36A5;">score</span><span style="color: #000000;">=:</span> 1 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'(c {:@{. x) * +/ (, b { y) -. (c {. x) [ ''b c''=. x u @ winseq y'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3622333" class="outline-3">
<h3 id="org3622333">Part 1</h3>
<div class="outline-text-3" id="text-org3622333">
</div>
<div id="outline-container-org15f50a8" class="outline-4">
<h4 id="org15f50a8">Function definition</h4>
<div class="outline-text-4" id="text-org15f50a8">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> calls <span style="color: #ff0000;">{.</span> score boards
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb6379ac" class="outline-4">
<h4 id="orgb6379ac">Test</h4>
<div class="outline-text-4" id="text-orgb6379ac">
<div class="org-src-container">
<pre class="src src-j">assert 4512 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-04-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd8e7e8" class="outline-4">
<h4 id="orgdd8e7e8">Solution</h4>
<div class="outline-text-4" id="text-orgdd8e7e8">
<div class="org-src-container">
<pre class="src src-j">assert 2496 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-04.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf474b1e" class="outline-3">
<h3 id="orgf474b1e">Part 2</h3>
<div class="outline-text-3" id="text-orgf474b1e">
</div>
<div id="outline-container-org824d99c" class="outline-4">
<h4 id="org824d99c">Function definition</h4>
<div class="outline-text-4" id="text-org824d99c">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> calls <span style="color: #ff0000;">{:</span> score boards
</pre>
</div>
</div>
</div>

<div id="outline-container-org85dd2d0" class="outline-4">
<h4 id="org85dd2d0">Test</h4>
<div class="outline-text-4" id="text-org85dd2d0">
<div class="org-src-container">
<pre class="src src-j">assert 1924 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-04-example.txt'</span>
</pre>
</div>
</div>
</div>
