solutions.org
**** Solution

#+BEGIN_SRC j :results output value :tangle src/day04.ijs
assert 25925 = part2 in=. getin 'inputs/day-04.txt'
#+END_SRC

#+RESULTS:
** [[https://adventofcode.com/2021/day/5][Day 05: Hydrothermal Venture]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day05'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs
getin=: ".@(rplc&('->';',:';',';' ')) readin
#+END_SRC

Note that '->' is replaced with ',:' so that executing each row casts the =(x, y)= coordinates in each row to a $2 \times 2$ matrix. This results in 
an $N \times 2 \times 2$ matrix for $N$ points (rows) in the file.

*** General function definitions

**** ❖ Sequence generator

Generate sequence in closed interval =(x, y)=,

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs 
NB. Generate sequence in closed interval (x, y)
NB. x < y: Ascending  ]  5 seq 8  => 5 6 7 8
NB. x > y: Descending ] _2 seq _5 => _2 _3 _4 _5
NB. x = y: Constant   ]  0 seq 0  => 0
seq=: [ + (-@* * i.@>:@|)@-
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
(".&.> ,:~ ]) ('_3 seq 4'; '7 seq 3'; '9 seq 9')
#+END_SRC

#+RESULTS:
: ┌──────────────────┬─────────┬───────┐
: │_3 seq 4          │7 seq 3  │9 seq 9│
: ├──────────────────┼─────────┼───────┤
: │_3 _2 _1 0 1 2 3 4│7 6 5 4 3│9      │
: └──────────────────┴─────────┴───────┘

For 2-element =x = (x1, y1)= and =y = (x2, y2)=, =seq= can be considered to interpolate between the coordinates. 
Of course this only works for horizontal, vertical and 45^o diagonal lines!

#+BEGIN_SRC j :results output value :exports results
(".&.> ,:~ ]) ('(0 9) seq (5 9)'; '(3 2) seq (3 7)'; '(4 4) seq (8 8)')
#+END_SRC

#+RESULTS:
: ┌───────────────┬───────────────┬───────────────┐
: │(0 9) seq (5 9)│(3 2) seq (3 7)│(4 4) seq (8 8)│
: ├───────────────┼───────────────┼───────────────┤
: │0 1 2 3 4 5    │3 3 3 3 3 3    │4 5 6 7 8      │
: │9 9 9 9 9 9    │2 3 4 5 6 7    │4 5 6 7 8      │
: └───────────────┴───────────────┴───────────────┘

**** ❖ Points

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs
NB. Interpolate points across coordinate endpoints
NB. y = N x 2 x 2 matrix of N points
NB.         2 x 2 submatrices are (x1 y1 ,: x2 y2) coordinates for each point
NB. Returns 2-column list of interpolated (x, y) pairs for all points
pts=: [: ; _2 <@|:@seq"1/\"_1 ]
#+END_SRC


#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. _2 [\"_1 (0 9 5 9 , 3 2 3 7 ,: 4 4 8 8)
g=. (".&.> ,:~ ]) ('y'; 'pts y')
smoutput g
)
#+END_SRC

#+RESULTS:
#+begin_example
┌───┬─────┐
│y  │pts y│
├───┼─────┤
│0 9│0 9  │
│5 9│1 9  │
│   │2 9  │
│3 2│3 9  │
│3 7│4 9  │
│   │5 9  │
│4 4│3 2  │
│8 8│3 3  │
│   │3 4  │
│   │3 5  │
│   │3 6  │
│   │3 7  │
│   │4 4  │
│   │5 5  │
│   │6 6  │
│   │7 7  │
│   │8 8  │
└───┴─────┘
#+end_example

**** Intersections

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs
NB. Count number of intersections between N lines
NB. y = N x 2 x 2 matrix of N points
NB.         2 x 2 submatrices are (x1 y1 ,: x2 y2) coordinates for each point
NB. x is minimum number of intersections
intersect=: [: +/ [ <: [: #/.~ pts 
#+END_SRC

**** Filter vertical and horizontal lines

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs
NB. Filter coordinates of vertical and horizontal lines
NB. y = N x 2 x 2 matrix of N points
NB.         2 x 2 submatrices are (x1 y1 ,: x2 y2) coordinates for each point
filtvh=: ] #~ (+./"1 @: =/)"_1
#+END_SRC

*** Part 1

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs
part1=: 2&intersect @ filtvh
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day05.ijs
assert 5 = part1 inx=. getin 'inputs/day-05-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day05.ijs
assert 7473 = part1 in=. getin 'inputs/day-05.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day05.ijs
part2=: 2&intersect
#+END_SRC

