docs/index.html

<div id="outline-container-orgebbf6d0" class="outline-4">
<h4 id="orgebbf6d0">Solution</h4>
<div class="outline-text-4" id="text-orgebbf6d0">
<div class="org-src-container">
<pre class="src src-j">assert 25925 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-04.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org85f9935" class="outline-2">
<h2 id="org85f9935"><a href="https://adventofcode.com/2021/day/5">Day 05: Hydrothermal Venture</a></h2>
<div class="outline-text-2" id="text-org85f9935">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgedf3a88">Setup</a></li>
<li><a href="#org0c59d1b">Read data</a></li>
<li><a href="#orgf607455">General function definitions</a>
<ul>
<li><a href="#orgec84e5d">❖ Sequence generator</a></li>
<li><a href="#orge201826">❖ Points</a></li>
<li><a href="#orgceeb0ab">Intersections</a></li>
<li><a href="#orgbd587fe">Filter vertical and horizontal lines</a></li>
</ul>
</li>
<li><a href="#orgf9faad7">Part 1</a>
<ul>
<li><a href="#org7bd4c02">Function definition</a></li>
<li><a href="#org6140ab7">Test</a></li>
<li><a href="#org1cd9c9e">Solution</a></li>
</ul>
</li>
<li><a href="#orgf6fb12c">Part 2</a>
<ul>
<li><a href="#org5e4f867">Function definition</a></li>
<li><a href="#org9c44487">Test</a></li>
<li><a href="#org2572c85">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgedf3a88" class="outline-3">
<h3 id="orgedf3a88">Setup</h3>
<div class="outline-text-3" id="text-orgedf3a88">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day05'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0c59d1b" class="outline-3">
<h3 id="org0c59d1b">Read data</h3>
<div class="outline-text-3" id="text-org0c59d1b">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">".</span><span style="color: #0000ff;">@</span>(rplc<span style="color: #0000ff;">&amp;</span>(<span style="color: #008000;">'-&gt;'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">',:'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">','</span><span style="color: #ff0000;">;</span><span style="color: #008000;">' '</span>)) readin
</pre>
</div>

<p>
Note that &rsquo;-&gt;&rsquo; is replaced with &rsquo;,:&rsquo; so that executing each row casts the <code>(x, y)</code> coordinates in each row to a \(2 \times 2\) matrix. This results in 
an \(N \times 2 \times 2\) matrix for \(N\) points (rows) in the file.
</p>
</div>
</div>

<div id="outline-container-orgf607455" class="outline-3">
<h3 id="orgf607455">General function definitions</h3>
<div class="outline-text-3" id="text-orgf607455">
</div>
<div id="outline-container-orgec84e5d" class="outline-4">
<h4 id="orgec84e5d">❖ Sequence generator</h4>
<div class="outline-text-4" id="text-orgec84e5d">
<p>
Generate sequence in closed interval <code>(x, y)</code>,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Generate sequence in closed interval (x, y)</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x &lt; y: Ascending  ]  5 seq 8  =&gt; 5 6 7 8</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x &gt; y: Descending ] _2 seq _5 =&gt; _2 _3 _4 _5</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = y: Constant   ]  0 seq 0  =&gt; 0</span>
<span style="color: #BA36A5;">seq</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[</span> <span style="color: #ff0000;">+</span> (<span style="color: #ff0000;">-</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">*</span> <span style="color: #ff0000;">*</span> <span style="color: #ff0000;">i.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">&gt;:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">|</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">-</span>
</pre>
</div>

<pre class="example">
┌──────────────────┬─────────┬───────┐
│_3 seq 4          │7 seq 3  │9 seq 9│
├──────────────────┼─────────┼───────┤
│_3 _2 _1 0 1 2 3 4│7 6 5 4 3│9      │
└──────────────────┴─────────┴───────┘

</pre>

<p>
For 2-element <code>x = (x1, y1)</code> and <code>y = (x2, y2)</code>, <code>seq</code> can be considered to interpolate between the coordinates. 
Of course this only works for horizontal, vertical and 45<sup>o</sup> diagonal lines!
</p>

<pre class="example">
┌───────────────┬───────────────┬───────────────┐
│(0 9) seq (5 9)│(3 2) seq (3 7)│(4 4) seq (8 8)│
├───────────────┼───────────────┼───────────────┤
│0 1 2 3 4 5    │3 3 3 3 3 3    │4 5 6 7 8      │
│9 9 9 9 9 9    │2 3 4 5 6 7    │4 5 6 7 8      │
└───────────────┴───────────────┴───────────────┘

</pre>
</div>
</div>

<div id="outline-container-orge201826" class="outline-4">
<h4 id="orge201826">❖ Points</h4>
<div class="outline-text-4" id="text-orge201826">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Interpolate points across coordinate endpoints</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = N x 2 x 2 matrix of N points</span>
<span style="color: #8D8D84;">NB.         </span><span style="color: #8D8D84; font-style: italic;">2 x 2 submatrices are (x1 y1 ,: x2 y2) coordinates for each point</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Returns 2-column list of interpolated (x, y) pairs for all points</span>
<span style="color: #BA36A5;">pts</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">;</span> _2 <span style="color: #ff0000;">&lt;</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">|:</span><span style="color: #0000ff;">@</span>seq<span style="color: #0000ff;">"</span>1<span style="color: #00ff00;">/\</span><span style="color: #0000ff;">"</span>_1 <span style="color: #ff0000;">]</span>
</pre>
</div>


<pre class="example">
┌───┬─────┐
│y  │pts y│
├───┼─────┤
│0 9│0 9  │
│5 9│1 9  │
│   │2 9  │
│3 2│3 9  │
│3 7│4 9  │
│   │5 9  │
│4 4│3 2  │
│8 8│3 3  │
│   │3 4  │
│   │3 5  │
│   │3 6  │
│   │3 7  │
│   │4 4  │
│   │5 5  │
│   │6 6  │
│   │7 7  │
│   │8 8  │
└───┴─────┘
</pre>
</div>
</div>

<div id="outline-container-orgceeb0ab" class="outline-4">
<h4 id="orgceeb0ab">Intersections</h4>
<div class="outline-text-4" id="text-orgceeb0ab">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Count number of intersections between N lines</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = N x 2 x 2 matrix of N points</span>
<span style="color: #8D8D84;">NB.         </span><span style="color: #8D8D84; font-style: italic;">2 x 2 submatrices are (x1 y1 ,: x2 y2) coordinates for each point</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x is minimum number of intersections</span>
<span style="color: #BA36A5;">intersect</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">[</span> <span style="color: #ff0000;">&lt;:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">/.~</span> pts 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd587fe" class="outline-4">
<h4 id="orgbd587fe">Filter vertical and horizontal lines</h4>
<div class="outline-text-4" id="text-orgbd587fe">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Filter coordinates of vertical and horizontal lines</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = N x 2 x 2 matrix of N points</span>
<span style="color: #8D8D84;">NB.         </span><span style="color: #8D8D84; font-style: italic;">2 x 2 submatrices are (x1 y1 ,: x2 y2) coordinates for each point</span>
<span style="color: #BA36A5;">filtvh</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">]</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">~</span> (<span style="color: #ff0000;">+.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #0000ff;">@:</span> <span style="color: #ff0000;">=</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">"</span>_1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9faad7" class="outline-3">
<h3 id="orgf9faad7">Part 1</h3>
<div class="outline-text-3" id="text-orgf9faad7">
</div>
<div id="outline-container-org7bd4c02" class="outline-4">
<h4 id="org7bd4c02">Function definition</h4>
<div class="outline-text-4" id="text-org7bd4c02">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> 2<span style="color: #0000ff;">&amp;</span>intersect <span style="color: #0000ff;">@</span> filtvh
</pre>
</div>
</div>
</div>

<div id="outline-container-org6140ab7" class="outline-4">
<h4 id="org6140ab7">Test</h4>
<div class="outline-text-4" id="text-org6140ab7">
<div class="org-src-container">
<pre class="src src-j">assert 5 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-05-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1cd9c9e" class="outline-4">
<h4 id="org1cd9c9e">Solution</h4>
<div class="outline-text-4" id="text-org1cd9c9e">
<div class="org-src-container">
<pre class="src src-j">assert 7473 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-05.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf6fb12c" class="outline-3">
<h3 id="orgf6fb12c">Part 2</h3>
<div class="outline-text-3" id="text-orgf6fb12c">
</div>
<div id="outline-container-org5e4f867" class="outline-4">
<h4 id="org5e4f867">Function definition</h4>
<div class="outline-text-4" id="text-org5e4f867">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> 2<span style="color: #0000ff;">&amp;</span>intersect
</pre>
</div>
</div>
</div>
