solutions.org
**** Test

#+BEGIN_SRC j :results output value :tangle src/day05.ijs
assert 12 = part2 inx=. getin 'inputs/day-05-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day05.ijs
assert 24164 = part2 in=. getin 'inputs/day-05.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/6][Day 06: Lanternfish]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day06'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs
getin=: [: , ". readin
#+END_SRC

*** General function definitions

**** Stochastic matrix

This class of problems is most easily solved using a [[https://en.wikipedia.org/wiki/Stochastic_matrix][stochastic matrix]]. The function below defines a stochastic matrix per conditions of the problem,

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs 
NB. stochastic matrix
stoctrix=: (1 0) ,~ (0 0 0 0 0 0 1 0) ,. (e.@i. 8)
#+END_SRC

#+BEGIN_SRC j :results output value :exports both
stoctrix
#+END_SRC

#+RESULTS:
: 0 1 0 0 0 0 0 0 0
: 0 0 1 0 0 0 0 0 0
: 0 0 0 1 0 0 0 0 0
: 0 0 0 0 1 0 0 0 0
: 0 0 0 0 0 1 0 0 0
: 0 0 0 0 0 0 1 0 0
: 1 0 0 0 0 0 0 1 0
: 0 0 0 0 0 0 0 0 1
: 1 0 0 0 0 0 0 0 0

**** Matrix operations

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs
NB. Matrix product
mp=: +/ . *
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs
NB. Raise matrix to nth power
NB. Source: https://code.jsoftware.com/wiki/Essays/Repeated_Squaring
mpow=: 4 : 'mp/ mp~^:(I.|.#:y) x'
#+END_SRC

**** Number of fish

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs
NB. Count number of fish after N generations
NB. x = input/start state
NB. y = generations (integer)
nfish=: [: +/ stoctrix&mpow@] mp ([: <:@#/.~ (i.9) , [)
#+END_SRC

Reading from right to left, =nfish= works as follows, 

+ =([: <:@#/.~ (i.9) , [)=: Count number of fish in input grouped by =x= (age)
+ =stoctrix&mpow@] mp=: Multiply grouped fish count by stochastic matrix after =y= generations
+ =+/=: Total fish after =y= generations

*** Part 1

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs
part1=: nfish&80
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day06.ijs
inx=. getin 'inputs/day-06-example.txt'
assert 26 = inx nfish 18 
assert 5934 = part1 inx
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day06.ijs
assert 360761 = part1 in=. getin 'inputs/day-06.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day06.ijs
part2=: nfish&256
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day06.ijs
assert 26984457539 = part2 inx=. getin 'inputs/day-06-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day06.ijs
assert 1632779838045 = part2 in=. getin 'inputs/day-06.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/7][Day 07: The Treachery of Whales]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day07'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day07.ijs
load 'stats/base'
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day07.ijs
getin=: [: , ". readin
#+END_SRC

*** Part 1

