docs/index.html

<div id="outline-container-org9c44487" class="outline-4">
<h4 id="org9c44487">Test</h4>
<div class="outline-text-4" id="text-org9c44487">
<div class="org-src-container">
<pre class="src src-j">assert 12 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-05-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2572c85" class="outline-4">
<h4 id="org2572c85">Solution</h4>
<div class="outline-text-4" id="text-org2572c85">
<div class="org-src-container">
<pre class="src src-j">assert 24164 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-05.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org94490a0" class="outline-2">
<h2 id="org94490a0"><a href="https://adventofcode.com/2021/day/6">Day 06: Lanternfish</a></h2>
<div class="outline-text-2" id="text-org94490a0">
<div id="text-table-of-contents">
<ul>
<li><a href="#org7f14399">Setup</a></li>
<li><a href="#org459d7e3">Read data</a></li>
<li><a href="#org24e8d31">General function definitions</a>
<ul>
<li><a href="#org597013f">Stochastic matrix</a></li>
<li><a href="#org11a3c8d">Matrix operations</a></li>
<li><a href="#orgd0f6e9d">Number of fish</a></li>
</ul>
</li>
<li><a href="#org7964590">Part 1</a>
<ul>
<li><a href="#orgd8cf4c3">Function definition</a></li>
<li><a href="#org7333a9a">Test</a></li>
<li><a href="#org679accb">Solution</a></li>
</ul>
</li>
<li><a href="#orge3a93f4">Part 2</a>
<ul>
<li><a href="#org3a35f06">Function definition</a></li>
<li><a href="#org7fb3b6e">Test</a></li>
<li><a href="#org10c9708">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7f14399" class="outline-3">
<h3 id="org7f14399">Setup</h3>
<div class="outline-text-3" id="text-org7f14399">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day06'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org459d7e3" class="outline-3">
<h3 id="org459d7e3">Read data</h3>
<div class="outline-text-3" id="text-org459d7e3">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">".</span> readin
</pre>
</div>
</div>
</div>

<div id="outline-container-org24e8d31" class="outline-3">
<h3 id="org24e8d31">General function definitions</h3>
<div class="outline-text-3" id="text-org24e8d31">
</div>
<div id="outline-container-org597013f" class="outline-4">
<h4 id="org597013f">Stochastic matrix</h4>
<div class="outline-text-4" id="text-org597013f">
<p>
This class of problems is most easily solved using a <a href="https://en.wikipedia.org/wiki/Stochastic_matrix">stochastic matrix</a>. The function below defines a stochastic matrix per conditions of the problem,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">stochastic matrix</span>
<span style="color: #BA36A5;">stoctrix</span><span style="color: #000000;">=:</span> (1 0) <span style="color: #ff0000;">,</span><span style="color: #00ff00;">~</span> (0 0 0 0 0 0 1 0) <span style="color: #ff0000;">,.</span> (<span style="color: #ff0000;">e.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span> 8)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">stoctrix
</pre>
</div>

<pre class="example">
0 1 0 0 0 0 0 0 0
0 0 1 0 0 0 0 0 0
0 0 0 1 0 0 0 0 0
0 0 0 0 1 0 0 0 0
0 0 0 0 0 1 0 0 0
0 0 0 0 0 0 1 0 0
1 0 0 0 0 0 0 1 0
0 0 0 0 0 0 0 0 1
1 0 0 0 0 0 0 0 0

</pre>
</div>
</div>

<div id="outline-container-org11a3c8d" class="outline-4">
<h4 id="org11a3c8d">Matrix operations</h4>
<div class="outline-text-4" id="text-org11a3c8d">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Matrix product</span>
<span style="color: #BA36A5;">mp</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #00ff00;">.</span> <span style="color: #ff0000;">*</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Raise matrix to nth power</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Source: https://code.jsoftware.com/wiki/Essays/Repeated_Squaring</span>
<span style="color: #BA36A5;">mpow</span><span style="color: #000000;">=:</span> 4 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'mp/ mp~^:(I.|.#:y) x'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0f6e9d" class="outline-4">
<h4 id="orgd0f6e9d">Number of fish</h4>
<div class="outline-text-4" id="text-orgd0f6e9d">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Count number of fish after N generations</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = input/start state</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = generations (integer)</span>
<span style="color: #BA36A5;">nfish</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> stoctrix<span style="color: #0000ff;">&amp;</span>mpow<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span> mp (<span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">&lt;:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">#</span><span style="color: #00ff00;">/.~</span> (<span style="color: #ff0000;">i.</span>9) <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">[</span>)
</pre>
</div>

<p>
Reading from right to left, <code>nfish</code> works as follows, 
</p>

<ul class="org-ul">
<li><code>([: &lt;:@#/.~ (i.9) , [)</code>: Count number of fish in input grouped by <code>x</code> (age)</li>
<li><code>stoctrix&amp;mpow@] mp</code>: Multiply grouped fish count by stochastic matrix after <code>y</code> generations</li>
<li><code>+/</code>: Total fish after <code>y</code> generations</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7964590" class="outline-3">
<h3 id="org7964590">Part 1</h3>
<div class="outline-text-3" id="text-org7964590">
</div>
<div id="outline-container-orgd8cf4c3" class="outline-4">
<h4 id="orgd8cf4c3">Function definition</h4>
<div class="outline-text-4" id="text-orgd8cf4c3">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> nfish<span style="color: #0000ff;">&amp;</span>80
</pre>
</div>
</div>
</div>

<div id="outline-container-org7333a9a" class="outline-4">
<h4 id="org7333a9a">Test</h4>
<div class="outline-text-4" id="text-org7333a9a">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-06-example.txt'</span>
assert 26 <span style="color: #ff0000;">=</span> inx nfish 18 
assert 5934 <span style="color: #ff0000;">=</span> part1 inx
</pre>
</div>
</div>
</div>

<div id="outline-container-org679accb" class="outline-4">
<h4 id="org679accb">Solution</h4>
<div class="outline-text-4" id="text-org679accb">
<div class="org-src-container">
<pre class="src src-j">assert 360761 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-06.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge3a93f4" class="outline-3">
<h3 id="orge3a93f4">Part 2</h3>
<div class="outline-text-3" id="text-orge3a93f4">
</div>
<div id="outline-container-org3a35f06" class="outline-4">
<h4 id="org3a35f06">Function definition</h4>
<div class="outline-text-4" id="text-org3a35f06">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> nfish<span style="color: #0000ff;">&amp;</span>256
</pre>
</div>
</div>
</div>

<div id="outline-container-org7fb3b6e" class="outline-4">
<h4 id="org7fb3b6e">Test</h4>
<div class="outline-text-4" id="text-org7fb3b6e">
<div class="org-src-container">
<pre class="src src-j">assert 26984457539 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-06-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org10c9708" class="outline-4">
<h4 id="org10c9708">Solution</h4>
<div class="outline-text-4" id="text-org10c9708">
<div class="org-src-container">
<pre class="src src-j">assert 1632779838045 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-06.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org405ecce" class="outline-2">
<h2 id="org405ecce"><a href="https://adventofcode.com/2021/day/7">Day 07: The Treachery of Whales</a></h2>
<div class="outline-text-2" id="text-org405ecce">
<div id="text-table-of-contents">
<ul>
<li><a href="#orge4de8f5">Setup</a></li>
<li><a href="#org36b0489">Read data</a></li>
<li><a href="#org08d3cfd">Part 1</a>
<ul>
<li><a href="#org56f946e">Function definition</a></li>
<li><a href="#orgc8e35d5">Test</a></li>
<li><a href="#orgf4b7ad0">Solution</a></li>
</ul>
</li>
<li><a href="#orgc30080b">Part 2</a>
<ul>
<li><a href="#orga503c38">Function definition</a></li>
<li><a href="#org866bb31">Test</a></li>
<li><a href="#orgf64685d">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge4de8f5" class="outline-3">
<h3 id="orge4de8f5">Setup</h3>
<div class="outline-text-3" id="text-orge4de8f5">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day07'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #008000;">'stats/base'</span>
load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>
