solutions.org
**** Function definition

See this [[https://math.stackexchange.com/questions/318381/on-a-1-d-line-the-point-that-minimizes-the-sum-of-the-distances-is-the-median][stackexchange]] question for the explanation of why median minimizes the distance on a 1-D line. 

#+BEGIN_SRC j :results output silent :tangle src/day07.ijs
part1=: [: +/ |@(] - median)
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day07.ijs
assert 37 = part1 inx=. getin 'inputs/day-07-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day07.ijs
assert 329389 = part1 in=. getin 'inputs/day-07.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day07.ijs
part2=: [: x:@+/ -:@(>: * ])@(] |@- <.@mean)
#+END_SRC

Reading from right to left, this works as follows,

+ =-:@(>: * ])@(] |@- <.@mean)=
  - =(] |@- <.@mean)=: Mean absolute deviation = distance from best horizontal position
    - =<.@mean=: Largest integer not tolerantly exceeding the mean
  - =-:@(>: * ])=: Fuel cost for each crab = $n (n + 1)/2$
+ =+/=: Total fuel cost
+ =x:=: Extended integer (full precision)

**** Test

#+BEGIN_SRC j :results output value :tangle src/day07.ijs
assert 170 = part2 inx=. getin 'inputs/day-07-example.txt'
#+END_SRC

#+RESULTS:

***** Notes                                                        :noexport:

    The solution in the example is =168=. This is obtained by using =>.@mean=, instead of =<.@mean=, in =part2= above. The reason is that the mean 
    optimizes $n^2$ but here it is used to optimize $n (n+1) / 2 = \mathcal{O} (n^2 + n)$. The uncertainty therefore comes from the residual 
    $\mathcal{O}(n)$.

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day07.ijs
assert 86397080 = part2 in=. getin 'inputs/day-07.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/8][Day 08: Seven Segment Search]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day08'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day08.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day08.ijs
getin=: [: /:~&.> ;: readin
#+END_SRC

To simplify the solution, the random-ordered entries are sorted alphabetically. 

*** Part 1

**** Function definitions

This solution is from [[https://github.com/jitwit/aoc/blob/a/J/21/08.ijs][jitwit]].

#+BEGIN_SRC j :results output silent :tangle src/day08.ijs
NB. Count number of digits of given length
NB. y = boxed list of coded digits
NB. x = list of digit lengths
NB. output is count of digits of lengths x in y
ndiglen=: [: +/ [: , [ e.~ #&> @ ]
#+END_SRC

Reading from right to left, =ndiglen= works as follows,

+ =#&> @ ]=: Number of characters in each entry of =y=
+ =[ e.~=: Flag all entry-lengths in =x=
+ =[: +/ [: ,=: Flatten matrix and sum all elements


#+BEGIN_SRC j :results output silent :tangle src/day08.ijs
part1=: (2 3 4 7) ndiglen _4&{."1@]
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day08.ijs
assert 26 = part1 inx=. getin 'inputs/day-08-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day08.ijs
assert 284 = part1 in=. getin 'inputs/day-08.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Unique identifiers

Based on logic from: https://github.com/jitwit/aoc/blob/a/J/21/08.ijs.

  #+BEGIN_SRC j :results output silent :tangle src/day08.ijs
NB. Table of unique identifiers
NB. A digit can be uniquely identified by length, 
NB. intersection with 1 and intersection with 4
tbluids=: _3 ]\ 6 2 3 2 2 2 5 1 2 5 2 3 4 2 4 5 1 3 6 1 3 3 2 2 7 2 4 6 2 4
  #+END_SRC

#+BEGIN_SRC j :results output value :exports results
tbluids
#+END_SRC

#+RESULTS:
#+begin_example
6 2 3
2 2 2
5 1 2
5 2 3
4 2 4
5 1 3
6 1 3
3 2 2
7 2 4
6 2 4
#+end_example

The first column is length. Second and third columns are intersections with 1 and 4.

**** Function definitions

