docs/index.html

<div id="outline-container-org36b0489" class="outline-3">
<h3 id="org36b0489">Read data</h3>
<div class="outline-text-3" id="text-org36b0489">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">".</span> readin
</pre>
</div>
</div>
</div>

<div id="outline-container-org08d3cfd" class="outline-3">
<h3 id="org08d3cfd">Part 1</h3>
<div class="outline-text-3" id="text-org08d3cfd">
</div>
<div id="outline-container-org56f946e" class="outline-4">
<h4 id="org56f946e">Function definition</h4>
<div class="outline-text-4" id="text-org56f946e">
<p>
See this <a href="https://math.stackexchange.com/questions/318381/on-a-1-d-line-the-point-that-minimizes-the-sum-of-the-distances-is-the-median">stackexchange</a> question for the explanation of why median minimizes the distance on a 1-D line. 
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">|</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">-</span> median)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8e35d5" class="outline-4">
<h4 id="orgc8e35d5">Test</h4>
<div class="outline-text-4" id="text-orgc8e35d5">
<div class="org-src-container">
<pre class="src src-j">assert 37 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-07-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4b7ad0" class="outline-4">
<h4 id="orgf4b7ad0">Solution</h4>
<div class="outline-text-4" id="text-orgf4b7ad0">
<div class="org-src-container">
<pre class="src src-j">assert 329389 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-07.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc30080b" class="outline-3">
<h3 id="orgc30080b">Part 2</h3>
<div class="outline-text-3" id="text-orgc30080b">
</div>
<div id="outline-container-orga503c38" class="outline-4">
<h4 id="orga503c38">Function definition</h4>
<div class="outline-text-4" id="text-orga503c38">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">x:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">-:</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&gt;:</span> <span style="color: #ff0000;">*</span> <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">|</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">-</span> <span style="color: #ff0000;">&lt;.</span><span style="color: #0000ff;">@</span>mean)
</pre>
</div>

<p>
Reading from right to left, this works as follows,
</p>

<ul class="org-ul">
<li><code>-:@(&gt;: * ])@(] |@- &lt;.@mean)</code>
<ul class="org-ul">
<li><code>(] |@- &lt;.@mean)</code>: Mean absolute deviation = distance from best horizontal position
<ul class="org-ul">
<li><code>&lt;.@mean</code>: Largest integer not tolerantly exceeding the mean</li>
</ul></li>
<li><code>-:@(&gt;: * ])</code>: Fuel cost for each crab = \(n (n + 1)/2\)</li>
</ul></li>
<li><code>+/</code>: Total fuel cost</li>
<li><code>x:</code>: Extended integer (full precision)</li>
</ul>
</div>
</div>

<div id="outline-container-org866bb31" class="outline-4">
<h4 id="org866bb31">Test</h4>
<div class="outline-text-4" id="text-org866bb31">
<div class="org-src-container">
<pre class="src src-j">assert 170 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-07-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf64685d" class="outline-4">
<h4 id="orgf64685d">Solution</h4>
<div class="outline-text-4" id="text-orgf64685d">
<div class="org-src-container">
<pre class="src src-j">assert 86397080 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-07.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org03abd83" class="outline-2">
<h2 id="org03abd83"><a href="https://adventofcode.com/2021/day/8">Day 08: Seven Segment Search</a></h2>
<div class="outline-text-2" id="text-org03abd83">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgac453e6">Setup</a></li>
<li><a href="#orgb0c37fb">Read data</a></li>
<li><a href="#org9067775">Part 1</a>
<ul>
<li><a href="#orge69e36f">Function definitions</a></li>
<li><a href="#orgb19f8be">Test</a></li>
<li><a href="#org5a5d1ef">Solution</a></li>
</ul>
</li>
<li><a href="#orgddb0969">Part 2</a>
<ul>
<li><a href="#orgea4d4f1">Unique identifiers</a></li>
<li><a href="#org13a0db5">Function definitions</a></li>
<li><a href="#orgd14353b">Test</a></li>
<li><a href="#org8c3c8bf">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgac453e6" class="outline-3">
<h3 id="orgac453e6">Setup</h3>
<div class="outline-text-3" id="text-orgac453e6">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day08'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0c37fb" class="outline-3">
<h3 id="orgb0c37fb">Read data</h3>
<div class="outline-text-3" id="text-orgb0c37fb">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">/:</span><span style="color: #00ff00;">~</span><span style="color: #0000ff;">&amp;.</span><span style="color: #ff0000;">&gt;</span> <span style="color: #ff0000;">;:</span> readin
</pre>
</div>

<p>
To simplify the solution, the random-ordered entries are sorted alphabetically. 
</p>
</div>
</div>

<div id="outline-container-org9067775" class="outline-3">
<h3 id="org9067775">Part 1</h3>
<div class="outline-text-3" id="text-org9067775">
</div>
<div id="outline-container-orge69e36f" class="outline-4">
<h4 id="orge69e36f">Function definitions</h4>
<div class="outline-text-4" id="text-orge69e36f">
<p>
This solution is from <a href="https://github.com/jitwit/aoc/blob/a/J/21/08.ijs">jitwit</a>.
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Count number of digits of given length</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = boxed list of coded digits</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = list of digit lengths</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">output is count of digits of lengths x in y</span>
<span style="color: #BA36A5;">ndiglen</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">[</span> <span style="color: #ff0000;">e.</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">#</span><span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span> <span style="color: #0000ff;">@</span> <span style="color: #ff0000;">]</span>
</pre>
</div>

<p>
Reading from right to left, <code>ndiglen</code> works as follows,
</p>

<ul class="org-ul">
<li><code>#&amp;&gt; @ ]</code>: Number of characters in each entry of <code>y</code></li>
<li><code>[ e.~</code>: Flag all entry-lengths in <code>x</code></li>
<li><code>[: +/ [: ,</code>: Flatten matrix and sum all elements</li>
</ul>


<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> (2 3 4 7) ndiglen _4<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">{.</span><span style="color: #0000ff;">"</span>1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb19f8be" class="outline-4">
<h4 id="orgb19f8be">Test</h4>
<div class="outline-text-4" id="text-orgb19f8be">
<div class="org-src-container">
<pre class="src src-j">assert 26 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-08-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a5d1ef" class="outline-4">
<h4 id="org5a5d1ef">Solution</h4>
<div class="outline-text-4" id="text-org5a5d1ef">
<div class="org-src-container">
<pre class="src src-j">assert 284 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-08.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgddb0969" class="outline-3">
<h3 id="orgddb0969">Part 2</h3>
<div class="outline-text-3" id="text-orgddb0969">
</div>
<div id="outline-container-orgea4d4f1" class="outline-4">
<h4 id="orgea4d4f1">Unique identifiers</h4>
<div class="outline-text-4" id="text-orgea4d4f1">
<p>
Based on logic from: <a href="https://github.com/jitwit/aoc/blob/a/J/21/08.ijs">https://github.com/jitwit/aoc/blob/a/J/21/08.ijs</a>.
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Table of unique identifiers</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">A digit can be uniquely identified by length, </span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">intersection with 1 and intersection with 4</span>
<span style="color: #BA36A5;">tbluids</span><span style="color: #000000;">=:</span> _3 <span style="color: #ff0000;">]</span><span style="color: #00ff00;">\</span> 6 2 3 2 2 2 5 1 2 5 2 3 4 2 4 5 1 3 6 1 3 3 2 2 7 2 4 6 2 4
</pre>
</div>

<pre class="example">
6 2 3
2 2 2
5 1 2
5 2 3
4 2 4
5 1 3
6 1 3
3 2 2
7 2 4
6 2 4
</pre>

<p>
The first column is length. Second and third columns are intersections with 1 and 4.
</p>
</div>
</div>
