solutions.org
***** Get identifiers

#+BEGIN_SRC j :results output silent :tangle src/day08.ijs
NB. Get identifiers of output x based on encodings in y
NB. y = boxed list of outputs
NB. x = boxed list of encoded entries (#y = 10)
getids=: ([: #&> ]) ,. ] +/@e.&>/ (0 2&{)@(/: #&>)@[
#+END_SRC

Reading from right to left, =getids= works as follows,

+ =] +/@e.&>/ (0 2&{)@(/: #&>)@[=: Get intersections of each output entry in =y= with 1 and 4 in encodings =x=
    - =(0 2&{)@(/: #&>)@[=: Sort encodings =y= by length and select digits 1 and 4
+ =([: #&> ]) ,.=: Prepend column with lengths of output entries
+ Result is a =(#y) x 3= matrix,
  - First column are the lengths of output entries
  - Second and third columns are intersections of corresponding outputs with 1 and 4

#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. {. getin 'inputs/day-08-example.txt'
g=. (".&.> ,.~ ]) ('e=. 10&{. y'; 'o=. _4&{. y')
smoutput g
)
#+END_SRC

#+RESULTS:
: ┌───────────┬────────────────────────────────────────────────────────────┐
: │e=. 10&{. y│┌──┬───────┬──────┬──────┬────┬─────┬──────┬─────┬─────┬───┐│
: │           ││be│abcdefg│bcdefg│acdefg│bceg│cdefg│abdefg│bcdef│abcdf│bde││
: │           │└──┴───────┴──────┴──────┴────┴─────┴──────┴─────┴─────┴───┘│
: ├───────────┼────────────────────────────────────────────────────────────┤
: │o=. _4&{. y│┌───────┬─────┬──────┬────┐                                 │
: │           ││abcdefg│bcdef│bcdefg│bceg│                                 │
: │           │└───────┴─────┴──────┴────┘                                 │
: └───────────┴────────────────────────────────────────────────────────────┘

#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. {. getin 'inputs/day-08-example.txt'
(".&.> ,.~ ]) ('e=. 10&{. y'; 'o=. _4&{. y')
g=. (".&.> ,.~ ]) ('s=. (/: #&>) e'; 'd=. (0 2&{) s'; 'i=. o +/@e.&>/ d'; '(#&> o) ,. i'; 'e getids o')
smoutput g
)
#+END_SRC

#+RESULTS:
#+begin_example
┌────────────────┬────────────────────────────────────────────────────────────┐
│s=. (/: #&>) e  │┌──┬───┬────┬─────┬─────┬─────┬──────┬──────┬──────┬───────┐│
│                ││be│bde│bceg│cdefg│bcdef│abcdf│bcdefg│acdefg│abdefg│abcdefg││
│                │└──┴───┴────┴─────┴─────┴─────┴──────┴──────┴──────┴───────┘│
├────────────────┼────────────────────────────────────────────────────────────┤
│d=. (0 2&{) s   │┌──┬────┐                                                   │
│                ││be│bceg│                                                   │
│                │└──┴────┘                                                   │
├────────────────┼────────────────────────────────────────────────────────────┤
│i=. o +/@e.&>/ d│2 4                                                         │
│                │2 3                                                         │
│                │2 4                                                         │
│                │2 4                                                         │
├────────────────┼────────────────────────────────────────────────────────────┤
│(#&> o) ,. i    │7 2 4                                                       │
│                │5 2 3                                                       │
│                │6 2 4                                                       │
│                │4 2 4                                                       │
├────────────────┼────────────────────────────────────────────────────────────┤
│e getids o      │7 2 4                                                       │
│                │5 2 3                                                       │
│                │6 2 4                                                       │
│                │4 2 4                                                       │
└────────────────┴────────────────────────────────────────────────────────────┘
#+end_example

***** Decode

#+BEGIN_SRC j :results output silent :tangle src/day08.ijs
NB. Return decimal number of output in y
NB. y = encodings (first 10 columns) and outputs to decode (last four columns)
NB. x = lookup table with unique identifiers for digits
decode=: 10 #. [ i. (10&{. getids _4&{.)@]
#+END_SRC

Reading from right to left, =decode= works as follows,

+ =[ i. (10&{. getids _4&{.)@]=: Find digits in output of =y= in =x= (table of identifiers)
    - =(10&{. getids _4&{.)@]=: Get identifiers for digits in output of =y= (last four columns) using encodings in =y= (first 10 columns)
+ =10 #.=: Convert individual digits to decimal number

***** Total

#+BEGIN_SRC j :results output silent :tangle src/day08.ijs
part2=: [: +/ (tbluids decode ])"1
 #+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day08.ijs
assert 61229 = part2 inx=. getin 'inputs/day-08-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day08.ijs
assert 973499 = part2 in=. getin 'inputs/day-08.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/9][Day 09: Smoke Basin]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day09'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day09.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day09.ijs
getin=: "."0 readin
#+END_SRC

*** Part 1

**** Function definitions

This solution follows the approach in [[https://www.jsoftware.com/help/learning/31.htm][Golden Rule Example 2: Conway's "Life"]],

