docs/index.html

<div id="outline-container-org13a0db5" class="outline-4">
<h4 id="org13a0db5">Function definitions</h4>
<div class="outline-text-4" id="text-org13a0db5">
</div>
<div id="outline-container-orgbf050c5" class="outline-5">
<h5 id="orgbf050c5">Get identifiers</h5>
<div class="outline-text-5" id="text-orgbf050c5">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Get identifiers of output x based on encodings in y</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = boxed list of outputs</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = boxed list of encoded entries (#y = 10)</span>
<span style="color: #BA36A5;">getids</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">#</span><span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span> <span style="color: #ff0000;">]</span>) <span style="color: #ff0000;">,.</span> <span style="color: #ff0000;">]</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">e.</span><span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span><span style="color: #00ff00;">/</span> (0 2<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">{</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">/:</span> <span style="color: #ff0000;">#</span><span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">[</span>
</pre>
</div>

<p>
Reading from right to left, <code>getids</code> works as follows,
</p>

<ul class="org-ul">
<li><code>] +/@e.&amp;&gt;/ (0 2&amp;{)@(/: #&amp;&gt;)@[</code>: Get intersections of each output entry in <code>y</code> with 1 and 4 in encodings <code>x</code>
<ul class="org-ul">
<li><code>(0 2&amp;{)@(/: #&amp;&gt;)@[</code>: Sort encodings <code>y</code> by length and select digits 1 and 4</li>
</ul></li>
<li><code>([: #&amp;&gt; ]) ,.</code>: Prepend column with lengths of output entries</li>
<li>Result is a <code>(#y) x 3</code> matrix,
<ul class="org-ul">
<li>First column are the lengths of output entries</li>
<li>Second and third columns are intersections of corresponding outputs with 1 and 4</li>
</ul></li>
</ul>

<pre class="example">
┌───────────┬────────────────────────────────────────────────────────────┐
│e=. 10&amp;{. y│┌──┬───────┬──────┬──────┬────┬─────┬──────┬─────┬─────┬───┐│
│           ││be│abcdefg│bcdefg│acdefg│bceg│cdefg│abdefg│bcdef│abcdf│bde││
│           │└──┴───────┴──────┴──────┴────┴─────┴──────┴─────┴─────┴───┘│
├───────────┼────────────────────────────────────────────────────────────┤
│o=. _4&amp;{. y│┌───────┬─────┬──────┬────┐                                 │
│           ││abcdefg│bcdef│bcdefg│bceg│                                 │
│           │└───────┴─────┴──────┴────┘                                 │
└───────────┴────────────────────────────────────────────────────────────┘

</pre>

<pre class="example">
┌────────────────┬────────────────────────────────────────────────────────────┐
│s=. (/: #&amp;&gt;) e  │┌──┬───┬────┬─────┬─────┬─────┬──────┬──────┬──────┬───────┐│
│                ││be│bde│bceg│cdefg│bcdef│abcdf│bcdefg│acdefg│abdefg│abcdefg││
│                │└──┴───┴────┴─────┴─────┴─────┴──────┴──────┴──────┴───────┘│
├────────────────┼────────────────────────────────────────────────────────────┤
│d=. (0 2&amp;{) s   │┌──┬────┐                                                   │
│                ││be│bceg│                                                   │
│                │└──┴────┘                                                   │
├────────────────┼────────────────────────────────────────────────────────────┤
│i=. o +/@e.&amp;&gt;/ d│2 4                                                         │
│                │2 3                                                         │
│                │2 4                                                         │
│                │2 4                                                         │
├────────────────┼────────────────────────────────────────────────────────────┤
│(#&amp;&gt; o) ,. i    │7 2 4                                                       │
│                │5 2 3                                                       │
│                │6 2 4                                                       │
│                │4 2 4                                                       │
├────────────────┼────────────────────────────────────────────────────────────┤
│e getids o      │7 2 4                                                       │
│                │5 2 3                                                       │
│                │6 2 4                                                       │
│                │4 2 4                                                       │
└────────────────┴────────────────────────────────────────────────────────────┘
</pre>
</div>
</div>

<div id="outline-container-org1502994" class="outline-5">
<h5 id="org1502994">Decode</h5>
<div class="outline-text-5" id="text-org1502994">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Return decimal number of output in y</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = encodings (first 10 columns) and outputs to decode (last four columns)</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = lookup table with unique identifiers for digits</span>
<span style="color: #BA36A5;">decode</span><span style="color: #000000;">=:</span> 10 <span style="color: #ff0000;">#.</span> <span style="color: #ff0000;">[</span> <span style="color: #ff0000;">i.</span> (10<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">{.</span> getids _4<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">{.</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>
</pre>
</div>

<p>
Reading from right to left, <code>decode</code> works as follows,
</p>

<ul class="org-ul">
<li><code>[ i. (10&amp;{. getids _4&amp;{.)@]</code>: Find digits in output of <code>y</code> in <code>x</code> (table of identifiers)
<ul class="org-ul">
<li><code>(10&amp;{. getids _4&amp;{.)@]</code>: Get identifiers for digits in output of <code>y</code> (last four columns) using encodings in <code>y</code> (first 10 columns)</li>
</ul></li>
<li><code>10 #.</code>: Convert individual digits to decimal number</li>
</ul>
</div>
</div>

<div id="outline-container-orgd1815e0" class="outline-5">
<h5 id="orgd1815e0">Total</h5>
<div class="outline-text-5" id="text-orgd1815e0">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> (tbluids decode <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">"</span>1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd14353b" class="outline-4">
<h4 id="orgd14353b">Test</h4>
<div class="outline-text-4" id="text-orgd14353b">
<div class="org-src-container">
<pre class="src src-j">assert 61229 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-08-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c3c8bf" class="outline-4">
<h4 id="org8c3c8bf">Solution</h4>
<div class="outline-text-4" id="text-org8c3c8bf">
<div class="org-src-container">
<pre class="src src-j">assert 973499 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-08.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org2ad00a6" class="outline-2">
<h2 id="org2ad00a6"><a href="https://adventofcode.com/2021/day/9">Day 09: Smoke Basin</a></h2>
<div class="outline-text-2" id="text-org2ad00a6">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb53d231">Setup</a></li>
<li><a href="#orga37aa03">Read data</a></li>
<li><a href="#org466a64a">Part 1</a>
<ul>
<li><a href="#org26d91ee">Function definitions</a></li>
<li><a href="#org50655c7">Test</a></li>
<li><a href="#org6ff5767">Solution</a></li>
</ul>
</li>
<li><a href="#orgf0f6d00">Part 2</a>
<ul>
<li><a href="#org94a7554">Function definitions</a></li>
<li><a href="#org4d150be">Test</a></li>
<li><a href="#orgc56f136">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb53d231" class="outline-3">
<h3 id="orgb53d231">Setup</h3>
<div class="outline-text-3" id="text-orgb53d231">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day09'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga37aa03" class="outline-3">
<h3 id="orga37aa03">Read data</h3>
<div class="outline-text-3" id="text-orga37aa03">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">".</span><span style="color: #0000ff;">"</span>0 readin
</pre>
</div>
</div>
</div>

<div id="outline-container-org466a64a" class="outline-3">
<h3 id="org466a64a">Part 1</h3>
<div class="outline-text-3" id="text-org466a64a">
</div>
<div id="outline-container-org26d91ee" class="outline-4">
<h4 id="org26d91ee">Function definitions</h4>
<div class="outline-text-4" id="text-org26d91ee">
<p>
This solution follows the approach in <a href="https://www.jsoftware.com/help/learning/31.htm">Golden Rule Example 2: Conway&rsquo;s &ldquo;Life&rdquo;</a>,
</p>
</div>
