solutions.org
***** Low points

#+BEGIN_SRC j :results output silent :tangle src/day09.ijs
NB. Find low points in matrix y
NB. Low points = locations that are lower than any of 
NB. its adjacent (up, down, left, and right) locations
lowpoints=: ] < [: <./ (_1&* , ])@=@i.@2: (|.!.9) ]
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. getin 'inputs/day-09-example.txt'
g=. (".&.> ,:~ ]) ('y'; 'lowpoints y')
smoutput g
)
#+END_SRC

#+RESULTS:
: ┌───────────────────┬───────────────────┐
: │y                  │lowpoints y        │
: ├───────────────────┼───────────────────┤
: │2 1 9 9 9 4 3 2 1 0│0 1 0 0 0 0 0 0 0 1│
: │3 9 8 7 8 9 4 9 2 1│0 0 0 0 0 0 0 0 0 0│
: │9 8 5 6 7 8 9 8 9 2│0 0 1 0 0 0 0 0 0 0│
: │8 7 6 7 8 9 6 7 8 9│0 0 0 0 0 0 0 0 0 0│
: │9 8 9 9 9 6 5 6 7 8│0 0 0 0 0 0 1 0 0 0│
: └───────────────────┴───────────────────┘

***** Risk level

#+BEGIN_SRC j :results output silent :tangle src/day09.ijs
part1=: [: +/ [: , >:@] * lowpoints
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day09.ijs
assert 15 = part1 inx=. getin 'inputs/day-09-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day09.ijs
assert 548 = part1 in=. getin 'inputs/day-09.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definitions

***** Find adjacent regions

    The problem is greatly simplified by using =findadj= from the [[http://www.jsoftware.com/pipermail/general/2005-August/023886.html][Jforum]].

#+BEGIN_SRC j :results output silent :tangle src/day09.ijs
findadj=: (|."1@|:@:>. * * 1&(|.!.0))^:4^:_ @ (*>:@i.@$)
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. 5 9$1 1 0 0 0 1 1 0 0 1 1 1 0 0 0 1 1 0 0 0 0 0 1 0 0 1 0 0 0 0 0 1 1 1 1
g=. (".&.> ,:~ ]) ('y'; 'findadj y')
smoutput g
)
#+END_SRC

#+RESULTS:
: ┌─────────────────┬─────────────────────────┐
: │y                │findadj y                │
: ├─────────────────┼─────────────────────────┤
: │1 1 0 0 0 1 1 0 0│12 12  0 0  0 45 45  0  0│
: │1 1 1 0 0 0 1 1 0│12 12 12 0  0  0 45 45  0│
: │0 0 0 0 1 0 0 1 0│ 0  0  0 0 45  0  0 45  0│
: │0 0 0 0 1 1 1 1 1│ 0  0  0 0 45 45 45 45 45│
: │1 0 0 0 1 1 0 0 1│37  0  0 0 45 45  0  0 45│
: └─────────────────┴─────────────────────────┘

***** Basin sizes

#+BEGIN_SRC j :results output silent :tangle src/day09.ijs
NB. Basin sizes in descending order
bsizes=: (\:~)@(#/.~)@(] #~ 0 ~: ]) ,@findadj@(9&~:)
#+END_SRC

Reading from right to left, =bsizes= works as follows,

+ =,@findadj@(9&~:)=:
    - =(9&~:)=: Flag all heights not equal to 9.
    - =findadj=: Mark adjacent regions with unique numbers.
    - =,=: Flatten matrix.
+ =(\:~)@(#/.~)@(] #~ 0 ~: ])=:
   - =(] #~ 0 ~: ])=: Remove 0's = region boundaries.
   - =(#/.~)=: Count number of points in each region.
   - =(\:~)=: Sort counts in descending order.

#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. 4 6 $ 2 9 0 8 9 1 6 9 5 7 9 4 4 9 3 5
g=. (".&.> ,.~ ]) ('y'; 'r =. (9&~:) y'; 't=. findadj r'; 's=. (] #~ 0 ~: ]) , t'; 'b=. #/.~ s'; '\:~ b'; 'bsizes y')
smoutput g
)
#+END_SRC

#+RESULTS:
#+begin_example
┌─────────────────────┬───────────────────────────────────────────────┐
│y                    │2 9 0 8 9 1                                    │
│                     │6 9 5 7 9 4                                    │
│                     │4 9 3 5 2 9                                    │
│                     │0 8 9 1 6 9                                    │
├─────────────────────┼───────────────────────────────────────────────┤
│r =. (9&~:) y        │1 0 1 1 0 1                                    │
│                     │1 0 1 1 0 1                                    │
│                     │1 0 1 1 1 0                                    │
│                     │1 1 0 1 1 0                                    │
├─────────────────────┼───────────────────────────────────────────────┤
│t=. findadj r        │20  0 23 23  0 12                              │
│                     │20  0 23 23  0 12                              │
│                     │20  0 23 23 23  0                              │
│                     │20 20  0 23 23  0                              │
├─────────────────────┼───────────────────────────────────────────────┤
│s=. (] #~ 0 ~: ]) , t│20 23 23 12 20 23 23 12 20 23 23 23 20 20 23 23│
├─────────────────────┼───────────────────────────────────────────────┤
│b=. #/.~ s           │5 9 2                                          │
├─────────────────────┼───────────────────────────────────────────────┤
│\:~ b                │9 5 2                                          │
├─────────────────────┼───────────────────────────────────────────────┤
│bsizes y             │9 5 2                                          │
└─────────────────────┴───────────────────────────────────────────────┘
#+end_example

***** Three largest basins

#+BEGIN_SRC j :results output silent :tangle src/day09.ijs
part2=: */ 3&{. bsizes
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day09.ijs
assert 1134 = part2 inx=. getin 'inputs/day-09-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day09.ijs
assert 786048 = part2 in=. getin 'inputs/day-09.txt'
#+END_SRC

#+RESULTS:

