docs/index.html

<div id="outline-container-orgb5b3583" class="outline-5">
<h5 id="orgb5b3583">Low points</h5>
<div class="outline-text-5" id="text-orgb5b3583">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Find low points in matrix y</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Low points = locations that are lower than any of </span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">its adjacent (up, down, left, and right) locations</span>
<span style="color: #BA36A5;">lowpoints</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">]</span> <span style="color: #ff0000;">&lt;</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">&lt;.</span><span style="color: #00ff00;">/</span> (_1<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">*</span> <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">=</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span><span style="color: #0000ff;">@</span>2<span style="color: #ff0000;">:</span> (<span style="color: #ff0000;">|.</span><span style="color: #0000ff;">!.</span>9) <span style="color: #ff0000;">]</span>
</pre>
</div>

<pre class="example">
┌───────────────────┬───────────────────┐
│y                  │lowpoints y        │
├───────────────────┼───────────────────┤
│2 1 9 9 9 4 3 2 1 0│0 1 0 0 0 0 0 0 0 1│
│3 9 8 7 8 9 4 9 2 1│0 0 0 0 0 0 0 0 0 0│
│9 8 5 6 7 8 9 8 9 2│0 0 1 0 0 0 0 0 0 0│
│8 7 6 7 8 9 6 7 8 9│0 0 0 0 0 0 0 0 0 0│
│9 8 9 9 9 6 5 6 7 8│0 0 0 0 0 0 1 0 0 0│
└───────────────────┴───────────────────┘

</pre>
</div>
</div>

<div id="outline-container-org1808c78" class="outline-5">
<h5 id="org1808c78">Risk level</h5>
<div class="outline-text-5" id="text-org1808c78">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">&gt;:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span> <span style="color: #ff0000;">*</span> lowpoints
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org50655c7" class="outline-4">
<h4 id="org50655c7">Test</h4>
<div class="outline-text-4" id="text-org50655c7">
<div class="org-src-container">
<pre class="src src-j">assert 15 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-09-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ff5767" class="outline-4">
<h4 id="org6ff5767">Solution</h4>
<div class="outline-text-4" id="text-org6ff5767">
<div class="org-src-container">
<pre class="src src-j">assert 548 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-09.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf0f6d00" class="outline-3">
<h3 id="orgf0f6d00">Part 2</h3>
<div class="outline-text-3" id="text-orgf0f6d00">
</div>
<div id="outline-container-org94a7554" class="outline-4">
<h4 id="org94a7554">Function definitions</h4>
<div class="outline-text-4" id="text-org94a7554">
</div>
<div id="outline-container-orga05c38b" class="outline-5">
<h5 id="orga05c38b">Find adjacent regions</h5>
<div class="outline-text-5" id="text-orga05c38b">
<p>
The problem is greatly simplified by using <code>findadj</code> from the <a href="http://www.jsoftware.com/pipermail/general/2005-August/023886.html">Jforum</a>.
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">findadj</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">|.</span><span style="color: #0000ff;">"</span>1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">|:</span><span style="color: #0000ff;">@:</span><span style="color: #ff0000;">&gt;.</span> <span style="color: #ff0000;">*</span> <span style="color: #ff0000;">*</span> 1<span style="color: #0000ff;">&amp;</span>(<span style="color: #ff0000;">|.</span><span style="color: #0000ff;">!.</span>0))<span style="color: #0000ff;">^:</span>4<span style="color: #0000ff;">^:</span>_ <span style="color: #0000ff;">@</span> (<span style="color: #ff0000;">*&gt;:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">i.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">$</span>)
</pre>
</div>

<pre class="example">
┌─────────────────┬─────────────────────────┐
│y                │findadj y                │
├─────────────────┼─────────────────────────┤
│1 1 0 0 0 1 1 0 0│12 12  0 0  0 45 45  0  0│
│1 1 1 0 0 0 1 1 0│12 12 12 0  0  0 45 45  0│
│0 0 0 0 1 0 0 1 0│ 0  0  0 0 45  0  0 45  0│
│0 0 0 0 1 1 1 1 1│ 0  0  0 0 45 45 45 45 45│
│1 0 0 0 1 1 0 0 1│37  0  0 0 45 45  0  0 45│
└─────────────────┴─────────────────────────┘

</pre>
</div>
</div>

<div id="outline-container-orga8bed57" class="outline-5">
<h5 id="orga8bed57">Basin sizes</h5>
<div class="outline-text-5" id="text-orga8bed57">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Basin sizes in descending order</span>
<span style="color: #BA36A5;">bsizes</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">\:</span><span style="color: #00ff00;">~</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">#</span><span style="color: #00ff00;">/.~</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">~</span> 0 <span style="color: #ff0000;">~:</span> <span style="color: #ff0000;">]</span>) <span style="color: #ff0000;">,</span><span style="color: #0000ff;">@</span>findadj<span style="color: #0000ff;">@</span>(9<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">~:</span>)
</pre>
</div>

<p>
Reading from right to left, <code>bsizes</code> works as follows,
</p>

<ul class="org-ul">
<li><code>,@findadj@(9&amp;~:)</code>:
<ul class="org-ul">
<li><code>(9&amp;~:)</code>: Flag all heights not equal to 9.</li>
<li><code>findadj</code>: Mark adjacent regions with unique numbers.</li>
<li><code>,</code>: Flatten matrix.</li>
</ul></li>
<li><code>(\:~)@(#/.~)@(] #~ 0 ~: ])</code>:
<ul class="org-ul">
<li><code>(] #~ 0 ~: ])</code>: Remove 0&rsquo;s = region boundaries.</li>
<li><code>(#/.~)</code>: Count number of points in each region.</li>
<li><code>(\:~)</code>: Sort counts in descending order.</li>
</ul></li>
</ul>

<pre class="example">
┌─────────────────────┬───────────────────────────────────────────────┐
│y                    │2 9 0 8 9 1                                    │
│                     │6 9 5 7 9 4                                    │
│                     │4 9 3 5 2 9                                    │
│                     │0 8 9 1 6 9                                    │
├─────────────────────┼───────────────────────────────────────────────┤
│r =. (9&amp;~:) y        │1 0 1 1 0 1                                    │
│                     │1 0 1 1 0 1                                    │
│                     │1 0 1 1 1 0                                    │
│                     │1 1 0 1 1 0                                    │
├─────────────────────┼───────────────────────────────────────────────┤
│t=. findadj r        │20  0 23 23  0 12                              │
│                     │20  0 23 23  0 12                              │
│                     │20  0 23 23 23  0                              │
│                     │20 20  0 23 23  0                              │
├─────────────────────┼───────────────────────────────────────────────┤
│s=. (] #~ 0 ~: ]) , t│20 23 23 12 20 23 23 12 20 23 23 23 20 20 23 23│
├─────────────────────┼───────────────────────────────────────────────┤
│b=. #/.~ s           │5 9 2                                          │
├─────────────────────┼───────────────────────────────────────────────┤
│\:~ b                │9 5 2                                          │
├─────────────────────┼───────────────────────────────────────────────┤
│bsizes y             │9 5 2                                          │
└─────────────────────┴───────────────────────────────────────────────┘
</pre>
</div>
</div>

<div id="outline-container-org4256743" class="outline-5">
<h5 id="org4256743">Three largest basins</h5>
<div class="outline-text-5" id="text-org4256743">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">*</span><span style="color: #00ff00;">/</span> 3<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">{.</span> bsizes
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4d150be" class="outline-4">
<h4 id="org4d150be">Test</h4>
<div class="outline-text-4" id="text-org4d150be">
<div class="org-src-container">
<pre class="src src-j">assert 1134 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-09-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc56f136" class="outline-4">
<h4 id="orgc56f136">Solution</h4>
<div class="outline-text-4" id="text-orgc56f136">
<div class="org-src-container">
<pre class="src src-j">assert 786048 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-09.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>
