solutions.org
** [[https://adventofcode.com/2021/day/10][Day 10: Syntax Scoring]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day10'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** General function definitions

***** Pairs

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
pairs=: _2 [\ '()[]{}<>'
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
pairs
#+END_SRC

#+RESULTS:
: ()
: []
: {}
: <>

***** ❖ Remove characters

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
NB. Replace characters with empty string
NB. y = input string
NB. x = boxed list of characters to remove
rmchars=: ] rplc [: , (<'') ,.~ [
#+END_SRC

Reading from right to left, =rmchars= works as follows,

+ =] rplc [: , (<'') ,.~ [=: Replace all characters of =x= in =y= with blank character ⇒ remove characters in =x= from =y=
    - =[: , (<'') ,.~ [=: Intersperse blank character =''= with =x=

#+BEGIN_SRC j :results output value :exports results
3 : 0''
y=. '{([(<{}[<>[]}>{[]{[(<()>'
r=. ('{}'; '['; '()'; '>')
b=. <''
g=. (".&.> ,.~ ]) ('y'; 'r'; 'b'; ', b ,.~ r '; 'y rplc , b ,.~ r';'r rmchars y')
smoutput g
)
#+END_SRC

#+RESULTS:

***** Filter corrupt or incomplete entries

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
NB. Filter corrupt or incomplete entries
NB. y = input with all pairs removed from each entry
NB. x = 0 (incomplete) and 1 (corrupt)
filterr=: ] #~ [ = [: +./"1 (({:"1 pairs) e. ])&>
#+END_SRC

Reading from right to left, =filterr= works as follows,

+ =[: +./"1 (({:"1 pairs) e. ])&>=: Flag all entries in boxed input =y= with any closed brackets (={:"1 pairs=). These are /corrupt/ entries.
+ =] #~ [ \==: Invert entries if =x = 0= (incomplete). Use resulting Boolean list to filter from =y=.

**** Read data

 #+BEGIN_SRC j :results output silent :tangle src/day10.ijs
 getin=: [: ((<"1 pairs) rmchars ])&.> < readin
 #+END_SRC

*** Part 1

**** Function definitions

***** Scores

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs 
NB. Corrupt entry scores
corrscrs=:(')';'3';']';'57';'}';'1197';'>';'25137')
#+END_SRC

***** First illegal character

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
NB. Get first illegal (closing) character in entry
NB. y = boxed character list (superset or subset of pairs)
illchar=: [: {. (<"0 {."1 pairs) rmchars ]
#+END_SRC

***** Corrupt scores

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
NB. Array with error scores for corrupt entries
NB. y = boxed character list (superset or subset of pairs)
corrupt=: ".@(] rplc&corrscrs)@illchar
#+END_SRC

***** Total syntax error score

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
part1=: [: +/ [: corrupt&> (1: filterr ])
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day10.ijs
assert 26397 = part1 inx=. getin 'inputs/day-10-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day10.ijs
assert 370407 = part1 in=. getin 'inputs/day-10.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

***** Scores

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs 
NB. Incomplete entry scores
incmpscrs=:('(';'1';'[';'2';'{';'3';'<';'4')
#+END_SRC

