docs/index.html

<div id="outline-container-orgf0092ed" class="outline-2">
<h2 id="orgf0092ed"><a href="https://adventofcode.com/2021/day/10">Day 10: Syntax Scoring</a></h2>
<div class="outline-text-2" id="text-orgf0092ed">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgababbaa">Setup</a></li>
<li><a href="#org90e65f8">General function definitions</a>
<ul>
<li><a href="#orgb8b6074">Read data</a></li>
</ul>
</li>
<li><a href="#orgfd5e1c8">Part 1</a>
<ul>
<li><a href="#org0965680">Function definitions</a></li>
<li><a href="#org7575ac8">Test</a></li>
<li><a href="#orgffa526c">Solution</a></li>
</ul>
</li>
<li><a href="#org175a130">Part 2</a>
<ul>
<li><a href="#org454fdfc">Function definition</a></li>
<li><a href="#org79485c5">Test</a></li>
<li><a href="#org7f05678">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgababbaa" class="outline-3">
<h3 id="orgababbaa">Setup</h3>
<div class="outline-text-3" id="text-orgababbaa">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day10'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org90e65f8" class="outline-3">
<h3 id="org90e65f8">General function definitions</h3>
<div class="outline-text-3" id="text-org90e65f8">
</div>
<div id="outline-container-org0369794" class="outline-5">
<h5 id="org0369794">Pairs</h5>
<div class="outline-text-5" id="text-org0369794">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">pairs</span><span style="color: #000000;">=:</span> _2 <span style="color: #ff0000;">[</span><span style="color: #00ff00;">\</span> <span style="color: #008000;">'()[]{}&lt;&gt;'</span>
</pre>
</div>

<pre class="example">
()
[]
{}
&lt;&gt;

</pre>
</div>
</div>

<div id="outline-container-org1a12c1f" class="outline-5">
<h5 id="org1a12c1f">❖ Remove characters</h5>
<div class="outline-text-5" id="text-org1a12c1f">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Replace characters with empty string</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input string</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = boxed list of characters to remove</span>
<span style="color: #BA36A5;">rmchars</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">]</span> rplc <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">,</span> (<span style="color: #ff0000;">&lt;</span><span style="color: #008000;">''</span>) <span style="color: #ff0000;">,.</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">[</span>
</pre>
</div>

<p>
Reading from right to left, <code>rmchars</code> works as follows,
</p>

<ul class="org-ul">
<li><code>] rplc [: , (&lt;'') ,.~ [</code>: Replace all characters of <code>x</code> in <code>y</code> with blank character ⇒ remove characters in <code>x</code> from <code>y</code>
<ul class="org-ul">
<li><code>[: , (&lt;'') ,.~ [</code>: Intersperse blank character <code>''</code> with <code>x</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga157f8d" class="outline-5">
<h5 id="orga157f8d">Filter corrupt or incomplete entries</h5>
<div class="outline-text-5" id="text-orga157f8d">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Filter corrupt or incomplete entries</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input with all pairs removed from each entry</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = 0 (incomplete) and 1 (corrupt)</span>
<span style="color: #BA36A5;">filterr</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">]</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">[</span> <span style="color: #ff0000;">=</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 ((<span style="color: #ff0000;">{:</span><span style="color: #0000ff;">"</span>1 pairs) <span style="color: #ff0000;">e.</span> <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span>
</pre>
</div>

<p>
Reading from right to left, <code>filterr</code> works as follows,
</p>

<ul class="org-ul">
<li><code>[: +./"1 (({:"1 pairs) e. ])&amp;&gt;</code>: Flag all entries in boxed input <code>y</code> with any closed brackets (<code>{:"1 pairs</code>). These are <i>corrupt</i> entries.</li>
<li><code>] #~ [ \=</code>: Invert entries if <code>x = 0</code> (incomplete). Use resulting Boolean list to filter from <code>y</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8b6074" class="outline-4">
<h4 id="orgb8b6074">Read data</h4>
<div class="outline-text-4" id="text-orgb8b6074">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> ((<span style="color: #ff0000;">&lt;</span><span style="color: #0000ff;">"</span>1 pairs) rmchars <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">&amp;.</span><span style="color: #ff0000;">&gt;</span> <span style="color: #ff0000;">&lt;</span> readin
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfd5e1c8" class="outline-3">
<h3 id="orgfd5e1c8">Part 1</h3>
<div class="outline-text-3" id="text-orgfd5e1c8">
</div>
<div id="outline-container-org0965680" class="outline-4">
<h4 id="org0965680">Function definitions</h4>
<div class="outline-text-4" id="text-org0965680">
</div>
<div id="outline-container-org8ed5ae7" class="outline-5">
<h5 id="org8ed5ae7">Scores</h5>
<div class="outline-text-5" id="text-org8ed5ae7">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Corrupt entry scores</span>
<span style="color: #BA36A5;">corrscrs</span><span style="color: #000000;">=:</span>(<span style="color: #008000;">')'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'3'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">']'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'57'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'}'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'1197'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'&gt;'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'25137'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5ecdbe" class="outline-5">
<h5 id="orge5ecdbe">First illegal character</h5>
<div class="outline-text-5" id="text-orge5ecdbe">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Get first illegal (closing) character in entry</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = boxed character list (superset or subset of pairs)</span>
<span style="color: #BA36A5;">illchar</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">{.</span> (<span style="color: #ff0000;">&lt;</span><span style="color: #0000ff;">"</span>0 <span style="color: #ff0000;">{.</span><span style="color: #0000ff;">"</span>1 pairs) rmchars <span style="color: #ff0000;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org11c490c" class="outline-5">
<h5 id="org11c490c">Corrupt scores</h5>
<div class="outline-text-5" id="text-org11c490c">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Array with error scores for corrupt entries</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = boxed character list (superset or subset of pairs)</span>
<span style="color: #BA36A5;">corrupt</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">".</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">]</span> rplc<span style="color: #0000ff;">&amp;</span>corrscrs)<span style="color: #0000ff;">@</span>illchar
</pre>
</div>
</div>
</div>

<div id="outline-container-org89fecd8" class="outline-5">
<h5 id="org89fecd8">Total syntax error score</h5>
<div class="outline-text-5" id="text-org89fecd8">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">[:</span> corrupt<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span> (1<span style="color: #ff0000;">:</span> filterr <span style="color: #ff0000;">]</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7575ac8" class="outline-4">
<h4 id="org7575ac8">Test</h4>
<div class="outline-text-4" id="text-org7575ac8">
<div class="org-src-container">
<pre class="src src-j">assert 26397 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-10-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffa526c" class="outline-4">
<h4 id="orgffa526c">Solution</h4>
<div class="outline-text-4" id="text-orgffa526c">
<div class="org-src-container">
<pre class="src src-j">assert 370407 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-10.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org175a130" class="outline-3">
<h3 id="org175a130">Part 2</h3>
<div class="outline-text-3" id="text-org175a130">
</div>
<div id="outline-container-org454fdfc" class="outline-4">
<h4 id="org454fdfc">Function definition</h4>
<div class="outline-text-4" id="text-org454fdfc">
</div>
<div id="outline-container-orga7e5863" class="outline-5">
<h5 id="orga7e5863">Scores</h5>
<div class="outline-text-5" id="text-orga7e5863">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Incomplete entry scores</span>
<span style="color: #BA36A5;">incmpscrs</span><span style="color: #000000;">=:</span>(<span style="color: #008000;">'('</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'1'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'['</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'2'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'{'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'3'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'&lt;'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'4'</span>)
</pre>
</div>
</div>
</div>
