solutions.org
***** Incomplete scores

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
NB. Array with scores for incomplete entries
incomplete=: ([: {. (+ 5&*)/\.)@:("."0)@(] rplc&incmpscrs)
#+END_SRC

***** Middle score

#+BEGIN_SRC j :results output silent :tangle src/day10.ijs
part2=: [: (<.@-:@# { /:~) [: incomplete&> (0: filterr ])
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day10.ijs
assert 288957 = part2 inx=. getin 'inputs/day-10-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day10.ijs
assert 3249889609 = part2 in=. getin 'inputs/day-10.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/11][Day 11: Dumbo Octopus]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day11'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day11.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day11.ijs
getin=: "."0 readin
#+END_SRC

*** General function definition

***** Pad

#+BEGIN_SRC j :results output silent :tangle src/day11.ijs 
NB. Surround matrix y with constant x
NB. y = input matrix
NB. x = padding constant
pad=: [,.~ [,~ [,. ,
#+END_SRC


#+BEGIN_SRC j :results output value :exports results
(". ;~ ])&> ('i. 2 2'; '0 pad i.2 2'; 'i. 3 4'; '_4 pad i. 3 4')
#+END_SRC

#+RESULTS:
#+begin_example
┌─────────────┬─────────────────┐
│i. 2 2       │0 1              │
│             │2 3              │
├─────────────┼─────────────────┤
│0 pad i.2 2  │0 0 0 0          │
│             │0 0 1 0          │
│             │0 2 3 0          │
│             │0 0 0 0          │
├─────────────┼─────────────────┤
│i. 3 4       │0 1  2  3        │
│             │4 5  6  7        │
│             │8 9 10 11        │
├─────────────┼─────────────────┤
│_4 pad i. 3 4│_4 _4 _4 _4 _4 _4│
│             │_4  0  1  2  3 _4│
│             │_4  4  5  6  7 _4│
│             │_4  8  9 10 11 _4│
│             │_4 _4 _4 _4 _4 _4│
└─────────────┴─────────────────┘
#+end_example

***** Flash

Per conditions of the problem,

- Any octopus with an energy level greater than 9 flashes. This increases the energy level of all adjacent octopuses by 1, including octopuses that are diagonally adjacent. If this causes an octopus to have an energy level greater than 9, it also flashes. This process continues as long as new octopuses keep having their energy level increased beyond 9. (An octopus can only flash at most once per step.)
- Finally, any octopus that flashed during this step has its energy level set to 0, as it used all of its energy to flash.

#+BEGIN_SRC j :results output silent :tangle src/day11.ijs
flash=: ((9&>:) *. (0&<)) * ((1 1 ,: 3 3) (+/@,);._3 (0&pad)@(9&<)) + ]
#+END_SRC

Reading from right to left, =flash= works as follows,

+ =+ ]=: Add the left expression to the input matrix
+ =((9&>:) *. (0&<)) * ((1 1 ,: 3 3) (+/@,);._3 (0&pad)@(9&<)=:
    - =(0&pad)@(9&<)=: Flag all energy levels less than 9 and pad resulting Boolean matrix with zeros.
    - =((1 1 ,: 3 3) (+/@,);._3 (0&pad)@(9&<)=: For a =3 x 3= tile size, with horizontal and vertical displacement of =1 x 1=, sum all elements in each tile.
    - =((9&>:) *. (0&<))=: Set all energy levels that flashed to 0.
     
***** Step

#+BEGIN_SRC j :results otuput silent :tangle src/day11.ijs
NB. Increase the energy level and flash until no energy levels are greater than 9
step=: flash^:_ @: >:
#+END_SRC

*** Part 1

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day11.ijs
NB. y = input
NB. x = number of steps
part1=: 4 : '(+/)@(0&=)@, step^:(i.x) y'
#+END_SRC


**** Test

#+BEGIN_SRC j :results output value :tangle src/day11.ijs
inx=: getin 'inputs/day-11-example.txt'
assert 204 = 11 part1 inx
assert 1656 = 101 part1 inx
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day11.ijs
assert 1594 = 101 part1 in=. getin 'inputs/day-11.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definitions

