docs/index.html

<div id="outline-container-orge2e42ef" class="outline-5">
<h5 id="orge2e42ef">Incomplete scores</h5>
<div class="outline-text-5" id="text-orge2e42ef">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Array with scores for incomplete entries</span>
<span style="color: #BA36A5;">incomplete</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">{.</span> (<span style="color: #ff0000;">+</span> 5<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">*</span>)<span style="color: #00ff00;">/\.</span>)<span style="color: #0000ff;">@:</span>(<span style="color: #ff0000;">".</span><span style="color: #0000ff;">"</span>0)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">]</span> rplc<span style="color: #0000ff;">&amp;</span>incmpscrs)
</pre>
</div>
</div>
</div>

<div id="outline-container-org49c2b69" class="outline-5">
<h5 id="org49c2b69">Middle score</h5>
<div class="outline-text-5" id="text-org49c2b69">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> (<span style="color: #ff0000;">&lt;.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">-:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">#</span> <span style="color: #ff0000;">{</span> <span style="color: #ff0000;">/:</span><span style="color: #00ff00;">~</span>) <span style="color: #ff0000;">[:</span> incomplete<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span> (0<span style="color: #ff0000;">:</span> filterr <span style="color: #ff0000;">]</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org79485c5" class="outline-4">
<h4 id="org79485c5">Test</h4>
<div class="outline-text-4" id="text-org79485c5">
<div class="org-src-container">
<pre class="src src-j">assert 288957 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-10-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f05678" class="outline-4">
<h4 id="org7f05678">Solution</h4>
<div class="outline-text-4" id="text-org7f05678">
<div class="org-src-container">
<pre class="src src-j">assert 3249889609 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-10.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orge342bbe" class="outline-2">
<h2 id="orge342bbe"><a href="https://adventofcode.com/2021/day/11">Day 11: Dumbo Octopus</a></h2>
<div class="outline-text-2" id="text-orge342bbe">
<div id="text-table-of-contents">
<ul>
<li><a href="#org18292ee">Setup</a></li>
<li><a href="#orgb5ef288">Read data</a></li>
<li><a href="#org59199d5">General function definition</a></li>
<li><a href="#org6dd0a58">Part 1</a>
<ul>
<li><a href="#orgf263f86">Function definition</a></li>
<li><a href="#org4f09339">Test</a></li>
<li><a href="#org374dbfa">Solution</a></li>
</ul>
</li>
<li><a href="#orgc8778f0">Part 2</a>
<ul>
<li><a href="#org91144ac">Function definitions</a></li>
<li><a href="#orgd251fea">Test</a></li>
<li><a href="#orga4bbf22">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org18292ee" class="outline-3">
<h3 id="org18292ee">Setup</h3>
<div class="outline-text-3" id="text-org18292ee">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day11'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5ef288" class="outline-3">
<h3 id="orgb5ef288">Read data</h3>
<div class="outline-text-3" id="text-orgb5ef288">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">".</span><span style="color: #0000ff;">"</span>0 readin
</pre>
</div>
</div>
</div>

<div id="outline-container-org59199d5" class="outline-3">
<h3 id="org59199d5">General function definition</h3>
<div class="outline-text-3" id="text-org59199d5">
</div>
<div id="outline-container-org00b0b69" class="outline-5">
<h5 id="org00b0b69">Pad</h5>
<div class="outline-text-5" id="text-org00b0b69">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Surround matrix y with constant x</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input matrix</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = padding constant</span>
<span style="color: #BA36A5;">pad</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[,.</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">[,</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">[,.</span> <span style="color: #ff0000;">,</span>
</pre>
</div>


<pre class="example">
┌─────────────┬─────────────────┐
│i. 2 2       │0 1              │
│             │2 3              │
├─────────────┼─────────────────┤
│0 pad i.2 2  │0 0 0 0          │
│             │0 0 1 0          │
│             │0 2 3 0          │
│             │0 0 0 0          │
├─────────────┼─────────────────┤
│i. 3 4       │0 1  2  3        │
│             │4 5  6  7        │
│             │8 9 10 11        │
├─────────────┼─────────────────┤
│_4 pad i. 3 4│_4 _4 _4 _4 _4 _4│
│             │_4  0  1  2  3 _4│
│             │_4  4  5  6  7 _4│
│             │_4  8  9 10 11 _4│
│             │_4 _4 _4 _4 _4 _4│
└─────────────┴─────────────────┘
</pre>
</div>
</div>

<div id="outline-container-orgbed4872" class="outline-5">
<h5 id="orgbed4872">Flash</h5>
<div class="outline-text-5" id="text-orgbed4872">
<p>
Per conditions of the problem,
</p>

<ul class="org-ul">
<li>Any octopus with an energy level greater than 9 flashes. This increases the energy level of all adjacent octopuses by 1, including octopuses that are diagonally adjacent. If this causes an octopus to have an energy level greater than 9, it also flashes. This process continues as long as new octopuses keep having their energy level increased beyond 9. (An octopus can only flash at most once per step.)</li>
<li>Finally, any octopus that flashed during this step has its energy level set to 0, as it used all of its energy to flash.</li>
</ul>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">flash</span><span style="color: #000000;">=:</span> ((9<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;:</span>) <span style="color: #ff0000;">*.</span> (0<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&lt;</span>)) <span style="color: #ff0000;">*</span> ((1 1 <span style="color: #ff0000;">,:</span> 3 3) (<span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">,</span>)<span style="color: #0000ff;">;.</span>_3 (0<span style="color: #0000ff;">&amp;</span>pad)<span style="color: #0000ff;">@</span>(9<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&lt;</span>)) <span style="color: #ff0000;">+</span> <span style="color: #ff0000;">]</span>
</pre>
</div>

<p>
Reading from right to left, <code>flash</code> works as follows,
</p>

<ul class="org-ul">
<li><code>+ ]</code>: Add the left expression to the input matrix</li>
<li><code>((9&amp;&gt;:) *. (0&amp;&lt;)) * ((1 1 ,: 3 3) (+/@,);._3 (0&amp;pad)@(9&amp;&lt;)</code>:
<ul class="org-ul">
<li><code>(0&amp;pad)@(9&amp;&lt;)</code>: Flag all energy levels less than 9 and pad resulting Boolean matrix with zeros.</li>
<li><code>((1 1 ,: 3 3) (+/@,);._3 (0&amp;pad)@(9&amp;&lt;)</code>: For a <code>3 x 3</code> tile size, with horizontal and vertical displacement of <code>1 x 1</code>, sum all elements in each tile.</li>
<li><code>((9&amp;&gt;:) *. (0&amp;&lt;))</code>: Set all energy levels that flashed to 0.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org44fec1c" class="outline-5">
<h5 id="org44fec1c">Step</h5>
<div class="outline-text-5" id="text-org44fec1c">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Increase the energy level and flash until no energy levels are greater than 9</span>
<span style="color: #BA36A5;">step</span><span style="color: #000000;">=:</span> flash<span style="color: #0000ff;">^:</span>_ <span style="color: #0000ff;">@:</span> <span style="color: #ff0000;">&gt;:</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6dd0a58" class="outline-3">
<h3 id="org6dd0a58">Part 1</h3>
<div class="outline-text-3" id="text-org6dd0a58">
</div>
<div id="outline-container-orgf263f86" class="outline-4">
<h4 id="orgf263f86">Function definition</h4>
<div class="outline-text-4" id="text-orgf263f86">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = number of steps</span>
<span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> 4 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'(+/)@(0&amp;=)@, step^:(i.x) y'</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org4f09339" class="outline-4">
<h4 id="org4f09339">Test</h4>
<div class="outline-text-4" id="text-org4f09339">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">inx</span><span style="color: #000000;">=:</span> getin <span style="color: #008000;">'inputs/day-11-example.txt'</span>
assert 204 <span style="color: #ff0000;">=</span> 11 part1 inx
assert 1656 <span style="color: #ff0000;">=</span> 101 part1 inx
</pre>
</div>
</div>
</div>

<div id="outline-container-org374dbfa" class="outline-4">
<h4 id="org374dbfa">Solution</h4>
<div class="outline-text-4" id="text-org374dbfa">
<div class="org-src-container">
<pre class="src src-j">assert 1594 <span style="color: #ff0000;">=</span> 101 part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-11.txt'</span>
</pre>
</div>
</div>
</div>
</div>
