solutions.org
***** ❖ All equal

#+BEGIN_SRC j :results output silent :tangle src/day11.ijs
NB. Returns 1 if all elements are equal
NB. y = input (infinite rank)
alleq=: 1&=@#@~.@,
#+END_SRC

***** Synchronization step

#+BEGIN_SRC j :results output silent :tangle src/day11.ijs
part2=: [: <:@# [: step^:(-.@alleq)^:(<_) ]
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day11.ijs
assert 195 = part2 inx=. getin 'inputs/day-11-example.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day11.ijs
assert 437 = part2 in=. getin 'inputs/day-11.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/12][Day 12: Passage Pathing]]

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day12'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs
getin=: [: (] , |."1) [: ({. , {:)"1 [: ;: readin ]
#+END_SRC

Reading from right to left, =getin= works as follows,

+ =;: readin ]=: Read file and partition strings into boxed words
+ =({. , {:)"1=: Extract the first and third columns (vertices)
+ =(] , |."1)=: Append the reversed list to itself ⇒ all connections in the undirected graph
 
*** General function definitions

***** Connections to vertex

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs 
NB. Connections to a given vertex x in graph y
connects=: ({:"1)@] #~ ] (E. {."1)~ [
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
y=. _2 [\ ('start'; 'A'; 'A'; 'b'; 'A'; 'end'; 'b'; 'end'; 'A'; 'start'; 'b'; 'start'; 'end'; 'A'; 'end'; 'b'; 'b'; 'A')
(".&.> ,:~ ]) ('y'; '(<''A'') connects y'; '(<''b'') connects y')
#+END_SRC

#+RESULTS:
#+begin_example
┌─────────────┬─────────────────┬─────────────────┐
│y            │(<'A') connects y│(<'b') connects y│
├─────────────┼─────────────────┼─────────────────┤
│┌─────┬─────┐│┌─┬───┬─────┐    │┌───┬─────┬─┐    │
││start│A    │││b│end│start│    ││end│start│A│    │
│├─────┼─────┤│└─┴───┴─────┘    │└───┴─────┴─┘    │
││A    │b    ││                 │                 │
│├─────┼─────┤│                 │                 │
││A    │end  ││                 │                 │
│├─────┼─────┤│                 │                 │
││b    │end  ││                 │                 │
│├─────┼─────┤│                 │                 │
││A    │start││                 │                 │
│├─────┼─────┤│                 │                 │
││b    │start││                 │                 │
│├─────┼─────┤│                 │                 │
││end  │A    ││                 │                 │
│├─────┼─────┤│                 │                 │
││end  │b    ││                 │                 │
│├─────┼─────┤│                 │                 │
││b    │A    ││                 │                 │
│└─────┴─────┘│                 │                 │
└─────────────┴─────────────────┴─────────────────┘
#+end_example

***** Lower case characters

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs
NB. Flag all lower case characters in y
issmall=: (a. {~ 97 + i.26) e.~ ]
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
issmall &.> ('a';'A';'bc';'D';'o';'*'; 'start'; 'fg'; 'NX')
#+END_SRC

#+RESULTS:
: ┌─┬─┬───┬─┬─┬─┬─────────┬───┬───┐
: │1│0│1 1│0│1│0│1 1 1 1 1│1 1│0 0│
: └─┴─┴───┴─┴─┴─┴─────────┴───┴───┘

***** Filter small caves

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs
NB. Filter small caves from graph y
filtsm=: (] #~ ((+./)@:issmall)&>)@:~.@:(('start';'end') -.~ ])@:,
#+END_SRC

