docs/index.html

<div id="outline-container-orgc8778f0" class="outline-3">
<h3 id="orgc8778f0">Part 2</h3>
<div class="outline-text-3" id="text-orgc8778f0">
</div>
<div id="outline-container-org91144ac" class="outline-4">
<h4 id="org91144ac">Function definitions</h4>
<div class="outline-text-4" id="text-org91144ac">
</div>
<div id="outline-container-orgb88b4d8" class="outline-5">
<h5 id="orgb88b4d8">❖ All equal</h5>
<div class="outline-text-5" id="text-orgb88b4d8">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Returns 1 if all elements are equal</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input (infinite rank)</span>
<span style="color: #BA36A5;">alleq</span><span style="color: #000000;">=:</span> 1<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">=</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">#</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">~.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">,</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7201453" class="outline-5">
<h5 id="org7201453">Synchronization step</h5>
<div class="outline-text-5" id="text-org7201453">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">&lt;:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">#</span> <span style="color: #ff0000;">[:</span> step<span style="color: #0000ff;">^:</span>(<span style="color: #ff0000;">-.</span><span style="color: #0000ff;">@</span>alleq)<span style="color: #0000ff;">^:</span>(<span style="color: #ff0000;">&lt;</span>_) <span style="color: #ff0000;">]</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd251fea" class="outline-4">
<h4 id="orgd251fea">Test</h4>
<div class="outline-text-4" id="text-orgd251fea">
<div class="org-src-container">
<pre class="src src-j">assert 195 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-11-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4bbf22" class="outline-4">
<h4 id="orga4bbf22">Solution</h4>
<div class="outline-text-4" id="text-orga4bbf22">
<div class="org-src-container">
<pre class="src src-j">assert 437 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-11.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgad1843f" class="outline-2">
<h2 id="orgad1843f"><a href="https://adventofcode.com/2021/day/12">Day 12: Passage Pathing</a></h2>
<div class="outline-text-2" id="text-orgad1843f">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb8b8f3d">Setup</a></li>
<li><a href="#org4984734">Read data</a></li>
<li><a href="#org851777d">General function definitions</a></li>
<li><a href="#orgb6b07cb">Part 1</a>
<ul>
<li><a href="#orgffe2f8e">Function definition</a></li>
<li><a href="#org1f1c4f0">Test</a></li>
<li><a href="#orge434fb5">Solution</a></li>
</ul>
</li>
<li><a href="#orgddd70c2">Part 2</a>
<ul>
<li><a href="#orgdbb8134">Function definition</a></li>
<li><a href="#orgcb3d976">Test</a></li>
<li><a href="#org1daf8a6">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8b8f3d" class="outline-3">
<h3 id="orgb8b8f3d">Setup</h3>
<div class="outline-text-3" id="text-orgb8b8f3d">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day12'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4984734" class="outline-3">
<h3 id="org4984734">Read data</h3>
<div class="outline-text-3" id="text-org4984734">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> (<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">|.</span><span style="color: #0000ff;">"</span>1) <span style="color: #ff0000;">[:</span> (<span style="color: #ff0000;">{.</span> <span style="color: #ff0000;">,</span> <span style="color: #ff0000;">{:</span>)<span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">;:</span> readin <span style="color: #ff0000;">]</span>
</pre>
</div>

<p>
Reading from right to left, <code>getin</code> works as follows,
</p>

<ul class="org-ul">
<li><code>;: readin ]</code>: Read file and partition strings into boxed words</li>
<li><code>({. , {:)"1</code>: Extract the first and third columns (vertices)</li>
<li><code>(] , |."1)</code>: Append the reversed list to itself ⇒ all connections in the undirected graph</li>
</ul>
</div>
</div>

<div id="outline-container-org851777d" class="outline-3">
<h3 id="org851777d">General function definitions</h3>
<div class="outline-text-3" id="text-org851777d">
</div>
<div id="outline-container-orgae48607" class="outline-5">
<h5 id="orgae48607">Connections to vertex</h5>
<div class="outline-text-5" id="text-orgae48607">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Connections to a given vertex x in graph y</span>
<span style="color: #BA36A5;">connects</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">{:</span><span style="color: #0000ff;">"</span>1)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">]</span> (<span style="color: #ff0000;">E.</span> <span style="color: #ff0000;">{.</span><span style="color: #0000ff;">"</span>1)<span style="color: #00ff00;">~</span> <span style="color: #ff0000;">[</span>
</pre>
</div>

<pre class="example">
┌─────────────┬─────────────────┬─────────────────┐
│y            │(&lt;'A') connects y│(&lt;'b') connects y│
├─────────────┼─────────────────┼─────────────────┤
│┌─────┬─────┐│┌─┬───┬─────┐    │┌───┬─────┬─┐    │
││start│A    │││b│end│start│    ││end│start│A│    │
│├─────┼─────┤│└─┴───┴─────┘    │└───┴─────┴─┘    │
││A    │b    ││                 │                 │
│├─────┼─────┤│                 │                 │
││A    │end  ││                 │                 │
│├─────┼─────┤│                 │                 │
││b    │end  ││                 │                 │
│├─────┼─────┤│                 │                 │
││A    │start││                 │                 │
│├─────┼─────┤│                 │                 │
││b    │start││                 │                 │
│├─────┼─────┤│                 │                 │
││end  │A    ││                 │                 │
│├─────┼─────┤│                 │                 │
││end  │b    ││                 │                 │
│├─────┼─────┤│                 │                 │
││b    │A    ││                 │                 │
│└─────┴─────┘│                 │                 │
└─────────────┴─────────────────┴─────────────────┘
</pre>
</div>
</div>

<div id="outline-container-orga936e3f" class="outline-5">
<h5 id="orga936e3f">Lower case characters</h5>
<div class="outline-text-5" id="text-orga936e3f">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Flag all lower case characters in y</span>
<span style="color: #BA36A5;">issmall</span><span style="color: #000000;">=:</span> (a<span style="color: #00ff00;">.</span> <span style="color: #ff0000;">{</span><span style="color: #00ff00;">~</span> 97 <span style="color: #ff0000;">+</span> <span style="color: #ff0000;">i.</span>26) <span style="color: #ff0000;">e.</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">]</span>
</pre>
</div>

<pre class="example">
┌─┬─┬───┬─┬─┬─┬─────────┬───┬───┐
│1│0│1 1│0│1│0│1 1 1 1 1│1 1│0 0│
└─┴─┴───┴─┴─┴─┴─────────┴───┴───┘

</pre>
</div>
</div>

<div id="outline-container-org0bb9f12" class="outline-5">
<h5 id="org0bb9f12">Filter small caves</h5>
<div class="outline-text-5" id="text-org0bb9f12">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Filter small caves from graph y</span>
<span style="color: #BA36A5;">filtsm</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">~</span> ((<span style="color: #ff0000;">+.</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@:</span>issmall)<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span>)<span style="color: #0000ff;">@:</span><span style="color: #ff0000;">~.</span><span style="color: #0000ff;">@:</span>((<span style="color: #008000;">'start'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'end'</span>) <span style="color: #ff0000;">-.</span><span style="color: #00ff00;">~</span> <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">@:</span><span style="color: #ff0000;">,</span>
</pre>
</div>
</div>
</div>
