solutions.org
***** Count paths

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs
NB. Count paths from x to y in a graph satisfying condition u
dfs=: 1 : 0
(a: u dfs y)
:
cave=. y
seen=. x
if. cave = (<'end') do. 1 return. end.
if. (cave e. seen) do.
  if. (cave = (<'start')) do. 0 return. end.
  if. (cave u (seen (e. # [) smcaves)) do. 0 return. end.
end.
+/ ((seen , cave) u dfs ])"1 0 (y connects graph)
)
#+END_SRC

*** Part 1

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs
part1=: 3 : 'e. dfs (<''start'') [ smcaves=: filtsm graph=: y'
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day12.ijs
assert 10  = part1 inx=. getin 'inputs/day-12-example-1.txt'
assert 19  = part1 inx=. getin 'inputs/day-12-example-2.txt'
assert 226 = part1 inx=. getin 'inputs/day-12-example-3.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day12.ijs
assert 4304 = part1 in=. getin 'inputs/day-12.txt'
#+END_SRC

#+RESULTS:

*** Part 2

**** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day12.ijs
part2=: 3 : '((<:@:# > +/)@:~:@:,) dfs (<''start'') [ smcaves=: filtsm graph=: y'
#+END_SRC

**** Test

#+BEGIN_SRC j :results output value :tangle src/day12.ijs
assert 36   = part2 inx=. getin 'inputs/day-12-example-1.txt'
assert 103  = part2 inx=. getin 'inputs/day-12-example-2.txt'
assert 3509 = part2 inx=. getin 'inputs/day-12-example-3.txt'
#+END_SRC

#+RESULTS:

**** Solution

#+BEGIN_SRC j :results output value :tangle src/day12.ijs
assert 118242 = part2 in=. getin 'inputs/day-12.txt'
#+END_SRC

#+RESULTS:

** [[https://adventofcode.com/2021/day/13][Day 13: Transparent Origami]]

#+TOC: headlines 2 local
*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day13'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Approach 1

This approach closely follows [[https://www.youtube.com/watch?v=w15Z1xObd4U][Russ' Ivy-based solution]].

**** Read and process data

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
rplcxy=: rplc&('y=';'0 ';'x=';'';',';' ')
rawin=: 3 : '>&.> <;._1 (a: , ]) ({. ,&.> {:)"1 (".&.>) ;: rplcxy readin y'
#+END_SRC

=rawin= creates a 2-element boxed list,

1. The first element is the list of dots converted, after removing the =,= (comma) between the numbers, to a two-column integer array.
2. The second element is a two-column integer array of fold instructions as =(x, 0)= or =(0, y)= that is obtained after replacing ~y=~ with =0= and removing ~x=~. 

Since the fold instructions have to be applied recursively to the list of dots, it is convenient to recast the data into a structure conducive for the application of =/\.=.
The =procin= (/process input/) function below does exactly this.

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
procin=: <"1@|.@>@{:, {.
#+END_SRC

=getin= is thusly defined,

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
getin=: procin@rawin
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
y=. 'inputs/day-13-example.txt'
(".&.> ,:~ ]) ('] readin y'; 'rawin y'; 'getin y')
#+END_SRC

#+RESULTS:
#+begin_example
┌──────────────┬───────────┬───────────────┐
│] readin y    │rawin y    │getin y        │
├──────────────┼───────────┼───────────────┤
│6,10          │┌─────┬───┐│┌───┬───┬─────┐│
│0,14          ││ 6 10│0 7│││5 0│0 7│ 6 10││
│9,10          ││ 0 14│5 0│││   │   │ 0 14││
│0,3           ││ 9 10│   │││   │   │ 9 10││
│10,4          ││ 0  3│   │││   │   │ 0  3││
│4,11          ││10  4│   │││   │   │10  4││
│6,0           ││ 4 11│   │││   │   │ 4 11││
│6,12          ││ 6  0│   │││   │   │ 6  0││
│4,1           ││ 6 12│   │││   │   │ 6 12││
│0,13          ││ 4  1│   │││   │   │ 4  1││
│10,12         ││ 0 13│   │││   │   │ 0 13││
│3,4           ││10 12│   │││   │   │10 12││
│3,0           ││ 3  4│   │││   │   │ 3  4││
│8,4           ││ 3  0│   │││   │   │ 3  0││
│1,10          ││ 8  4│   │││   │   │ 8  4││
│2,14          ││ 1 10│   │││   │   │ 1 10││
│8,10          ││ 2 14│   │││   │   │ 2 14││
│9,0           ││ 8 10│   │││   │   │ 8 10││
│              ││ 9  0│   │││   │   │ 9  0││
│fold along y=7│└─────┴───┘│└───┴───┴─────┘│
│fold along x=5│           │               │
└──────────────┴───────────┴───────────────┘
#+end_example

**** General function definition

