docs/index.html

<div id="outline-container-org74ba419" class="outline-5">
<h5 id="org74ba419">Count paths</h5>
<div class="outline-text-5" id="text-org74ba419">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Count paths from x to y in a graph satisfying condition u</span>
<span style="color: #BA36A5;">dfs</span><span style="color: #000000;">=:</span> 1 <span style="color: #ff0000;">:</span> 0
(a<span style="color: #ff0000;">:</span> u dfs y)
<span style="color: #ff0000;">:</span>
<span style="color: #BA36A5;">cave</span><span style="color: #000000;">=.</span> y
<span style="color: #BA36A5;">seen</span><span style="color: #000000;">=.</span> x
<span style="color: #0000FF;">if.</span> cave <span style="color: #ff0000;">=</span> (<span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'end'</span>) <span style="color: #0000FF;">do.</span> 1 <span style="color: #0000FF;">return.</span> <span style="color: #0000FF;">end.</span>
<span style="color: #0000FF;">if.</span> (cave <span style="color: #ff0000;">e.</span> seen) <span style="color: #0000FF;">do.</span>
  <span style="color: #0000FF;">if.</span> (cave <span style="color: #ff0000;">=</span> (<span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'start'</span>)) <span style="color: #0000FF;">do.</span> 0 <span style="color: #0000FF;">return.</span> <span style="color: #0000FF;">end.</span>
  <span style="color: #0000FF;">if.</span> (cave u (seen (<span style="color: #ff0000;">e.</span> <span style="color: #ff0000;">#</span> <span style="color: #ff0000;">[</span>) smcaves)) <span style="color: #0000FF;">do.</span> 0 <span style="color: #0000FF;">return.</span> <span style="color: #0000FF;">end.</span>
<span style="color: #0000FF;">end.</span>
<span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> ((seen <span style="color: #ff0000;">,</span> cave) u dfs <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">"</span>1 0 (y connects graph)
)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb6b07cb" class="outline-3">
<h3 id="orgb6b07cb">Part 1</h3>
<div class="outline-text-3" id="text-orgb6b07cb">
</div>
<div id="outline-container-orgffe2f8e" class="outline-4">
<h4 id="orgffe2f8e">Function definition</h4>
<div class="outline-text-4" id="text-orgffe2f8e">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'e. dfs (&lt;''start'') [ smcaves=: filtsm graph=: y'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f1c4f0" class="outline-4">
<h4 id="org1f1c4f0">Test</h4>
<div class="outline-text-4" id="text-org1f1c4f0">
<div class="org-src-container">
<pre class="src src-j">assert 10  <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12-example-1.txt'</span>
assert 19  <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12-example-2.txt'</span>
assert 226 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12-example-3.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge434fb5" class="outline-4">
<h4 id="orge434fb5">Solution</h4>
<div class="outline-text-4" id="text-orge434fb5">
<div class="org-src-container">
<pre class="src src-j">assert 4304 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgddd70c2" class="outline-3">
<h3 id="orgddd70c2">Part 2</h3>
<div class="outline-text-3" id="text-orgddd70c2">
</div>
<div id="outline-container-orgdbb8134" class="outline-4">
<h4 id="orgdbb8134">Function definition</h4>
<div class="outline-text-4" id="text-orgdbb8134">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'((&lt;:@:# &gt; +/)@:~:@:,) dfs (&lt;''start'') [ smcaves=: filtsm graph=: y'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb3d976" class="outline-4">
<h4 id="orgcb3d976">Test</h4>
<div class="outline-text-4" id="text-orgcb3d976">
<div class="org-src-container">
<pre class="src src-j">assert 36   <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12-example-1.txt'</span>
assert 103  <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12-example-2.txt'</span>
assert 3509 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12-example-3.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1daf8a6" class="outline-4">
<h4 id="org1daf8a6">Solution</h4>
<div class="outline-text-4" id="text-org1daf8a6">
<div class="org-src-container">
<pre class="src src-j">assert 118242 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-12.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc6f10dc" class="outline-2">
<h2 id="orgc6f10dc"><a href="https://adventofcode.com/2021/day/13">Day 13: Transparent Origami</a></h2>
<div class="outline-text-2" id="text-orgc6f10dc">
<div id="text-table-of-contents">
<ul>
<li><a href="#org2a14249">Setup</a></li>
<li><a href="#org3a7b574">Approach 1</a>
<ul>
<li><a href="#orgd520bdc">Read and process data</a></li>
<li><a href="#orge303459">General function definition</a></li>
<li><a href="#org0475415">Part 1</a></li>
<li><a href="#orgc871630">Part 2</a></li>
</ul>
</li>
<li><a href="#org8a2a927">Approach 2</a>
<ul>
<li><a href="#org9a3963f">Read and process data</a></li>
<li><a href="#org0c7b89a">General function definitions</a></li>
<li><a href="#orgfa0825c">Part 1</a></li>
<li><a href="#org08818c0">Part 2</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2a14249" class="outline-3">
<h3 id="org2a14249">Setup</h3>
<div class="outline-text-3" id="text-org2a14249">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day13'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a7b574" class="outline-3">
<h3 id="org3a7b574">Approach 1</h3>
<div class="outline-text-3" id="text-org3a7b574">
<p>
This approach closely follows <a href="https://www.youtube.com/watch?v=w15Z1xObd4U">Russ&rsquo; Ivy-based solution</a>.
</p>
</div>

<div id="outline-container-orgd520bdc" class="outline-4">
<h4 id="orgd520bdc">Read and process data</h4>
<div class="outline-text-4" id="text-orgd520bdc">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">rplcxy</span><span style="color: #000000;">=:</span> rplc<span style="color: #0000ff;">&amp;</span>(<span style="color: #008000;">'y='</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'0 '</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'x='</span><span style="color: #ff0000;">;</span><span style="color: #008000;">''</span><span style="color: #ff0000;">;</span><span style="color: #008000;">','</span><span style="color: #ff0000;">;</span><span style="color: #008000;">' '</span>)
<span style="color: #BA36A5;">rawin</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'&gt;&amp;.&gt; &lt;;._1 (a: , ]) ({. ,&amp;.&gt; {:)"1 (".&amp;.&gt;) ;: rplcxy readin y'</span>
</pre>
</div>

<p>
<code>rawin</code> creates a 2-element boxed list,
</p>

<ol class="org-ol">
<li>The first element is the list of dots converted, after removing the <code>,</code> (comma) between the numbers, to a two-column integer array.</li>
<li>The second element is a two-column integer array of fold instructions as <code>(x, 0)</code> or <code>(0, y)</code> that is obtained after replacing <code>y=</code> with <code>0</code> and removing <code>x=</code>.</li>
</ol>

<p>
Since the fold instructions have to be applied recursively to the list of dots, it is convenient to recast the data into a structure conducive for the application of <code>/\.</code>.
The <code>procin</code> (<i>process input</i>) function below does exactly this.
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">procin</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">&lt;</span><span style="color: #0000ff;">"</span>1<span style="color: #0000ff;">@</span><span style="color: #ff0000;">|.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">&gt;</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">{:,</span> <span style="color: #ff0000;">{.</span>
</pre>
</div>

<p>
<code>getin</code> is thusly defined,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> procin<span style="color: #0000ff;">@</span>rawin
</pre>
</div>

<pre class="example">
┌──────────────┬───────────┬───────────────┐
│] readin y    │rawin y    │getin y        │
├──────────────┼───────────┼───────────────┤
│6,10          │┌─────┬───┐│┌───┬───┬─────┐│
│0,14          ││ 6 10│0 7│││5 0│0 7│ 6 10││
│9,10          ││ 0 14│5 0│││   │   │ 0 14││
│0,3           ││ 9 10│   │││   │   │ 9 10││
│10,4          ││ 0  3│   │││   │   │ 0  3││
│4,11          ││10  4│   │││   │   │10  4││
│6,0           ││ 4 11│   │││   │   │ 4 11││
│6,12          ││ 6  0│   │││   │   │ 6  0││
│4,1           ││ 6 12│   │││   │   │ 6 12││
│0,13          ││ 4  1│   │││   │   │ 4  1││
│10,12         ││ 0 13│   │││   │   │ 0 13││
│3,4           ││10 12│   │││   │   │10 12││
│3,0           ││ 3  4│   │││   │   │ 3  4││
│8,4           ││ 3  0│   │││   │   │ 3  0││
│1,10          ││ 8  4│   │││   │   │ 8  4││
│2,14          ││ 1 10│   │││   │   │ 1 10││
│8,10          ││ 2 14│   │││   │   │ 2 14││
│9,0           ││ 8 10│   │││   │   │ 8 10││
│              ││ 9  0│   │││   │   │ 9  0││
│fold along y=7│└─────┴───┘│└───┴───┴─────┘│
│fold along x=5│           │               │
└──────────────┴───────────┴───────────────┘
</pre>
</div>
</div>
