solutions.org
***** Fold

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs 
NB. Fold point x across y
fold=: (] - |@:-~)`[@.(0: = ])
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
(".&.> ,:~ ]) ('5 fold 3'; '8 fold 6'; '3 fold 0'; '0 fold 4')
#+END_SRC

#+RESULTS:
: ┌────────┬────────┬────────┬────────┐
: │5 fold 3│8 fold 6│3 fold 0│0 fold 4│
: ├────────┼────────┼────────┼────────┤
: │1       │4       │3       │0       │
: └────────┴────────┴────────┴────────┘

***** Origami

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
NB. Recursively apply folds x to series of points y
origami=: ((fold"0)~"1/)&.>/\.
#+END_SRC

***** Marks

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
NB. Creates grid of 0s with 1s (marks) at locations of points in y
marks=: 3 : '1 (|.&.> <"1 y) } (0 * i. |. >: >./ y)'
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
yl=. (1 0, 3 1, 2 2, 1 3 ,: 2 4)
y=. }. {.&.>/\. ((<yl) ,~  (<"0 i.5))
(; 5 # <('y'; 'marks y')) ,: , |: y ,: marks &.> y
#+END_SRC

#+RESULTS:
: ┌───┬───────┬───┬───────┬───┬───────┬───┬───────┬───┬───────┐
: │y  │marks y│y  │marks y│y  │marks y│y  │marks y│y  │marks y│
: ├───┼───────┼───┼───────┼───┼───────┼───┼───────┼───┼───────┤
: │1 0│0 1    │1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│
: │   │       │3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│
: │   │       │   │       │2 2│0 0 1 0│2 2│0 0 1 0│2 2│0 0 1 0│
: │   │       │   │       │   │       │1 3│0 1 0 0│1 3│0 1 0 0│
: │   │       │   │       │   │       │   │       │2 4│0 0 1 0│
: └───┴───────┴───┴───────┴───┴───────┴───┴───────┴───┴───────┘

**** Part 1

***** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
part1=: 3 : '+/ ~: > _2&{ origami y'
#+END_SRC

***** Test

 #+BEGIN_SRC j :results output value :tangle src/day13.ijs
assert 17 = part1 inx=. getin 'inputs/day-13-example.txt'
 #+END_SRC

 #+RESULTS:

***** Solution

 #+BEGIN_SRC j :results output value :tangle src/day13.ijs
assert 827 = part1 in=. getin 'inputs/day-13.txt'
 #+END_SRC

 #+RESULTS:

**** Part 2

***** Function definition

 #+BEGIN_SRC j :results output silent :tangle src/day13.ijs
part2=: 3 : '_ * -. >  marks ~. > @ {. origami y'
 #+END_SRC

***** Solution

 #+BEGIN_SRC j :results output value :exports both :tangle src/day13.ijs
part2 in=. getin 'inputs/day-13.txt' NB. EAHKRECP
 #+END_SRC

 #+RESULTS:
 : 0 0 0 0 _ _ 0 0 _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 _ _ 0 0 0 0 _ _ 0 0 _ _ 0 0 0 _
 : 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ _ 0 _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0
 : 0 0 0 _ _ 0 _ _ 0 _ 0 0 0 0 _ 0 0 _ _ _ 0 _ _ 0 _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ 0
 : 0 _ _ _ _ 0 0 0 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ _ _ 0 0 0 _
 : 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ _
 : 0 0 0 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 0 _ _ 0 0 _ _ 0 _ _ _
 
*** Approach 2

This approach follows that laid out in the problem.

**** Read and process data

***** Raw input

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
rplcxy=: rplc&('y=';'_';'x=';'';',';' ')
rawin=: 3 : '>&.> <;._1 (a: , ]) ({. ,&.> {:)"1 (".&.>) ;: rplcxy readin y'
#+END_SRC

=rawin= creates a 2-element boxed list,

1. The first element is the list of dots converted, after removing the =,= (comma) between the numbers, to a two-column integer array.
2. The second element is an integer array of fold instructions with the convention that negative numbers are used to denote folds along =y= 
(the convention of [[*Approach 1]] could also have been used but this is simpler).

***** Points to grid 

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
NB. Creates grid of 0s with 1s (marks) at locations of points in y
marks=: 3 : '1 (|.&.> <"1 y) } (0 * i. |. >: >./ y)'
#+END_SRC

As in [[*Approach 1]], the =marks= function expands a set of =(x, y)= points on a (boolean) grid,

#+BEGIN_SRC j :results output value :exports results
yl=. (1 0, 3 1, 2 2, 1 3 ,: 2 4)
y=. }. {.&.>/\. ((<yl) ,~  (<"0 i.5))
(; 5 # <('y'; 'marks y')) ,: , |: y ,: marks &.> y
#+END_SRC

#+RESULTS:
: ┌───┬───────┬───┬───────┬───┬───────┬───┬───────┬───┬───────┐
: │y  │marks y│y  │marks y│y  │marks y│y  │marks y│y  │marks y│
: ├───┼───────┼───┼───────┼───┼───────┼───┼───────┼───┼───────┤
: │1 0│0 1    │1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│
: │   │       │3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│
: │   │       │   │       │2 2│0 0 1 0│2 2│0 0 1 0│2 2│0 0 1 0│
: │   │       │   │       │   │       │1 3│0 1 0 0│1 3│0 1 0 0│
: │   │       │   │       │   │       │   │       │2 4│0 0 1 0│
: └───┴───────┴───┴───────┴───┴───────┴───┴───────┴───┴───────┘

