docs/index.html

<div id="outline-container-orge303459" class="outline-4">
<h4 id="orge303459">General function definition</h4>
<div class="outline-text-4" id="text-orge303459">
</div>
<div id="outline-container-org9c3723f" class="outline-5">
<h5 id="org9c3723f">Fold</h5>
<div class="outline-text-5" id="text-org9c3723f">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Fold point x across y</span>
<span style="color: #BA36A5;">fold</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">-</span> <span style="color: #ff0000;">|</span><span style="color: #0000ff;">@:</span><span style="color: #ff0000;">-</span><span style="color: #00ff00;">~</span>)<span style="color: #0000ff;">`</span><span style="color: #ff0000;">[</span><span style="color: #0000ff;">@.</span>(0<span style="color: #ff0000;">:</span> <span style="color: #ff0000;">=</span> <span style="color: #ff0000;">]</span>)
</pre>
</div>

<pre class="example">
┌────────┬────────┬────────┬────────┐
│5 fold 3│8 fold 6│3 fold 0│0 fold 4│
├────────┼────────┼────────┼────────┤
│1       │4       │3       │0       │
└────────┴────────┴────────┴────────┘

</pre>
</div>
</div>

<div id="outline-container-orgc4ac10d" class="outline-5">
<h5 id="orgc4ac10d">Origami</h5>
<div class="outline-text-5" id="text-orgc4ac10d">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Recursively apply folds x to series of points y</span>
<span style="color: #BA36A5;">origami</span><span style="color: #000000;">=:</span> ((fold<span style="color: #0000ff;">"</span>0)<span style="color: #00ff00;">~</span><span style="color: #0000ff;">"</span>1<span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">&amp;.</span><span style="color: #ff0000;">&gt;</span><span style="color: #00ff00;">/\.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ff40f8" class="outline-5">
<h5 id="org8ff40f8">Marks</h5>
<div class="outline-text-5" id="text-org8ff40f8">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Creates grid of 0s with 1s (marks) at locations of points in y</span>
<span style="color: #BA36A5;">marks</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'1 (|.&amp;.&gt; &lt;"1 y) } (0 * i. |. &gt;: &gt;./ y)'</span>
</pre>
</div>

<pre class="example">
┌───┬───────┬───┬───────┬───┬───────┬───┬───────┬───┬───────┐
│y  │marks y│y  │marks y│y  │marks y│y  │marks y│y  │marks y│
├───┼───────┼───┼───────┼───┼───────┼───┼───────┼───┼───────┤
│1 0│0 1    │1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│
│   │       │3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│
│   │       │   │       │2 2│0 0 1 0│2 2│0 0 1 0│2 2│0 0 1 0│
│   │       │   │       │   │       │1 3│0 1 0 0│1 3│0 1 0 0│
│   │       │   │       │   │       │   │       │2 4│0 0 1 0│
└───┴───────┴───┴───────┴───┴───────┴───┴───────┴───┴───────┘

</pre>
</div>
</div>
</div>

<div id="outline-container-org0475415" class="outline-4">
<h4 id="org0475415">Part 1</h4>
<div class="outline-text-4" id="text-org0475415">
</div>
<div id="outline-container-org7f41101" class="outline-5">
<h5 id="org7f41101">Function definition</h5>
<div class="outline-text-5" id="text-org7f41101">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'+/ ~: &gt; _2&amp;{ origami y'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org340fdc6" class="outline-5">
<h5 id="org340fdc6">Test</h5>
<div class="outline-text-5" id="text-org340fdc6">
<div class="org-src-container">
<pre class="src src-j">assert 17 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-13-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5a7616" class="outline-5">
<h5 id="orgf5a7616">Solution</h5>
<div class="outline-text-5" id="text-orgf5a7616">
<div class="org-src-container">
<pre class="src src-j">assert 827 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-13.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc871630" class="outline-4">
<h4 id="orgc871630">Part 2</h4>
<div class="outline-text-4" id="text-orgc871630">
</div>
<div id="outline-container-orgbf41ea3" class="outline-5">
<h5 id="orgbf41ea3">Function definition</h5>
<div class="outline-text-5" id="text-orgbf41ea3">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'_ * -. &gt;  marks ~. &gt; @ {. origami y'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1864442" class="outline-5">
<h5 id="org1864442">Solution</h5>
<div class="outline-text-5" id="text-org1864442">
<div class="org-src-container">
<pre class="src src-j">part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-13.txt'</span> <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">EAHKRECP</span>
</pre>
</div>

<pre class="example">
0 0 0 0 _ _ 0 0 _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 _ _ 0 0 0 0 _ _ 0 0 _ _ 0 0 0 _
0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ _ 0 _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0
0 0 0 _ _ 0 _ _ 0 _ 0 0 0 0 _ 0 0 _ _ _ 0 _ _ 0 _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ 0
0 _ _ _ _ 0 0 0 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ _ _ 0 0 0 _
0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ _
0 0 0 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 0 _ _ 0 0 _ _ 0 _ _ _

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8a2a927" class="outline-3">
<h3 id="org8a2a927">Approach 2</h3>
<div class="outline-text-3" id="text-org8a2a927">
<p>
This approach follows that laid out in the problem.
</p>
</div>

<div id="outline-container-org9a3963f" class="outline-4">
<h4 id="org9a3963f">Read and process data</h4>
<div class="outline-text-4" id="text-org9a3963f">
</div>
<div id="outline-container-org72d0133" class="outline-5">
<h5 id="org72d0133">Raw input</h5>
<div class="outline-text-5" id="text-org72d0133">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">rplcxy</span><span style="color: #000000;">=:</span> rplc<span style="color: #0000ff;">&amp;</span>(<span style="color: #008000;">'y='</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'_'</span><span style="color: #ff0000;">;</span><span style="color: #008000;">'x='</span><span style="color: #ff0000;">;</span><span style="color: #008000;">''</span><span style="color: #ff0000;">;</span><span style="color: #008000;">','</span><span style="color: #ff0000;">;</span><span style="color: #008000;">' '</span>)
<span style="color: #BA36A5;">rawin</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'&gt;&amp;.&gt; &lt;;._1 (a: , ]) ({. ,&amp;.&gt; {:)"1 (".&amp;.&gt;) ;: rplcxy readin y'</span>
</pre>
</div>

<p>
<code>rawin</code> creates a 2-element boxed list,
</p>

<ol class="org-ol">
<li>The first element is the list of dots converted, after removing the <code>,</code> (comma) between the numbers, to a two-column integer array.</li>
<li>The second element is an integer array of fold instructions with the convention that negative numbers are used to denote folds along <code>y</code></li>
</ol>
<p>
(the convention of <a href="#org3a7b574">Approach 1</a> could also have been used but this is simpler).
</p>
</div>
</div>

<div id="outline-container-org97073e5" class="outline-5">
<h5 id="org97073e5">Points to grid</h5>
<div class="outline-text-5" id="text-org97073e5">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Creates grid of 0s with 1s (marks) at locations of points in y</span>
<span style="color: #BA36A5;">marks</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'1 (|.&amp;.&gt; &lt;"1 y) } (0 * i. |. &gt;: &gt;./ y)'</span>
</pre>
</div>

<p>
As in <a href="#org3a7b574">Approach 1</a>, the <code>marks</code> function expands a set of <code>(x, y)</code> points on a (boolean) grid,
</p>

<pre class="example">
┌───┬───────┬───┬───────┬───┬───────┬───┬───────┬───┬───────┐
│y  │marks y│y  │marks y│y  │marks y│y  │marks y│y  │marks y│
├───┼───────┼───┼───────┼───┼───────┼───┼───────┼───┼───────┤
│1 0│0 1    │1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│1 0│0 1 0 0│
│   │       │3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│3 1│0 0 0 1│
│   │       │   │       │2 2│0 0 1 0│2 2│0 0 1 0│2 2│0 0 1 0│
│   │       │   │       │   │       │1 3│0 1 0 0│1 3│0 1 0 0│
│   │       │   │       │   │       │   │       │2 4│0 0 1 0│
└───┴───────┴───┴───────┴───┴───────┴───┴───────┴───┴───────┘

</pre>
</div>
</div>
