solutions.org
***** Get input

Since the folds are to be applied recursively, =getin= casts the data in a format conducive for the application of =/\.=

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
getin=: 3 : '(;/@,@|.@(] + *) i) , <(marks d) [ ''d i''=. rawin y'
#+END_SRC

Indexing starts at zero, so magnitudes of both the =x= (positive) and =y= (negative) fold instructions are incremented (=(] + *) i=).

#+BEGIN_SRC j :results output value :exports results
y=. 'inputs/day-13-example.txt'
(".&.> ,:~ ]) ('] readin y'; 'getin y')
#+END_SRC

#+RESULTS:
#+begin_example
┌──────────────┬────────────────────────────┐
│] readin y    │getin y                     │
├──────────────┼────────────────────────────┤
│6,10          │┌─┬──┬─────────────────────┐│
│0,14          ││6│_8│0 0 0 1 0 0 1 0 0 1 0││
│9,10          ││ │  │0 0 0 0 1 0 0 0 0 0 0││
│0,3           ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│10,4          ││ │  │1 0 0 0 0 0 0 0 0 0 0││
│4,11          ││ │  │0 0 0 1 0 0 0 0 1 0 1││
│6,0           ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│6,12          ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│4,1           ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│0,13          ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│10,12         ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│3,4           ││ │  │0 1 0 0 0 0 1 0 1 1 0││
│3,0           ││ │  │0 0 0 0 1 0 0 0 0 0 0││
│8,4           ││ │  │0 0 0 0 0 0 1 0 0 0 1││
│1,10          ││ │  │1 0 0 0 0 0 0 0 0 0 0││
│2,14          ││ │  │1 0 1 0 0 0 0 0 0 0 0││
│8,10          │└─┴──┴─────────────────────┘│
│9,0           │                            │
│              │                            │
│fold along y=7│                            │
│fold along x=5│                            │
└──────────────┴────────────────────────────┘
#+end_example

**** General function definitions

***** ❖ Fold

A generic function to fold along any axis is defined as,

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs 
NB. Conjunction to split boolean matrix y by u and v across x and 
NB. join resulting submatrices
NB. y = input matrix
NB. x = integer (fold along)
NB. u, v = 'selection' verbs => {., }., {:, }:, m&}
fold=: 2 : '|.@(+./)@(u ,: v)~'
#+END_SRC

=fold= is defined to be consistent with the adapted [[*Conventions]].

This conjunction makes use of the auto fill property of [[https://code.jsoftware.com/wiki/Vocabulary/commaco#dyadic][laminate]],

#+BEGIN_SRC j :results output value :exports results
y=. 4 3 $ 2 < ?.12#6
(".&.> ,:~ ]) ('y'; '(}. y) ,: ({. y)')
#+END_SRC

#+RESULTS:
#+begin_example
┌─────┬────────────────┐
│y    │(}. y) ,: ({. y)│
├─────┼────────────────┤
│0 0 1│0 1 1           │
│0 1 1│1 1 0           │
│1 1 0│0 1 0           │
│0 1 0│                │
│     │0 0 1           │
│     │0 0 0           │
│     │0 0 0           │
└─────┴────────────────┘
#+end_example

that is, =,:= can be used to split the rows or columns of the matrix into separate sub-matrices of the same size.

***** Horizontal and vertical folds

The horizontal fold is now easily defined by providing the appropriate =u= and =v=,

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
NB. Fold boolean matrix y along rows x
foldh=: |.@}:@{. fold }.
#+END_SRC


#+BEGIN_SRC j :results output value :exports results
y=. 8 5 $ 2 < ?.12#6
NB. (".&.> ,:~ ]) ('y'; '5 foldh y'; '6 foldh y')
(".&.> ,:~ ]) ('y'; 'y foldh 5'; 'y foldh 6')
#+END_SRC

#+RESULTS:
#+begin_example
┌─────────┬─────────┬─────────┐
│y        │y foldh 5│y foldh 6│
├─────────┼─────────┼─────────┤
│0 0 1 0 1│0 0 1 0 1│0 0 1 0 1│
│1 1 1 0 0│1 1 1 1 0│1 1 1 0 0│
│1 0 0 0 1│1 1 0 0 1│1 0 0 0 1│
│0 1 1 1 1│0 1 1 1 1│0 1 1 1 1│
│0 0 1 0 0│         │1 1 1 0 1│
│0 1 0 1 1│         │         │
│1 1 0 0 1│         │         │
│0 0 0 1 0│         │         │
└─────────┴─────────┴─────────┘
#+end_example

Note that =foldh= works as expected only for =x >: (# y)=.

The vertical fold is the horizontal fold on the transposed matrix,

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
NB. Fold boolean matrix x along columns y
foldv=: foldh&.|: 
#+END_SRC

Lastly, by the convention adopted above, vertical folds are applied to the positive instructions and horizontal folds to the negative instructions,

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
NB. Fold boolean matrix y along column or row x
foldvh=: foldv`([ foldh |@]) @. (0: > ])
#+END_SRC

***** Origami

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
NB. Recursively apply folds x to boolean matrix y
origami=: (foldvh~)&.>/\.
#+END_SRC

**** Part 1

***** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
part1=: 3 : '+/ , > (_2&{) origami y'
#+END_SRC

***** Test

#+BEGIN_SRC j :results output value :tangle src/day13.ijs
assert 17 = part1 inx=. getin 'inputs/day-13-example.txt'
#+END_SRC

#+RESULTS:

***** Solution

#+BEGIN_SRC j :results output value :tangle src/day13.ijs
assert 827 = part1 in=. getin 'inputs/day-13.txt'
#+END_SRC

 #+RESULTS:

**** Part 2

***** Function definition

#+BEGIN_SRC j :results output silent :tangle src/day13.ijs
part2=: 3 : '_ * -. > @ {. origami y'
#+END_SRC

***** Solution

#+BEGIN_SRC j :results output value :exports both :tangle src/day13.ijs
part2 in=. getin 'inputs/day-13.txt'  NB. EAHKRECP
#+END_SRC

 #+RESULTS:
 : 0 0 0 0 _ _ 0 0 _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 _ _ 0 0 0 0 _ _ 0 0 _ _ 0 0 0 _ _
 : 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ _ 0 _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _
 : 0 0 0 _ _ 0 _ _ 0 _ 0 0 0 0 _ 0 0 _ _ _ 0 _ _ 0 _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ 0 _
 : 0 _ _ _ _ 0 0 0 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ _ _ 0 0 0 _ _
 : 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ _ _
 : 0 0 0 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 0 _ _ 0 0 _ _ 0 _ _ _ _
 
