docs/index.html

<div id="outline-container-orgc47996c" class="outline-5">
<h5 id="orgc47996c">Get input</h5>
<div class="outline-text-5" id="text-orgc47996c">
<p>
Since the folds are to be applied recursively, <code>getin</code> casts the data in a format conducive for the application of <code>/\.</code>
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'(;/@,@|.@(] + *) i) , &lt;(marks d) [ ''d i''=. rawin y'</span>
</pre>
</div>

<p>
Indexing starts at zero, so magnitudes of both the <code>x</code> (positive) and <code>y</code> (negative) fold instructions are incremented (<code>(] + *) i</code>).
</p>

<pre class="example">
┌──────────────┬────────────────────────────┐
│] readin y    │getin y                     │
├──────────────┼────────────────────────────┤
│6,10          │┌─┬──┬─────────────────────┐│
│0,14          ││6│_8│0 0 0 1 0 0 1 0 0 1 0││
│9,10          ││ │  │0 0 0 0 1 0 0 0 0 0 0││
│0,3           ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│10,4          ││ │  │1 0 0 0 0 0 0 0 0 0 0││
│4,11          ││ │  │0 0 0 1 0 0 0 0 1 0 1││
│6,0           ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│6,12          ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│4,1           ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│0,13          ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│10,12         ││ │  │0 0 0 0 0 0 0 0 0 0 0││
│3,4           ││ │  │0 1 0 0 0 0 1 0 1 1 0││
│3,0           ││ │  │0 0 0 0 1 0 0 0 0 0 0││
│8,4           ││ │  │0 0 0 0 0 0 1 0 0 0 1││
│1,10          ││ │  │1 0 0 0 0 0 0 0 0 0 0││
│2,14          ││ │  │1 0 1 0 0 0 0 0 0 0 0││
│8,10          │└─┴──┴─────────────────────┘│
│9,0           │                            │
│              │                            │
│fold along y=7│                            │
│fold along x=5│                            │
└──────────────┴────────────────────────────┘
</pre>
</div>
</div>
</div>

<div id="outline-container-org0c7b89a" class="outline-4">
<h4 id="org0c7b89a">General function definitions</h4>
<div class="outline-text-4" id="text-org0c7b89a">
</div>
<div id="outline-container-org37470e6" class="outline-5">
<h5 id="org37470e6">❖ Fold</h5>
<div class="outline-text-5" id="text-org37470e6">
<p>
A generic function to fold along any axis is defined as,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Conjunction to split boolean matrix y by u and v across x and </span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">join resulting submatrices</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = input matrix</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = integer (fold along)</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">u, v = 'selection' verbs =&gt; {., }., {:, }:, m&amp;}</span>
<span style="color: #BA36A5;">fold</span><span style="color: #000000;">=:</span> 2 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'|.@(+./)@(u ,: v)~'</span>
</pre>
</div>

<p>
<code>fold</code> is defined to be consistent with the adapted <a href="#org0f72158">Conventions</a>.
</p>

<p>
This conjunction makes use of the auto fill property of <a href="https://code.jsoftware.com/wiki/Vocabulary/commaco#dyadic">laminate</a>,
</p>

<pre class="example">
┌─────┬────────────────┐
│y    │(}. y) ,: ({. y)│
├─────┼────────────────┤
│0 0 1│0 1 1           │
│0 1 1│1 1 0           │
│1 1 0│0 1 0           │
│0 1 0│                │
│     │0 0 1           │
│     │0 0 0           │
│     │0 0 0           │
└─────┴────────────────┘
</pre>

<p>
that is, <code>,:</code> can be used to split the rows or columns of the matrix into separate sub-matrices of the same size.
</p>
</div>
</div>

<div id="outline-container-org9402c1b" class="outline-5">
<h5 id="org9402c1b">Horizontal and vertical folds</h5>
<div class="outline-text-5" id="text-org9402c1b">
<p>
The horizontal fold is now easily defined by providing the appropriate <code>u</code> and <code>v</code>,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Fold boolean matrix y along rows x</span>
<span style="color: #BA36A5;">foldh</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">|.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">}:</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">{.</span> fold <span style="color: #ff0000;">}.</span>
</pre>
</div>


<pre class="example">
┌─────────┬─────────┬─────────┐
│y        │y foldh 5│y foldh 6│
├─────────┼─────────┼─────────┤
│0 0 1 0 1│0 0 1 0 1│0 0 1 0 1│
│1 1 1 0 0│1 1 1 1 0│1 1 1 0 0│
│1 0 0 0 1│1 1 0 0 1│1 0 0 0 1│
│0 1 1 1 1│0 1 1 1 1│0 1 1 1 1│
│0 0 1 0 0│         │1 1 1 0 1│
│0 1 0 1 1│         │         │
│1 1 0 0 1│         │         │
│0 0 0 1 0│         │         │
└─────────┴─────────┴─────────┘
</pre>

<p>
Note that <code>foldh</code> works as expected only for <code>x &gt;: (# y)</code>.
</p>

<p>
The vertical fold is the horizontal fold on the transposed matrix,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Fold boolean matrix x along columns y</span>
<span style="color: #BA36A5;">foldv</span><span style="color: #000000;">=:</span> foldh<span style="color: #0000ff;">&amp;.</span><span style="color: #ff0000;">|:</span> 
</pre>
</div>

<p>
Lastly, by the convention adopted above, vertical folds are applied to the positive instructions and horizontal folds to the negative instructions,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Fold boolean matrix y along column or row x</span>
<span style="color: #BA36A5;">foldvh</span><span style="color: #000000;">=:</span> foldv<span style="color: #0000ff;">`</span>(<span style="color: #ff0000;">[</span> foldh <span style="color: #ff0000;">|</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>) <span style="color: #0000ff;">@.</span> (0<span style="color: #ff0000;">:</span> <span style="color: #ff0000;">&gt;</span> <span style="color: #ff0000;">]</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org69337f1" class="outline-5">
<h5 id="org69337f1">Origami</h5>
<div class="outline-text-5" id="text-org69337f1">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Recursively apply folds x to boolean matrix y</span>
<span style="color: #BA36A5;">origami</span><span style="color: #000000;">=:</span> (foldvh<span style="color: #00ff00;">~</span>)<span style="color: #0000ff;">&amp;.</span><span style="color: #ff0000;">&gt;</span><span style="color: #00ff00;">/\.</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfa0825c" class="outline-4">
<h4 id="orgfa0825c">Part 1</h4>
<div class="outline-text-4" id="text-orgfa0825c">
</div>
<div id="outline-container-orgfa4f08d" class="outline-5">
<h5 id="orgfa4f08d">Function definition</h5>
<div class="outline-text-5" id="text-orgfa4f08d">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'+/ , &gt; (_2&amp;{) origami y'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f440f9" class="outline-5">
<h5 id="org7f440f9">Test</h5>
<div class="outline-text-5" id="text-org7f440f9">
<div class="org-src-container">
<pre class="src src-j">assert 17 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-13-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd21ff7" class="outline-5">
<h5 id="orgcd21ff7">Solution</h5>
<div class="outline-text-5" id="text-orgcd21ff7">
<div class="org-src-container">
<pre class="src src-j">assert 827 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-13.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org08818c0" class="outline-4">
<h4 id="org08818c0">Part 2</h4>
<div class="outline-text-4" id="text-org08818c0">
</div>
<div id="outline-container-org6430756" class="outline-5">
<h5 id="org6430756">Function definition</h5>
<div class="outline-text-5" id="text-org6430756">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> 3 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'_ * -. &gt; @ {. origami y'</span>
</pre>
</div>
</div>
</div>
