solutions.org
** [[https://adventofcode.com/2021/day/14][Day 14: Extended Polymerization]]                                            

#+TOC: headlines 2 local

*** Setup

#+BEGIN_SRC j :results output silent
cocurrent <'day14'
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day14.ijs
load <'utils.ijs'  NB. readin
#+END_SRC

*** Read data

#+BEGIN_SRC j :results output silent :tangle src/day14.ijs
getin=: ((0&{::)@{.@] ; <@([: _2&(<\)"1 [: (0 1 0 6 6 1 { ])&> 2&}.))@(<"1 readin@])
#+END_SRC

=getin= creates a 2-element boxed list,

+ The first element is the template string.
+ The second element is a 3-column boxed array of the /expanded/ rules,
    - The first column is the *source-molecule-pairs*
    - The second and third columns are the corresponding *reaction-product-molecule-pairs*,

#+BEGIN_SRC j :results output value :exports results
y=. 'inputs/day-14-example.txt'
(".&.> ,:~ ]) ('] readin y'; 'getin y')
#+END_SRC

#+RESULTS:
#+begin_example
┌──────────┬─────────────────┐
│] readin y│getin y          │
├──────────┼─────────────────┤
│NNCB      │┌────┬──────────┐│
│          ││NNCB│┌──┬──┬──┐││
│CH -> B   ││    ││CH│CB│BH│││
│HH -> N   ││    │├──┼──┼──┤││
│CB -> H   ││    ││HH│HN│NH│││
│NH -> C   ││    │├──┼──┼──┤││
│HB -> C   ││    ││CB│CH│HB│││
│HC -> B   ││    │├──┼──┼──┤││
│HN -> C   ││    ││NH│NC│CH│││
│NN -> C   ││    │├──┼──┼──┤││
│BH -> H   ││    ││HB│HC│CB│││
│NC -> B   ││    │├──┼──┼──┤││
│NB -> B   ││    ││HC│HB│BC│││
│BN -> B   ││    │├──┼──┼──┤││
│BB -> N   ││    ││HN│HC│CN│││
│BC -> B   ││    │├──┼──┼──┤││
│CC -> N   ││    ││NN│NC│CN│││
│CN -> C   ││    │├──┼──┼──┤││
│          ││    ││BH│BH│HH│││
│          ││    │├──┼──┼──┤││
│          ││    ││NC│NB│BC│││
│          ││    │├──┼──┼──┤││
│          ││    ││NB│NB│BB│││
│          ││    │├──┼──┼──┤││
│          ││    ││BN│BB│BN│││
│          ││    │├──┼──┼──┤││
│          ││    ││BB│BN│NB│││
│          ││    │├──┼──┼──┤││
│          ││    ││BC│BB│BC│││
│          ││    │├──┼──┼──┤││
│          ││    ││CC│CN│NC│││
│          ││    │├──┼──┼──┤││
│          ││    ││CN│CC│CN│││
│          ││    │└──┴──┴──┘││
│          │└────┴──────────┘│
└──────────┴─────────────────┘
#+end_example

*** General function definitions

This problem is almost identical to [[https://adventofcode.com/2021/day/6][Day 06: Lanternfish]] , except that the stochastic matrix now has to be constructed automatically.

***** Stochastic matrix

The (transpose of) stochastic matrix is obtained by looking up the positions of the product-pairs in the source-pair sequence,

#+BEGIN_SRC j :results output silent :tangle src/day14.ijs 
NB. Create a stochastic matrix from y
NB. y = boxed table of rules
NB.     column 1 = source molecule pairs
NB.     column 2 and 3 = product molecule pairs
stoctrix=: [: |: {."1 e./"1 }."1
#+END_SRC

For the example in the problem, the stochastic matrix is,

#+BEGIN_SRC j :results output value :exports results
't r'=. getin 'inputs/day-14-example.txt'
stoctrix r
#+END_SRC

#+RESULTS:
#+begin_example
0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0
1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0
0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 1 0 0 1 0 0 0 0 0 0 0 0 0 0
0 0 0 0 1 0 1 0 0 0 0 0 0 0 0 0
0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
1 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0
0 0 0 1 0 0 0 1 0 0 0 0 0 0 1 0
0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 0
0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0
0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0
0 0 0 0 0 1 0 0 0 1 0 0 0 1 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1
0 0 0 0 0 0 1 1 0 0 0 0 0 0 1 1
#+end_example

This is better visualized with the source-pair labels,

#+BEGIN_SRC j :results output value :exports results
't r'=. getin 'inputs/day-14-example.txt'
(a: , |: {."1 r) ,. (|: {."1 r) , (<"0 stoctrix r)
#+END_SRC

#+RESULTS:
#+begin_example
┌──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┐
│  │CH│HH│CB│NH│HB│HC│HN│NN│BH│NC│NB│BN│BB│BC│CC│CN│
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CH│0 │0 │1 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HH│0 │0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CB│1 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NH│0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HB│0 │0 │1 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HC│0 │0 │0 │0 │1 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HN│0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NN│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BH│1 │0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NC│0 │0 │0 │1 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │1 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NB│0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │1 │0 │1 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BN│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │1 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BB│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │1 │0 │1 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BC│0 │0 │0 │0 │0 │1 │0 │0 │0 │1 │0 │0 │0 │1 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CC│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CN│0 │0 │0 │0 │0 │0 │1 │1 │0 │0 │0 │0 │0 │0 │1 │1 │
└──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┘
#+end_example

Column =CH= has ones in locations of =CB= and =BH=, since =CH -> CB, BH=. Column =HH= has ones in locations of =HN= and =NH=, 
since =HH -> HN, NH= and so on for each rule.

