docs/index.html

<div id="outline-container-org2be668b" class="outline-5">
<h5 id="org2be668b">Solution</h5>
<div class="outline-text-5" id="text-org2be668b">
<div class="org-src-container">
<pre class="src src-j">part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-13.txt'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">EAHKRECP</span>
</pre>
</div>

<pre class="example">
0 0 0 0 _ _ 0 0 _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 _ _ 0 0 0 0 _ _ 0 0 _ _ 0 0 0 _ _
0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ _ 0 _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _
0 0 0 _ _ 0 _ _ 0 _ 0 0 0 0 _ 0 0 _ _ _ 0 _ _ 0 _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ 0 _
0 _ _ _ _ 0 0 0 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 0 0 _ _ 0 _ _ _ _ 0 _ _ _ _ 0 0 0 _ _
0 _ _ _ _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ _ _ _ 0 _ _ 0 _ 0 _ _ _ _
0 0 0 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 _ _ 0 _ 0 0 0 0 _ _ 0 0 _ _ 0 _ _ _ _

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org82096b9" class="outline-2">
<h2 id="org82096b9"><a href="https://adventofcode.com/2021/day/14">Day 14: Extended Polymerization</a></h2>
<div class="outline-text-2" id="text-org82096b9">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdc1b637">Setup</a></li>
<li><a href="#org9c69462">Read data</a></li>
<li><a href="#org10881ff">General function definitions</a></li>
<li><a href="#org146db90">Part 1</a>
<ul>
<li><a href="#orgaa755af">Function definition</a></li>
<li><a href="#orgf9a074a">Test</a></li>
<li><a href="#orgcef3751">Solution</a></li>
</ul>
</li>
<li><a href="#org2a2c5c5">Part 2</a>
<ul>
<li><a href="#org76ce387">Function definition</a></li>
<li><a href="#org1a7fedb">Test</a></li>
<li><a href="#org1af04b0">Solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdc1b637" class="outline-3">
<h3 id="orgdc1b637">Setup</h3>
<div class="outline-text-3" id="text-orgdc1b637">
<div class="org-src-container">
<pre class="src src-j">cocurrent <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'day14'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j">load <span style="color: #ff0000;">&lt;</span><span style="color: #008000;">'utils.ijs'</span>  <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">readin</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c69462" class="outline-3">
<h3 id="org9c69462">Read data</h3>
<div class="outline-text-3" id="text-org9c69462">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">getin</span><span style="color: #000000;">=:</span> ((0<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">{::</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">{.</span><span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span> <span style="color: #ff0000;">;</span> <span style="color: #ff0000;">&lt;</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">[:</span> _2<span style="color: #0000ff;">&amp;</span>(<span style="color: #ff0000;">&lt;</span><span style="color: #00ff00;">\</span>)<span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">[:</span> (0 1 0 6 6 1 <span style="color: #ff0000;">{</span> <span style="color: #ff0000;">]</span>)<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">&gt;</span> 2<span style="color: #0000ff;">&amp;</span><span style="color: #ff0000;">}.</span>))<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">&lt;</span><span style="color: #0000ff;">"</span>1 readin<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>)
</pre>
</div>

<p>
<code>getin</code> creates a 2-element boxed list,
</p>

<ul class="org-ul">
<li>The first element is the template string.</li>
<li>The second element is a 3-column boxed array of the <i>expanded</i> rules,
<ul class="org-ul">
<li>The first column is the <b>source-molecule-pairs</b></li>
<li>The second and third columns are the corresponding <b>reaction-product-molecule-pairs</b>,</li>
</ul></li>
</ul>

<pre class="example">
┌──────────┬─────────────────┐
│] readin y│getin y          │
├──────────┼─────────────────┤
│NNCB      │┌────┬──────────┐│
│          ││NNCB│┌──┬──┬──┐││
│CH -&gt; B   ││    ││CH│CB│BH│││
│HH -&gt; N   ││    │├──┼──┼──┤││
│CB -&gt; H   ││    ││HH│HN│NH│││
│NH -&gt; C   ││    │├──┼──┼──┤││
│HB -&gt; C   ││    ││CB│CH│HB│││
│HC -&gt; B   ││    │├──┼──┼──┤││
│HN -&gt; C   ││    ││NH│NC│CH│││
│NN -&gt; C   ││    │├──┼──┼──┤││
│BH -&gt; H   ││    ││HB│HC│CB│││
│NC -&gt; B   ││    │├──┼──┼──┤││
│NB -&gt; B   ││    ││HC│HB│BC│││
│BN -&gt; B   ││    │├──┼──┼──┤││
│BB -&gt; N   ││    ││HN│HC│CN│││
│BC -&gt; B   ││    │├──┼──┼──┤││
│CC -&gt; N   ││    ││NN│NC│CN│││
│CN -&gt; C   ││    │├──┼──┼──┤││
│          ││    ││BH│BH│HH│││
│          ││    │├──┼──┼──┤││
│          ││    ││NC│NB│BC│││
│          ││    │├──┼──┼──┤││
│          ││    ││NB│NB│BB│││
│          ││    │├──┼──┼──┤││
│          ││    ││BN│BB│BN│││
│          ││    │├──┼──┼──┤││
│          ││    ││BB│BN│NB│││
│          ││    │├──┼──┼──┤││
│          ││    ││BC│BB│BC│││
│          ││    │├──┼──┼──┤││
│          ││    ││CC│CN│NC│││
│          ││    │├──┼──┼──┤││
│          ││    ││CN│CC│CN│││
│          ││    │└──┴──┴──┘││
│          │└────┴──────────┘│
└──────────┴─────────────────┘
</pre>
</div>
</div>

<div id="outline-container-org10881ff" class="outline-3">
<h3 id="org10881ff">General function definitions</h3>
<div class="outline-text-3" id="text-org10881ff">
<p>
This problem is almost identical to <a href="https://adventofcode.com/2021/day/6">Day 06: Lanternfish</a> , except that the stochastic matrix now has to be constructed automatically.
</p>
</div>

<div id="outline-container-org6b06079" class="outline-5">
<h5 id="org6b06079">Stochastic matrix</h5>
<div class="outline-text-5" id="text-org6b06079">
<p>
The (transpose of) stochastic matrix is obtained by looking up the positions of the product-pairs in the source-pair sequence,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Create a stochastic matrix from y</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = boxed table of rules</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">column 1 = source molecule pairs</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">column 2 and 3 = product molecule pairs</span>
<span style="color: #BA36A5;">stoctrix</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">|:</span> <span style="color: #ff0000;">{.</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">e.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 <span style="color: #ff0000;">}.</span><span style="color: #0000ff;">"</span>1
</pre>
</div>

<p>
For the example in the problem, the stochastic matrix is,
</p>

<pre class="example">
0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0
1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0
0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 1 0 0 1 0 0 0 0 0 0 0 0 0 0
0 0 0 0 1 0 1 0 0 0 0 0 0 0 0 0
0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
1 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0
0 0 0 1 0 0 0 1 0 0 0 0 0 0 1 0
0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 0
0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0
0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0
0 0 0 0 0 1 0 0 0 1 0 0 0 1 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1
0 0 0 0 0 0 1 1 0 0 0 0 0 0 1 1
</pre>

<p>
This is better visualized with the source-pair labels,
</p>

<pre class="example">
┌──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┐
│  │CH│HH│CB│NH│HB│HC│HN│NN│BH│NC│NB│BN│BB│BC│CC│CN│
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CH│0 │0 │1 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HH│0 │0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CB│1 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NH│0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HB│0 │0 │1 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HC│0 │0 │0 │0 │1 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│HN│0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NN│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BH│1 │0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NC│0 │0 │0 │1 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │1 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NB│0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │1 │0 │1 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BN│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │1 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BB│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │1 │0 │1 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│BC│0 │0 │0 │0 │0 │1 │0 │0 │0 │1 │0 │0 │0 │1 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CC│0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CN│0 │0 │0 │0 │0 │0 │1 │1 │0 │0 │0 │0 │0 │0 │1 │1 │
└──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┘
</pre>

<p>
Column <code>CH</code> has ones in locations of <code>CB</code> and <code>BH</code>, since <code>CH -&gt; CB, BH</code>. Column <code>HH</code> has ones in locations of <code>HN</code> and <code>NH</code>, 
since <code>HH -&gt; HN, NH</code> and so on for each rule.
</p>
</div>
</div>
