solutions.org
***** Response (template) matrix

#+BEGIN_SRC j :results output silent :tangle src/day14.ijs 
NB. Create response vectors for each template pair
NB. y = template string
NB. x = source molecule pairs
tmpltrix=: ({."1)@[ e./"1 0 (2&(<\)@])
#+END_SRC

The problem is linearly separable, so each template-pair can be expanded independently and the results accumulated at the end.

=templtrix= finds locations of each of the template-pairs in the source-pairs,

#+BEGIN_SRC j :results output value :exports results
't r'=. getin 'inputs/day-14-example.txt'
r tmpltrix t
#+END_SRC

#+RESULTS:
: 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0
: 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
: 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0

which is better visualized with both the source-pair and template-pair labels,

#+BEGIN_SRC j :results output value :exports results
't r'=. getin 'inputs/day-14-example.txt'
(a: , {."1 r) , (2&(<\) t) ,. (<"0 r tmpltrix t)
#+END_SRC

#+RESULTS:
: ┌──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┐
: │  │CH│HH│CB│NH│HB│HC│HN│NN│BH│NC│NB│BN│BB│BC│CC│CN│
: ├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
: │NN│0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │
: ├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
: │NC│0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │
: ├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
: │CB│0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
: └──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┘

This approach (of creating response vectors for each individual template-pair) works even when the template string contains duplicate pairs.

***** Matrix operations

#+BEGIN_SRC j :results output silent :tangle src/day14.ijs 
NB. Matrix product
mp=: +/ . *
#+END_SRC

#+BEGIN_SRC j :results output silent :tangle src/day14.ijs 
NB. Raise matrix to nth power
mpow=: 4 : 'mp/ mp~^:(I.|.#:y) x'
#+END_SRC

***** Polymerize reaction

#+BEGIN_SRC j :results output silent :tangle src/day14.ijs 
NB. Get count of reaction products for each template-pair 
NB. using rules for y generations
NB. y = number of generations
NB. x = two-element boxed array (as returned by 'getin')
NB.     first element = template string
NB.     second element = 3-column boxed table of rules
polymerize=: 4 : '(((stoctrix r) mpow y) mp ])"1 (r tmpltrix t) [ ''t r''=. x' NB. t = template, r = rules
#+END_SRC

#+BEGIN_SRC j :results output value :exports results
y=. getin 'inputs/day-14-example.txt'
(".&.> ,.~ ]) ('y polymerize 1'; 'y polymerize 5'; 'y polymerize 10')
#+END_SRC

#+RESULTS:
#+begin_example
┌───────────────┬──────────────────────────────────────────────────┐
│y polymerize 1 │0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1                   │
│               │0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0                   │
│               │1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0                   │
├───────────────┼──────────────────────────────────────────────────┤
│y polymerize 5 │0 0 0 0 0 0 0 0 0 2  7  4  8 3 3 5                │
│               │0 0 0 0 0 0 0 0 0 0 11 10 10 1 0 0                │
│               │6 3 0 1 8 1 1 0 3 1  1  1  1 4 0 1                │
├───────────────┼──────────────────────────────────────────────────┤
│y polymerize 10│ 0  0   0  0  0  0  0 0  0 21 308 274 298 34 34 55│
│               │ 0  0   0  0  0  0  0 0  0  0 341 340 342  1  0  0│
│               │21 32 115 27 26 76 27 0 81 21 147 121 172 85 26 47│
└───────────────┴──────────────────────────────────────────────────┘
#+end_example

