docs/index.html

<div id="outline-container-org08744e5" class="outline-5">
<h5 id="org08744e5">Response (template) matrix</h5>
<div class="outline-text-5" id="text-org08744e5">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Create response vectors for each template pair</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = template string</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = source molecule pairs</span>
<span style="color: #BA36A5;">tmpltrix</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">{.</span><span style="color: #0000ff;">"</span>1)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">[</span> <span style="color: #ff0000;">e.</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">"</span>1 0 (2<span style="color: #0000ff;">&amp;</span>(<span style="color: #ff0000;">&lt;</span><span style="color: #00ff00;">\</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>)
</pre>
</div>

<p>
The problem is linearly separable, so each template-pair can be expanded independently and the results accumulated at the end.
</p>

<p>
<code>templtrix</code> finds locations of each of the template-pairs in the source-pairs,
</p>

<pre class="example">
0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0

</pre>

<p>
which is better visualized with both the source-pair and template-pair labels,
</p>

<pre class="example">
┌──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┐
│  │CH│HH│CB│NH│HB│HC│HN│NN│BH│NC│NB│BN│BB│BC│CC│CN│
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NN│0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│NC│0 │0 │0 │0 │0 │0 │0 │0 │0 │1 │0 │0 │0 │0 │0 │0 │
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│CB│0 │0 │1 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │0 │
└──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┘

</pre>

<p>
This approach (of creating response vectors for each individual template-pair) works even when the template string contains duplicate pairs.
</p>
</div>
</div>

<div id="outline-container-orgaeeeb35" class="outline-5">
<h5 id="orgaeeeb35">Matrix operations</h5>
<div class="outline-text-5" id="text-orgaeeeb35">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Matrix product</span>
<span style="color: #BA36A5;">mp</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span> <span style="color: #00ff00;">.</span> <span style="color: #ff0000;">*</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Raise matrix to nth power</span>
<span style="color: #BA36A5;">mpow</span><span style="color: #000000;">=:</span> 4 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'mp/ mp~^:(I.|.#:y) x'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3621285" class="outline-5">
<h5 id="org3621285">Polymerize reaction</h5>
<div class="outline-text-5" id="text-org3621285">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Get count of reaction products for each template-pair </span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">using rules for y generations</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = number of generations</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = two-element boxed array (as returned by 'getin')</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">first element = template string</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">second element = 3-column boxed table of rules</span>
<span style="color: #BA36A5;">polymerize</span><span style="color: #000000;">=:</span> 4 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'(((stoctrix r) mpow y) mp ])"1 (r tmpltrix t) [ ''t r''=. x'</span> <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">t = template, r = rules</span>
</pre>
</div>

<pre class="example">
┌───────────────┬──────────────────────────────────────────────────┐
│y polymerize 1 │0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1                   │
│               │0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0                   │
│               │1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0                   │
├───────────────┼──────────────────────────────────────────────────┤
│y polymerize 5 │0 0 0 0 0 0 0 0 0 2  7  4  8 3 3 5                │
│               │0 0 0 0 0 0 0 0 0 0 11 10 10 1 0 0                │
│               │6 3 0 1 8 1 1 0 3 1  1  1  1 4 0 1                │
├───────────────┼──────────────────────────────────────────────────┤
│y polymerize 10│ 0  0   0  0  0  0  0 0  0 21 308 274 298 34 34 55│
│               │ 0  0   0  0  0  0  0 0  0  0 341 340 342  1  0  0│
│               │21 32 115 27 26 76 27 0 81 21 147 121 172 85 26 47│
└───────────────┴──────────────────────────────────────────────────┘
</pre>
</div>
</div>
