docs/index.html

<div id="outline-container-org31955b9" class="outline-5">
<h5 id="org31955b9">Summarize element counts</h5>
<div class="outline-text-5" id="text-org31955b9">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Summarize count of elements in source molecule pairs after y generations</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = number of generations</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = two-element boxed array (as returned by 'getin')</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">first element = template string</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">second element = 3-column boxed table of rules</span>
<span style="color: #BA36A5;">summarize</span><span style="color: #000000;">=:</span> 4 <span style="color: #ff0000;">:</span> <span style="color: #008000;">'(r addendum t) + ({.&amp;.&gt; {."1 r) +//. y [ ''t r''=. x'</span> <span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">t = template, r = rules</span>
</pre>
</div>

<p>
where,
</p>

<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Finds last element of template string in source molecule pairs</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Used in 'summarize' function</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = template string</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = 3-column boxed table of rules</span>
<span style="color: #BA36A5;">addendum</span><span style="color: #000000;">=:</span> (<span style="color: #ff0000;">[:</span> <span style="color: #ff0000;">~.</span> (<span style="color: #ff0000;">{.</span><span style="color: #0000ff;">&amp;.</span><span style="color: #ff0000;">&gt;</span>)<span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">{.</span><span style="color: #0000ff;">"</span>1)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">[</span>) <span style="color: #ff0000;">e.</span> <span style="color: #ff0000;">{:</span><span style="color: #0000ff;">@</span>(<span style="color: #ff0000;">;</span><span style="color: #00ff00;">/</span>)<span style="color: #0000ff;">@</span><span style="color: #ff0000;">]</span>
</pre>
</div>

<p>
The element counts can be obtained either from the first or last elements of the source molecule pairs. <code>summarize</code> uses the first (head), 
of the source molecule pairs,
</p>

<pre class="example">
┌──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┐
│CH│HH│CB│NH│HB│HC│HN│NN│BH│NC│NB│BN│BB│BC│CC│CN│
├──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┼──┤
│C │H │C │N │H │H │H │N │B │N │N │B │B │B │C │C │
└──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┘

</pre>

<p>
However, this will miss the single count from the <i>last</i> element in the template string. <code>addendum</code> finds this,
</p>

<pre class="example">
┌───────────────┬─────────────────────────────────────────────────┐
│t              │NNCB                                             │
├───────────────┼─────────────────────────────────────────────────┤
│, {."1 r       │┌──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┬──┐│
│               ││CH│HH│CB│NH│HB│HC│HN│NN│BH│NC│NB│BN│BB│BC│CC│CN││
│               │└──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┴──┘│
├───────────────┼─────────────────────────────────────────────────┤
│~. {.&amp;.&gt; {."1 r│┌─┬─┬─┬─┐                                        │
│               ││C│H│N│B│                                        │
│               │└─┴─┴─┴─┘                                        │
├───────────────┼─────────────────────────────────────────────────┤
│;/ t           │┌─┬─┬─┬─┐                                        │
│               ││N│N│C│B│                                        │
│               │└─┴─┴─┴─┘                                        │
├───────────────┼─────────────────────────────────────────────────┤
│r addendum t   │0 0 0 1                                          │
└───────────────┴─────────────────────────────────────────────────┘
</pre>

<p>
and adds it to the summary.
</p>

<p>
Note that if the last elements of the source molecule pairs had been used, then the count from the <i>first</i> element of the template string would
have to be added back to the summary.
</p>
</div>
</div>

<div id="outline-container-org08efd89" class="outline-5">
<h5 id="org08efd89">Range</h5>
<div class="outline-text-5" id="text-org08efd89">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">Finds range (max - min) of element counts after y generations</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">y = number of generations</span>
<span style="color: #8D8D84;">NB. </span><span style="color: #8D8D84; font-style: italic;">x = input as returned by getin</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">first element = template string</span>
<span style="color: #8D8D84;">NB.     </span><span style="color: #8D8D84; font-style: italic;">second element = 3-column boxed table of rules        </span>
<span style="color: #BA36A5;">range</span><span style="color: #000000;">=:</span> <span style="color: #ff0000;">[:</span> (<span style="color: #ff0000;">&gt;.</span><span style="color: #00ff00;">/</span> <span style="color: #ff0000;">-</span> <span style="color: #ff0000;">&lt;.</span><span style="color: #00ff00;">/</span>) <span style="color: #ff0000;">[:</span> (<span style="color: #ff0000;">]</span> <span style="color: #ff0000;">#</span><span style="color: #00ff00;">~</span> 0<span style="color: #ff0000;">:</span> <span style="color: #ff0000;">&lt;</span> <span style="color: #ff0000;">]</span>) <span style="color: #ff0000;">[</span> summarize <span style="color: #ff0000;">+</span><span style="color: #00ff00;">/</span><span style="color: #0000ff;">@:</span>polymerize
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org146db90" class="outline-3">
<h3 id="org146db90">Part 1</h3>
<div class="outline-text-3" id="text-org146db90">
</div>
<div id="outline-container-orgaa755af" class="outline-4">
<h4 id="orgaa755af">Function definition</h4>
<div class="outline-text-4" id="text-orgaa755af">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part1</span><span style="color: #000000;">=:</span> range<span style="color: #0000ff;">&amp;</span>10
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9a074a" class="outline-4">
<h4 id="orgf9a074a">Test</h4>
<div class="outline-text-4" id="text-orgf9a074a">
<div class="org-src-container">
<pre class="src src-j">assert 1588 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-14-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcef3751" class="outline-4">
<h4 id="orgcef3751">Solution</h4>
<div class="outline-text-4" id="text-orgcef3751">
<div class="org-src-container">
<pre class="src src-j">assert 3406 <span style="color: #ff0000;">=</span> part1 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-14.txt'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2a2c5c5" class="outline-3">
<h3 id="org2a2c5c5">Part 2</h3>
<div class="outline-text-3" id="text-org2a2c5c5">
</div>
<div id="outline-container-org76ce387" class="outline-4">
<h4 id="org76ce387">Function definition</h4>
<div class="outline-text-4" id="text-org76ce387">
<div class="org-src-container">
<pre class="src src-j"><span style="color: #BA36A5;">part2</span><span style="color: #000000;">=:</span> range<span style="color: #0000ff;">&amp;</span>40
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a7fedb" class="outline-4">
<h4 id="org1a7fedb">Test</h4>
<div class="outline-text-4" id="text-org1a7fedb">
<div class="org-src-container">
<pre class="src src-j">assert 2188189693529 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">inx</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-14-example.txt'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1af04b0" class="outline-4">
<h4 id="org1af04b0">Solution</h4>
<div class="outline-text-4" id="text-org1af04b0">
<div class="org-src-container">
<pre class="src src-j">assert 3941782230241 <span style="color: #ff0000;">=</span> part2 <span style="color: #BA36A5;">in</span><span style="color: #000000;">=.</span> getin <span style="color: #008000;">'inputs/day-14.txt'</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-12-01</p>
<p class="author">Author: Prashanth Kumar</p>
<p class="date">Created: 2022-02-18 Fri 14:16</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
